{
  "reviews": [{
    "reviewer": {
      "displayName": "Simone Haddad"
    },
    "starRating": "FIVE",
    "comment": "I had the opportunity of stumbling across Cocoon in Canggu. I have always had the urge to do a colonic and decided to go ahead with nurse Kathleen. Santi and Weby were so informative when I first walked in and gave me all the information. I was able to make the decision easier. I highly recommend nurse Kathleen for her gentle approach and guidance through what is an uncomfortable procedure. Santi and Weby make you feel like family.10/10 genuine kind service.",
    "createTime": "2025-09-04T03:55:30.532110Z",
    "updateTime": "2025-09-04T03:55:30.532110Z",
    "reviewReply": {
      "comment": "Hi Simone, thank you for sharing your wonderful experience! \nWe’re so glad you felt well cared for by Kathleen, Santi, and Weby, and that their support made the treatment comfortable for you. Your recommendation means a lot to us, and we’re delighted you felt at home with our team. We look forward to welcoming you back to Cocoon Canggu again soon 💙\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T04:25:56.264852Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21VNU0yTmFla2hvV25KSlozVnhVVFpHWWxSSWFFRRAB"
  }, {
    "reviewer": {
      "displayName": "sikarini niluh"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) The staff are all friendly\nThe treatment is good and excellent\nThank you Ms. Tini, Ms. Weby, Ms. Santi\nThe best anyway😊😊🔥🔥\n\n(Original)\nStaf nya ramah” semua\nTreatnenya bagus dan execelet\nThank you mbaj tini mbak weby mbak santi\nThe best pokoknya😊😊🔥🔥",
    "createTime": "2025-09-04T03:37:12.770494Z",
    "updateTime": "2025-09-04T03:37:12.770494Z",
    "reviewReply": {
      "comment": "Hi Bu Sika, thank you so much for your wonderful review! \nWe’re happy to hear you enjoyed your treatment and felt well taken care of by Tini, Weby, and Santi. Your kind words mean a lot, and we can’t wait to welcome you back again soon\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T03:38:44.863979Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xGNmMwUlBUREJYTjNaclJYZzRSWFExVGtWR1gzYxAB"
  }, {
    "reviewer": {
      "displayName": "Lea Briesach"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) I am delighted with the experience, I came to have my first lip injections, I was anxious and everything went better than I had imagined with Dr. Eva, I didn\u0027t have any pain at all and the team knew how to put me at ease. I just had them done and I am already delighted with the result. They offered me water with honey as I tend to feel unwell and a collagen mask to thank me. I felt even better than in the institutes in France. Thank you again 🤍\n\n(Original)\nJe suis ravie de l’expérience, je suis venue pour faire mes premières injections aux lèvres, j’étais anxieuse et tout s’est passé mieux que je l’avais imaginé avec le docteur Eva, je n’ai pas eu mal du tout et l’équipe a su me mettre en confiance. Je viens de les faire et je suis déjà ravie du résultat. Ils m’ont offert de l’eau avec du miel comme j’ai tendance à faire des malaises et un masque au collagène pour me remercier. Je me suis sentie encore mieux que dans les instituts en France. Merci encore 🤍",
    "createTime": "2025-09-03T06:57:02.938762Z",
    "updateTime": "2025-09-03T06:58:51.286196Z",
    "reviewReply": {
      "comment": "Bonjour Lea,\nWe’re so happy to hear that Dr. Eva and our team helped you feel comfortable and at ease during your first lip injections. It means a lot to know you felt cared for and appreciated the little touches we added to your visit. We’re delighted you’re already happy with your results and we look forward to welcoming you back soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T03:07:37.351572Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21OeVUxbEpaRmxtVlVWcVdWaFZTQzFCVmt0YWJIYxAB"
  }, {
    "reviewer": {
      "displayName": "Noemie Marionnet"
    },
    "starRating": "FIVE",
    "comment": "Very good service and also friendly Staff. Kathleen is gentle, will go back ❤️",
    "createTime": "2025-09-03T05:53:43.958838Z",
    "updateTime": "2025-09-03T05:53:43.958838Z",
    "reviewReply": {
      "comment": "Hi Noemie, thank you for your lovely review! \nWe’re so glad you enjoyed your experience and that Kathleen made you feel comfortable. We look forward to welcoming you back again soon ❤️\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T02:57:18.313952Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25GcU5XNUViemhCV21kME5YSmhNbEZITWpWdGRuYxAB"
  }, {
    "reviewer": {
      "displayName": "Amy Baber"
    },
    "starRating": "FIVE",
    "comment": "Highly professional team. I have Dr Eva, Kathleen and Ria. They went above and beyond to explain each procedure and comfortably walk me through it all. Highly recommend the facility and staff at Coocoon Canggu!",
    "createTime": "2025-09-03T05:15:24.469880Z",
    "updateTime": "2025-09-03T05:15:24.469880Z",
    "reviewReply": {
      "comment": "Hi Amy, thank you so much for your kind words! \nWe’re delighted to hear that Dr. Eva, Kathleen, and Ria made you feel comfortable and well cared for. Your recommendation means a lot to our team, and we look forward to welcoming you back to Cocoon Canggu again soon! 💙\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T02:56:27.782999Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21GT2FGSkJjVTVJUlZCV05FOUpNekI0YVVaRE4zYxAB"
  }, {
    "reviewer": {
      "displayName": "amanda mcanulty"
    },
    "starRating": "FIVE",
    "comment": "I had the RF microneedling done here. Everything was great, from Miranda who booked my appointment for me, to the reception staff and the doctor.\n\nBefore the procedure the doctor explained everything to me and asked if I had any questions.\n\nI\u0027m looking forward to seeing the results",
    "createTime": "2025-09-02T07:59:47.522452Z",
    "updateTime": "2025-09-02T07:59:47.522452Z",
    "reviewReply": {
      "comment": "Thank you so much, Amanda, for sharing your experience! We’re glad to hear that Miranda, our reception team, and the doctor all made your visit smooth and comfortable. It’s wonderful that you felt well informed before your RF microneedling procedure. We look forward to welcoming you back soon and hope you’ll love your results.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-03T05:50:20.748275Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xsT2MwZGtTVVpvVG05SldVRjFiMDB0WVVSelVXYxAB"
  }, {
    "reviewer": {
      "displayName": "Alex"
    },
    "starRating": "FIVE",
    "comment": "Spectacular service all around 10/10. Ask for Tini, Weby or Kathlen!",
    "createTime": "2025-09-02T07:57:43.290045Z",
    "updateTime": "2025-09-02T07:57:43.290045Z",
    "reviewReply": {
      "comment": "Thank you so much, Alex, for your kind words! We’re happy to know you had such a great experience and truly appreciate your 10/10 rating. We’ll make sure Tini, Weby, and Kathleen see your lovely feedback. We look forward to welcoming you back to Cocoon Canggu soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-03T05:43:17.022354Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tKNVlYWk5iR1JaYkROVFNVNVNNRkZSWlhsR1ExRRAB"
  }, {
    "reviewer": {
      "displayName": "Louise Sheppard"
    },
    "starRating": "FIVE",
    "comment": "Had the most amazing experience with Nurse Kathleen and receptionist Weby\nVery professional and knowledgeable and made me feel at home.\nHighly recommmend",
    "createTime": "2025-09-02T04:52:02.548526Z",
    "updateTime": "2025-09-02T04:52:02.548526Z",
    "reviewReply": {
      "comment": "Thank you so much, Louise, for sharing your experience! We’re so pleased to hear that Kathleen and Weby made you feel at home with their professionalism and care. Your recommendation means a lot to us, and we look forward to welcoming you back to Cocoon Canggu soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-03T05:41:01.195100Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xsVWEyZzFhRGhpWVVkblRWcFBUM0JaY2pKYWVuYxAB"
  }, {
    "reviewer": {
      "displayName": "Melisa Om"
    },
    "starRating": "FIVE",
    "comment": "I love Cocoon! First time in Canggu and they did not disappoint. I love the staff’s kindness and professionalism. Weby was at the front desk and I got the best massage from Kathleen during my colontherapy. I also appreciate that it’s located in the heart of Canggu. Will come back here for sure! By the way- I think their colontherapies are the best on the island!",
    "createTime": "2025-09-01T06:56:33.619371Z",
    "updateTime": "2025-09-01T06:56:33.619371Z",
    "reviewReply": {
      "comment": "Thank you so much, Melisa, for your wonderful review! We’re so glad your first visit to Cocoon Canggu was a great experience. It’s lovely to hear that Weby made you feel welcome at the front desk and that Kathleen gave you such a relaxing massage during your colon therapy. We truly appreciate your kind words about our team and treatments, and we can’t wait to welcome you back soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-03T05:40:09.309634Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21kNE5IWjRSMTlZU0VZeGRrZEViRWRUTmtKcVEyYxAB"
  }, {
    "reviewer": {
      "displayName": "margaux fety"
    },
    "starRating": "FIVE",
    "comment": "Had the best experience in the Canggu branch, my hydra facial was perfect ! I met Tini and Weby from the team and they were perfect 👌🏻✨",
    "createTime": "2025-09-01T04:53:20.552107Z",
    "updateTime": "2025-09-01T04:53:20.552107Z",
    "reviewReply": {
      "comment": "Thank you so much, Margaux, for sharing your experience! We’re delighted to hear you enjoyed your HydraFacial at Cocoon Canggu and that Tini and Weby made your visit special. We’ll be sure to pass along your kind words to them. We can’t wait to welcome you back again soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-03T05:38:56.596738Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25wd1RWbDROekUzZFhSbE5rTkdPR1ZNUjBscFlWRRAB"
  }, {
    "reviewer": {
      "displayName": "Island Goddess"
    },
    "starRating": "FIVE",
    "comment": "How lucky we have Cocoon Spa in Canggu now. Same amazing selection of treatments, friendly service, beautiful space and convenient parking.\n\nBooking was efficient and flexible as I had to shift the day. Miranda was very friendly, responsive and helpful.\n\nI hope to return soon to experience more Cocoon Canggu has to offer.",
    "createTime": "2025-09-01T03:34:32.248193Z",
    "updateTime": "2025-09-01T03:34:32.248193Z",
    "reviewReply": {
      "comment": "Thank you so much, Island Goddess, for your kind words! We’re delighted to hear you enjoyed your visit to Cocoon Canggu and that Miranda could assist you with your booking. It’s wonderful to know you appreciated the treatments, service, and space. We look forward to welcoming you back soon for more Cocoon experiences.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-03T05:37:28.211452Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pkUU5sYzVVREJqYUhVMWFXbDJValpEY0hjd2FFRRAB"
  }, {
    "reviewer": {
      "displayName": "Kate Fox"
    },
    "starRating": "FIVE",
    "comment": "I had the most beautiful visit to Cocoon today for my Botox treatment.. from the minute I walked through the door it was heaven.. lovely cool and calm environment, stunning clean treatment rooms. My treatment was discussed clearly and I was very well looked after my Dr Eva and nurse Ditta.. thank you so much and looking forward to seeing the results 🤩",
    "createTime": "2025-08-30T08:26:23.725727Z",
    "updateTime": "2025-08-30T08:26:23.725727Z",
    "reviewReply": {
      "comment": "Hi Kate, thank you for taking the time to share such a wonderful review! We’re delighted to hear that from the moment you walked in, you felt the calm and welcoming atmosphere, and that Dr. Eva and Nurse Dita made you feel so well cared for. We truly appreciate your trust in us for your Botox treatment and look forward to welcoming you back. \nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-01T03:10:35.557397Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2w4MFJsZERhV3h2YURWYVJWZFVRM1IwWW1wUGNtYxAB"
  }, {
    "reviewer": {
      "displayName": "Mathieu Renaudineau"
    },
    "starRating": "FIVE",
    "comment": "Thank you Kathleen, Tini, Weby.\nVery good treatment and massage. We will come back. Cheers",
    "createTime": "2025-08-29T09:03:53.951223Z",
    "updateTime": "2025-08-29T09:03:53.951223Z",
    "reviewReply": {
      "comment": "Hi Mathieu, \nThank you for sharing your experience! We’re so pleased to hear that Kathleen, Tini, and Weby made your treatment and massage so enjoyable. It’s wonderful to know you plan to come back, we look forward to welcoming you again soon. \n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-01T02:21:40.456935Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xWQlIxWjFUMGhrTWxrdGNWZGpkVUpwWVZFdFMyYxAB"
  }, {
    "reviewer": {
      "displayName": "Stephanie Mederick"
    },
    "starRating": "FIVE",
    "comment": "Ayu and weby, are truly amazing and are very kind.\nThe facial was amazing",
    "createTime": "2025-08-29T09:02:48.866474Z",
    "updateTime": "2025-08-29T09:02:48.866474Z",
    "reviewReply": {
      "comment": "Hi Stephanie, \nThank you for your kind words! We’re so glad to hear that Ayu and Weby made your experience so special and that you enjoyed an amazing facial with Cocoon Canggu. It means a lot to us, and we look forward to welcoming you back again soon for more self-care. \n\nWarm regards,\nCocoon Canggu Team\n",
      "updateTime": "2025-09-01T02:20:22.695906Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xOdFRVWkhSREppTUY5NU5XeEJiVVJzVVRRd2FrRRAB"
  }, {
    "reviewer": {
      "displayName": "Ath"
    },
    "starRating": "FIVE",
    "comment": "I had a few treatments at Cocoon Medical Spa, including the Diamond Microdermabrasion and a full body scrub, and I absolutely love the results! ✨\n\nMy skin feels incredibly fresh, smooth, and glowing. The team is professional and the whole experience was amazing — highly recommend! 💖",
    "createTime": "2025-08-29T08:26:53.396412Z",
    "updateTime": "2025-08-29T08:26:53.396412Z",
    "reviewReply": {
      "comment": "Hi Ath, \nThank you so much for sharing your experience! We’re delighted to hear you loved both the Diamond Microdermabrasion and full body scrub, and that your skin is feeling fresh, smooth, and glowing. ✨ \nIt means a lot to know our team could make your visit such a memorable one. We can’t wait to welcome you back for more pampering soon! \n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-01T02:17:52.396695Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xGT1YwOUZXRXBTYzJFMU0zQXRMVU40ZWxWRFpsRRAB"
  }, {
    "reviewer": {
      "displayName": "Chely nazario"
    },
    "starRating": "FIVE",
    "comment": "I LOVE cocoon but this one especially and Tini was incredible thank you guys for everything x",
    "createTime": "2025-08-28T09:46:12.818241Z",
    "updateTime": "2025-08-28T09:46:12.818241Z",
    "reviewReply": {
      "comment": "Hola Chelita,\n\nMuchas gracias por la reseña.\nWe LOVE having you here! 🥰 Big thanks for the sweet words and for giving Tini a shout-out, she’ll be over the moon. So happy you felt the Cocoon love at Canggu branch. Can’t wait to see you again soon!\nHasta la próxima!\nWarm regards,\nCocoon Canggu Team\n",
      "updateTime": "2025-08-29T08:35:06.142421Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tONVNWTk9ZbTVSU25KVVYzYzJiV1F0YWtWRmNsRRAB"
  }, {
    "reviewer": {
      "displayName": "Kipp Caddy"
    },
    "starRating": "FIVE",
    "comment": "Amazing very relaxing :)",
    "createTime": "2025-08-28T09:46:12.365235Z",
    "updateTime": "2025-08-28T09:46:12.365235Z",
    "reviewReply": {
      "comment": "Thanks, Kipp! \nWe’re so happy you had a relaxing time with us. Hope to see you again soon \nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-29T08:38:07.741602Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT201T05sOVpVRU5TV2xSVVRFSkZOREpyVVhNM2RXYxAB"
  }, {
    "reviewer": {
      "displayName": "Elin van Toor"
    },
    "starRating": "TWO",
    "comment": "(Translated by Google) A beautiful clinic with very friendly staff. However, after having my lip fillers placed, I immediately experienced severe migration above my lip. At first, I thought it was the swelling. But after waiting a few weeks, I went back and indeed, there was migration. Because I was leaving Bali the next day, resolving the issue and re-inserting it wasn\u0027t an option. The manager said they would call me with a solution, but I never received a call again, no response, and now I have lip fillers above my lip. Don\u0027t get your lips done here!\n\n(Original)\nMooie kliniek met erg vriendelijk personeel. Echter na het plaatsen van mijn lip fillers had ik direct last van enorme migratie boven mijn lip, eerst dacht ik zal wel de zwelling zijn. Maar na een paar weken wachten toch terug gegaan en inderdaad migratie. Omdat ik een dag erna Bali weer ging verlaten was oplossen en opnieuw plaatsen geen optie. De manager zou me bellen met een oplossing, ik ben nooit meer gebeld, krijg geen reactie meer en ik heb nu lipfillers boven mijn lip zitten, doe je lippen hier niet!",
    "createTime": "2025-08-26T12:49:43.792223Z",
    "updateTime": "2025-08-26T12:49:43.792223Z",
    "reviewReply": {
      "comment": "Dear Elin,\n\nWe are sorry to hear you are unhappy with your results.\nOur medical records show that during consultation with our doctor, you previously had significant lip filler elsewhere. Our doctor advised that adding more volume could increase the risk of complications, including migration. Despite this professional recommendation, you insisted on additional filler. Our doctor administered a conservative 1ml, advising that this was a safe amount. One week later, You returned requesting more against medical advice, a further 0.5ml was administered at your insistence and we communicated to you for the rest/remaining of 0.5ml will be kept in our Pharmacy within 2 weeks and destroy afterward.  The doctor’s primary concern, which was communicated, was the risk of overfilling, which can lead to the issue you describe.\n\nWe regret that we were unable to resolve this for you before your departure from Bali. We take all concerns seriously, and our manager has attempted to contact you. We would like to continue this conversation to understand your desired outcome. Please WhatsApp us directly to ‪+62811388815‬ so we can find a solution and our doctor can give you further solution.\n\nBest regards,\nCocoon Medical Spa Team",
      "updateTime": "2025-08-28T04:10:22.264771Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2s5aWVsWjJXVlY1WDA4MmNYUnVWR2QwWjBWT2JXYxAB"
  }, {
    "reviewer": {
      "displayName": "David Pedrol"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Tini was very good with the massage place, very nice and clean. Great music and comfortable. Always good service and very friendly, with everything very clean and high-quality.\n\n(Original)\nTini was very good with massage place very nice and clean. Nice music and comfortable. Siempre buen servicio y muy amables con todo muy limpio y de alta calidad.",
    "createTime": "2025-06-04T09:35:12.007068Z",
    "updateTime": "2025-08-26T08:06:15.312425Z",
    "reviewReply": {
      "comment": "Hi David, Thank you for your kind feedback! We\u0027re so happy to hear you enjoyed your massage with Tini and that you found the space clean, comfortable, and relaxing. We look forward to welcoming you back soon! - Cocoon Team",
      "updateTime": "2025-06-06T02:42:13.287993Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VOcVRwZXJEc0pmdFVBEAE"
  }, {
    "reviewer": {
      "displayName": "Denise Ferguson"
    },
    "starRating": "FIVE",
    "comment": "Booking was really easy. Haven\u0027t had the treatment yet but so far the booking process (I spoke to Miranda) has been great.",
    "createTime": "2025-08-26T04:29:50.628818Z",
    "updateTime": "2025-08-26T04:29:50.628818Z",
    "reviewReply": {
      "comment": "Hi Denise, \nThank you for sharing your first impression with us! We’re so glad Miranda could make the booking process smooth and welcoming for you. We truly believe the experience begins the moment you reach out, so it’s wonderful to know that came through. We look forward to giving you an equally positive experience during your upcoming treatment.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-26T09:51:19.316283Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tSME16TTJSSG8xVEZsWWNVaENTbXREYVZKbFJIYxAB"
  }]
}