{
  "reviews": [{
    "reviewer": {
      "displayName": "sahar pinsker"
    },
    "starRating": "FIVE",
    "comment": "very professional. very patient and really good at explaining. all in all the best place I have experienced in the time I have had treatments.",
    "createTime": "2025-12-11T09:11:05.029392Z",
    "updateTime": "2025-12-11T09:11:05.029392Z",
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25BMFgxTnJPSEZLVG1KSlFtNHpZbFJmVEZWYVVYYxAB"
  }, {
    "reviewer": {
      "displayName": "Grace Kelly"
    },
    "starRating": "FIVE",
    "comment": "I visited Cocoon Medical Spa Canggu today for their Purifying Facial and it was honestly one of the best skincare experiences I’ve ever had. From the moment I walked in, the staff were welcoming, professional and made me feel completely at ease.\n\nThe facial itself was incredible deeply cleansing, nourishing, and so relaxing. My therapist explained every step, personalised the treatment to my skin, and was so gentle throughout. My skin feels unbelievably fresh, clean and glowing… like a complete reset.\n\nThe clinic is stunning, super hygienic, and has such a calming atmosphere. I genuinely felt pampered from start to finish. Cocoon really lives up to their reputation  the quality and care is on another level.\n\nI couldn’t recommend Cocoon Medical Spa more. If you’re in Bali and want a facial that truly transforms your skin, this is the place.\n\nThank you Amei, Ria + Santi",
    "createTime": "2025-12-11T08:59:29.484954Z",
    "updateTime": "2025-12-11T08:59:29.484954Z",
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xCalVuZFBZWEV5UlRaT2FFcFVUMTlqTjBSelJWRRAB"
  }, {
    "reviewer": {
      "displayName": "Leigh Fonseca"
    },
    "starRating": "FIVE",
    "comment": "First ever colonic done, after seeing a lot of videos I thought I’d give it a try after completing a 4 day fast and wow a lot came out. Definitely worth doing, my therapist Kathleen was awesome. Explaining everything along the way. Felt at ease with her there. Highly recommend",
    "createTime": "2025-12-11T05:26:20.328570Z",
    "updateTime": "2025-12-11T05:26:20.328570Z",
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xkM1dFVkdkbUZEWjFoMWFteHZhMUZ0TlhSdGRHYxAB"
  }, {
    "reviewer": {
      "displayName": "Siti Mulyani"
    },
    "starRating": "FIVE",
    "comment": "The atmosphere here is very comfortable and relaxing, making the treatment more enjoyable. The service is very friendly and professional, the staff are very helpful and patient. The results of the treatment are visible and satisfying, my skin is more glowing, clean, moisturized.\nThe products used are high quality and safe for my skin. The price offered is affordable for the quality you get. The beautician/therapist is very professional and experienced.\nThe place is clean and well-maintained, making me feel comfortable and safe.\nThey are very flexible with my schedule and needs.\nOverall, I highly recommend this place for beauty treatments 🫶🏻🥰",
    "createTime": "2025-03-18T05:24:11.494681Z",
    "updateTime": "2025-12-10T21:57:06.671916Z",
    "reviewReply": {
      "comment": "Thank you so much for your thoughtful and glowing review! We’re thrilled to hear that you had such a positive experience with us. It’s wonderful to know that the comfortable and relaxing atmosphere, along with our friendly and professional team, made your treatment even more enjoyable.\n\nWe’re so happy to hear you’re seeing visible and satisfying results, and that your skin is feeling more glowing, clean, moisturized! Our team is committed to using high-quality, safe products, and it’s great to know you appreciate that. We\u0027re also glad that our flexibility and affordable pricing added to your experience.\n\nWe truly value your kind words about our cleanliness, professionalism, and the level of care we provide. It was a pleasure having you with us, and we can’t wait to welcome you back for your next beauty treatment!",
      "updateTime": "2025-04-08T10:43:40.615077Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUN3NnNXVjBRRRAB"
  }, {
    "reviewer": {
      "displayName": "Herman Benade"
    },
    "starRating": "FIVE",
    "comment": "Spent 5 hours here. Staff was professional and friendly the treatments exceeded my expectations. Special shout out to Kathleen, Amel and Ria some of the treatments I had was let’s say quite personal and they made me feel very comfortable.",
    "createTime": "2025-12-09T13:27:46.659819Z",
    "updateTime": "2025-12-09T13:27:46.659819Z",
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT20xRk0zQnRURmhrYmpGNldVbHNOVVYzVG1kSGNYYxAB"
  }, {
    "reviewer": {
      "displayName": "Indigo Aly"
    },
    "starRating": "FIVE",
    "comment": "Today i visited Cocoon medical spa in Canggu and it exceeded my expectations. I went for a detox package after a fast and was just what I needed. The booking process wiyh Miranda was great, she answered all of my questions. When I arrived I was greeted by Ria who was lovely and welcoming and then I had my treatment with Nurse Kathleen who was amazing.\nI highly recommend a visit and will be back for sure!",
    "createTime": "2025-12-09T08:55:44.208206Z",
    "updateTime": "2025-12-09T08:55:44.208206Z",
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT214ak5tcDFTWFZuYjA5NVpURk9UVlYyYTB0a1ZYYxAB"
  }, {
    "reviewer": {
      "displayName": "V Moritz"
    },
    "starRating": "FIVE",
    "comment": "Great treatment!! Dr Brill treated me together with Ayu. Very kind and highly professional. Will come again!  Thank you also to the receptionist team Weby and Sani 🙏💕",
    "createTime": "2025-12-05T10:05:31.498724Z",
    "updateTime": "2025-12-05T10:05:31.498724Z",
    "reviewReply": {
      "comment": "Hi V. Moritz,\n\nThank you for taking the time to share your experience. We’re delighted to hear you enjoyed your treatment and felt supported by the team throughout your visit. Dr. Brill and Ayu will be happy to know their care stood out, and Weby and Santi will appreciate the mention as well.\n\nWe’re grateful for your kind words and look forward to welcoming you again.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:18:34.427273Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2s1S1FVdHRXREprWjNKRFFqSmlXVXMzYUU1eFMxRRAB"
  }, {
    "reviewer": {
      "displayName": "kellie kayser"
    },
    "starRating": "FIVE",
    "comment": "Fabulous treatment - both the facial treatment (microdermabrasion) and the staff treatment (Ayu, my therapist, did a great job). I highly recommend Cocoon ✨️",
    "createTime": "2025-12-05T08:10:51.775377Z",
    "updateTime": "2025-12-05T08:10:51.775377Z",
    "reviewReply": {
      "comment": "Hi Kellie,\n\nThank you for sharing your experience. We’re so glad to hear you loved your microdermabrasion and felt well taken care of throughout your visit. Ayu will be happy to know her work made a great impression.\n\nWe truly appreciate the recommendation and hope to welcome you back soon.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:17:41.040680Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tsdFRWWkZNblJKY1hKUFgwODNhMVJ6UWpoNFJYYxAB"
  }, {
    "reviewer": {
      "displayName": "Sydney Graves"
    },
    "starRating": "FIVE",
    "comment": "Thank you so much. This was a wonderful experience. I will be returning. Very clean \u0026 safe. Everything was used new during my procedure (RF microneedling) the girls were fab too. Dr Angeline, Kathleen \u0026 Ayu. Thanks again!",
    "createTime": "2025-11-29T05:07:13.666962Z",
    "updateTime": "2025-11-29T05:07:13.666962Z",
    "reviewReply": {
      "comment": "Hi Sydney,\n\nThank you for the wonderful feedback. We’re so glad to hear you felt safe, comfortable, and supported throughout your RF microneedling treatment. Dr. Angeline, Kathleen, and Ayu will be delighted to know they helped make your visit such a positive one.\n\nIt means a lot that you’d choose to return, and we look forward to welcoming you back anytime.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:17:00.387073Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25obFlUaG9lVXBSU1d0aGVHNVZNR1ZoVlVsV1ZuYxAB"
  }, {
    "reviewer": {
      "displayName": "Helen Milne"
    },
    "starRating": "FIVE",
    "comment": "Amazing microdermabrasion the therapist Kathleen was wonderful highly trained and so lovely",
    "createTime": "2025-11-29T03:34:08.413310Z",
    "updateTime": "2025-11-29T03:34:08.413310Z",
    "reviewReply": {
      "comment": "Hi Helen,\n\nThank you for sharing your experience. We’re thrilled to hear you enjoyed your microdermabrasion treatment and that Kathleen made it such a positive experience. She’ll be delighted to know her expertise and care stood out to you.\n\nWe’d love to welcome you back again soon.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:15:12.873073Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21wMVgzaDNaa2x6V1ZjeVJDMWZPSGhZYUV0S2VsRRAB"
  }, {
    "reviewer": {
      "displayName": "L K"
    },
    "starRating": "FIVE",
    "comment": "Great experience this evening with Dr Brill who explained everything very thoroughly. Her team, Ria, Rini and Santi were also wonderful and very welcoming. Thank you and will be back for further treatments!",
    "createTime": "2025-11-28T16:27:21.327934Z",
    "updateTime": "2025-11-28T16:27:21.327934Z",
    "reviewReply": {
      "comment": "Hi L.K.,\n\nThank you for your thoughtful review. We’re glad to hear you had a great experience with Dr. Brill and felt supported by Ria, Rini, and Santi throughout your visit. Knowing you felt informed and well cared for means a lot to us.\n\nWe look forward to welcoming you back for your next treatment.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:13:52.518319Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25wM2VHdE1UMDlpU0hCdk5sUnVOamRIYUZZdFNuYxAB"
  }, {
    "reviewer": {
      "displayName": "Sasha Babakova"
    },
    "starRating": "THREE",
    "comment": "Good atmosphere, salon smells nice with relaxing music. Had Hydrofacial done, it was a first time for me so nothing to compare to. Staff are nice.\nRini Ria, Santi - staff",
    "createTime": "2025-11-28T07:28:02.773999Z",
    "updateTime": "2025-11-28T07:28:02.773999Z",
    "reviewReply": {
      "comment": "Hi Sasha,\n\nThank you for sharing your experience with us. We’re happy to hear you enjoyed the relaxing atmosphere and felt comfortable during your first Hydrofacial. Rini, Ria, and Santi will be grateful for the mention.\n\nWe noticed you left three stars, and we completely understand that it can be difficult to rate something without a comparison point, especially when it’s a first-time treatment. We hope as you explore more skincare experiences, you’ll continue to feel the benefits and results from this one.\n\nWe’d love to welcome you back anytime you’re ready for your next session or if you’d like to try something new.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:12:47.833694Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25SR1N6WlZTVlZIVkdSaFUwcFBja3RzY1dJNU5rRRAB"
  }, {
    "reviewer": {
      "displayName": "Scotty Maher"
    },
    "starRating": "FIVE",
    "comment": "Kathleen, Ria, and Santi were amazing. I will come back next time I visit Bali!",
    "createTime": "2025-11-28T05:44:52.960946Z",
    "updateTime": "2025-11-28T05:44:52.960946Z",
    "reviewReply": {
      "comment": "Hi Scotty,\n\nThank you for the great review. We’re happy to hear your experience with Kathleen, Ria, and Santi was such a positive one. They’ll be glad to know they made an impact.\n\nWe look forward to welcoming you back on your next trip to Bali.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:09:22.282564Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21wck5GcHFZVzVTVDBWVFdXSlViV2xDUkVKd1psRRAB"
  }, {
    "reviewer": {
      "displayName": "Julia Belmontes"
    },
    "starRating": "FIVE",
    "comment": "Excellent service! Kathleen, Ria and Santi were super helpful and walked us through out IV treatment.",
    "createTime": "2025-11-28T05:18:17.464782Z",
    "updateTime": "2025-11-28T05:18:17.464782Z",
    "reviewReply": {
      "comment": "Hi Julia,\n\nThank you for taking the time to share your experience. We’re happy to hear you enjoyed the service and felt well supported throughout your IV treatment. Kathleen, Ria, and Santi will be glad to know they made your visit a positive one.\n\nWe look forward to welcoming you again.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:08:23.907723Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xSSlpIQXhiVUUyZGpkSVMyVTNVemREVVhCUlRVRRAB"
  }, {
    "reviewer": {
      "displayName": "Angel Navarro"
    },
    "starRating": "FIVE",
    "comment": "Dok Brill and Kathleen  and Ria were great",
    "createTime": "2025-11-28T04:55:21.981535Z",
    "updateTime": "2025-11-28T04:55:56.817966Z",
    "reviewReply": {
      "comment": "Hi Angel,\n\nThank you for the kind feedback. We’re glad to hear you had a great experience with Dok Brill, Kathleen, and Ria. They’ll be happy to know their care stood out to you.\n\nWe hope to see you again soon.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:07:39.305090Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tKUk0yMXBSWGh6WmsxR2RqQXdhRlF5WlVOaVpuYxAB"
  }, {
    "reviewer": {
      "displayName": "Haley O\u0027Connell"
    },
    "starRating": "FIVE",
    "comment": "Nurse Kathleen was calm, welcoming, and made me feel completely at ease during my treatments. The clinic is clean, professional, and feels world class. Highly recommended!",
    "createTime": "2025-11-27T07:24:52.960437Z",
    "updateTime": "2025-11-27T07:24:52.960437Z",
    "reviewReply": {
      "comment": "Hi Haley,\n\nThank you for this wonderful review. We’re so happy to hear you felt calm and well taken care of during your visit. Kathleen will be delighted to know her approach helped you feel at ease throughout your treatment.\n\nWe truly appreciate your recommendation and look forward to welcoming you again soon.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:07:04.136148Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25BMk1VZHRURXRCV1V4TVUxbFpiazgzZWtseWVWRRAB"
  }, {
    "reviewer": {
      "displayName": "Lidia Talalyan"
    },
    "starRating": "FIVE",
    "comment": "I had wonderful experience with microdermabrasion procedure. My skin is glowing. Ayu and Weby were so friendly and professional",
    "createTime": "2025-11-25T10:19:47.936273Z",
    "updateTime": "2025-11-25T10:19:47.936273Z",
    "reviewReply": {
      "comment": "Hi Lidia,\n\nThank you for sharing your experience. We’re so glad to hear your skin is glowing after your microdermabrasion treatment. Ayu and Weby will be very happy to know their care and professionalism helped make your visit a great one.\n\nWe appreciate your kind words and hope to welcome you back soon.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:06:20.581477Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pWeGRrYzRMWGxNUlRNNVdFUjBZMTh6VlZWalNXYxAB"
  }, {
    "reviewer": {
      "displayName": "Anastasia Korotkaya"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) The renovations, the atmosphere are superb, the staff is amazing! Thank you all! Santi, Wida, Ria.\nI had an IV, I highly recommend it!\n\n(Original)\nРемонт, атмосфера супер, персонал очень классный! Спасибо всем! Santi, Wida, Ria.\nДелала капельницу, рекомендую!",
    "createTime": "2025-11-24T02:20:03.276763Z",
    "updateTime": "2025-11-24T02:20:03.276763Z",
    "reviewReply": {
      "comment": "Hi Anastasia,\n\nThank you for your lovely review. We’re happy to hear you enjoyed the atmosphere and felt well cared for during your IV treatment. Santi, Wida, and Ria will be delighted to know they made your experience a positive one.\n\nWe truly appreciate the recommendation and hope to welcome you again soon.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:05:24.507361Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pWSldGQlpPVFpDVUhsMFpqVkpSM1pFWjBjdFZsRRAB"
  }, {
    "reviewer": {
      "displayName": "Tyler"
    },
    "starRating": "FIVE",
    "comment": "Wida, Weby and Ria guided me through an amazing medical spa experience. From start to finish, t\u0027s were crossed and i\u0027s were dotted. I wasn\u0027t expecting much from the \"medical\" component here, but they were extremely knowledgeable and helpful guiding me through an alternative treatment. There are countless spa options in Bali... This is hands down one of the best!",
    "createTime": "2025-11-22T05:52:19.588653Z",
    "updateTime": "2025-11-22T05:52:19.588653Z",
    "reviewReply": {
      "comment": "Hi Tyler,\n\nThank you for taking the time to share your experience. We’re glad to hear the treatment exceeded your expectations and that the medical approach felt clear, reassuring, and well-guided. Wida, Weby, and Ria will be very happy to know they made a strong impression from beginning to end.\n\nWith so many choices in Bali, hearing that you consider us one of the best means a lot. We appreciate it more than you know.\n\nWe hope to welcome you back whenever you\u0027re ready for your next treatment or wellness experience.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:03:47.695882Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWNk1YVTBXa3BxWkdWNGVqQXphbEJpTFVZM2JVRRAB"
  }, {
    "reviewer": {
      "displayName": "Danielle Clark"
    },
    "starRating": "FIVE",
    "comment": "I recently attended this clinic for Botox and filler and had a really great experience with Ivan. He was very professional and made me feel very comfortable during the consultation and treatment and would be happy to reccomend. I am also happy with the results",
    "createTime": "2025-11-19T11:09:06.543972Z",
    "updateTime": "2025-11-19T11:09:06.543972Z",
    "reviewReply": {
      "comment": "Hi Danielle,\n\nThank you for sharing your experience. We’re really happy to hear that you felt comfortable throughout your treatment and that you\u0027re pleased with the results. dr. Ivan will be thrilled to know his care and professionalism stood out to you.\n\nWe truly appreciate your recommendation and look forward to welcoming you again whenever you\u0027re ready.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:02:01.744736Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25OdmNsVnVaakp4Y3pkMFpFaGxiRFJZYnpsVmRVRRAB"
  }]
}