{
  "reviews": [{
    "reviewer": {
      "displayName": "Camilla Thompson"
    },
    "starRating": "FIVE",
    "comment": "Best colonic therapy I’ve ever had. IV treatment very good here. I recommend Nurse Kathleen and Tinny",
    "createTime": "2025-09-16T05:37:03.137821Z",
    "updateTime": "2025-09-16T05:37:03.137821Z",
    "reviewReply": {
      "comment": "Thank you, Camilla, for your kind words. We’re so happy to hear you had such a positive experience with the colonic therapy and IV treatment. Kathleen and Tinny will be glad to know you recommended them.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:59:04.290521Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pkQ1luWkVXa0p2YXkwNWQzQXlhbTVVYkhCVlVsRRAB"
  }, {
    "reviewer": {
      "displayName": "Lon Tsitos"
    },
    "starRating": "FIVE",
    "comment": "The entire team are extremely helpful.\n\nDr Eva, is very professional with her approach. As for the team, thank you for being so kind and helpful, Ayu, Weby and Santi.\n\nI’m so Happy with Cocoon I highly recommend it for all skincare. I got the Peptide Skin Booster. Amazing!",
    "createTime": "2025-07-16T08:43:02.419047Z",
    "updateTime": "2025-09-16T05:06:16.666331Z",
    "reviewReply": {
      "comment": "Thank you, Lon, for taking the time to share your experience. We’re so glad Dr. Eva, Ayu, Weby, and Santi could make your visit a great one. Happy to hear you’re enjoying the results of your Peptide Skin Booster!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:58:08.033920Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25kNWNUbEZUREpqU1dKVmFFcHhZV05WWWpoQlprRRAB"
  }, {
    "reviewer": {
      "displayName": "samuel bohr"
    },
    "starRating": "FIVE",
    "comment": "Highly recomed the cocoon medical spa. The staff were incredibly accommodating and friendly. I was made to fee very comfortable through the process. The ladies at the front desk Weby and Santi were very welcoming and professional sn my nurse Kathleen was super comforting with the process and did a great colonoscopy massage during the treatment. Highly recomed",
    "createTime": "2025-09-12T08:45:32.426959Z",
    "updateTime": "2025-09-12T08:45:32.426959Z",
    "reviewReply": {
      "comment": "Thank you, Samuel, for sharing your experience. We’re glad to hear you felt comfortable and well looked after by Kathleen, Weby, and Santi. It’s wonderful to know the team made your visit a positive one.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:48:34.431583Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25aaWR6UnhXRkpaZEZsV2RsbGZhVGhCTlhoeU9HYxAB"
  }, {
    "reviewer": {
      "displayName": "Tracey Morris"
    },
    "starRating": "FIVE",
    "comment": "The booking in process,  welcome by Reception and my treatment by Therapist (Ayu) was professional and personal at all times. I will definitely return here and highly recommend. Thank you",
    "createTime": "2025-09-12T05:29:59.663661Z",
    "updateTime": "2025-09-12T05:29:59.663661Z",
    "reviewReply": {
      "comment": "Thank you, Tracey, for your kind words. We’re so pleased to hear you felt well taken care of from the moment you arrived through to your treatment with Ayu. We’ll be happy to welcome you back anytime.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:47:54.969479Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21Oek9FNXplbUZ0TWxGSVJXeGpRVGswYUVsM1ltYxAB"
  }, {
    "reviewer": {
      "displayName": "Sasha Morris"
    },
    "starRating": "FIVE",
    "comment": "I had my first Hydrafacial here and was very well looked after by my therapist, Tini. She explained the treatment to me beforehand and made me feel comfortable.  It was very relaxing and my skin feels great! The whole team were very welcoming and professional. I would definitely come back again.",
    "createTime": "2025-09-12T03:44:38.591027Z",
    "updateTime": "2025-09-12T03:50:51.827557Z",
    "reviewReply": {
      "comment": "Thank you, Sasha, for sharing your first Hydrafacial experience with us. We’re so glad Tini and the team made you feel comfortable and that you’re happy with the results. Looking forward to seeing you again.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:42:55.821978Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2w5eE1FTmxXa0Z2Ulc5MUxUTlJWRzloV2tSYVIyYxAB"
  }, {
    "reviewer": {
      "displayName": "b bersamin"
    },
    "starRating": "FIVE",
    "comment": "I had a wonderful experience at Cocoon medical spa. The therapist Ayu was absolutely excellent, skilled, attentive, and made me feel completely comfortable throughout my treatment. Weby and Santi were also very professional and welcoming, making the whole visit smooth and stress-free. I left feeling refreshed and well taken care of. Highly recommend!",
    "createTime": "2025-09-11T03:52:11.582386Z",
    "updateTime": "2025-09-11T03:52:11.582386Z",
    "reviewReply": {
      "comment": "Hi Bersamin,\nThank you so much for your thoughtful feedback. We’re really glad to hear you felt comfortable and well cared for by Ayu, Weby, and Santi. It means a lot to know your visit left you feeling refreshed.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:42:07.661465Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21aWFJtSTNSbkowYldwSk5sWnVObDloY205VmVGRRAB"
  }, {
    "reviewer": {
      "displayName": "Kinka Putri"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) I really liked Ms. Ayu\u0027s massage, it was really good. 10/10🫶🏻\n\n(Original)\naku suka banget pijitan nya mba ayu, it was really good. 10/10🫶🏻",
    "createTime": "2025-09-10T08:20:09.856079Z",
    "updateTime": "2025-09-10T08:27:11.210848Z",
    "reviewReply": {
      "comment": "Thank you, Kinka! So happy to hear you enjoyed your massage with Mba Ayu. She’ll be delighted to know you rated it 10/10. Looking forward to welcoming you again.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:40:57.137618Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25JNWF6Sm5PRWw1YW1wcmRtbENORWRmT0dkNWVuYxAB"
  }, {
    "reviewer": {
      "displayName": "Salwa Rafila"
    },
    "starRating": "FIVE",
    "comment": "it was so good!!! 100/10 from mba tini, and she’s very kind, def. will comeback soon🩷",
    "createTime": "2025-09-10T08:18:26.475824Z",
    "updateTime": "2025-09-10T08:18:26.475824Z",
    "reviewReply": {
      "comment": "Thank you, Salwa! We’re so glad you had a great time with Mba Tini and that you’re planning to come back. She’ll be so happy to hear your kind words.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:40:02.062130Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pjdFQyOWhTakpXUVZOTll6WlVVSFpRUlhOUGQzYxAB"
  }, {
    "reviewer": {
      "displayName": "Ilaria Meucci"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Truly amazing, the masseuse\u0027s technical skill is very high. Very kind and welcoming. Highly recommended.\n\n(Original)\nVeramente stupendo, il livello tecnico della massaggiatrice è molto alto. Molto gentili e accoglienti. Super consigliato",
    "createTime": "2025-09-10T04:58:36.953310Z",
    "updateTime": "2025-09-10T04:58:36.953310Z",
    "reviewReply": {
      "comment": "Thank you so much, Ilaria, for sharing your experience with us. We’re really happy to know you felt well taken care of and enjoyed the massage. Your kind words mean a lot to our team.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:16:06.936216Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tORFgwOXZlVVo0UldGWFpVdGhNbU5QVGtoR00yYxAB"
  }, {
    "reviewer": {
      "displayName": "Marco Lo Menzo"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Excellent experience. Friendly and knowledgeable staff. I personally had a great time with Tini and Weby, wonderful girls.\n\n(Original)\nOttima esperienza. Personale gentile e preparato. Personalmente mi sono trovato molto con Tini e Weby, splendide ragazze.",
    "createTime": "2025-09-10T04:19:00.564274Z",
    "updateTime": "2025-09-10T04:28:19.372229Z",
    "reviewReply": {
      "comment": "Hi Marco,\n\nThank you so much for your kind words! We’re absolutely delighted to hear that you had such a great experience with us. Tini and Weby will be so happy to know they made an impact – they truly do bring warmth and care to everything they do. We’re so glad you felt taken care of and that your time with us was memorable.\n\nLooking forward to welcoming you back soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:12:58.185744Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT20wM01tb3RkQzFKUzNneFQwdHRURkpNV1hKQ1pXYxAB"
  }, {
    "reviewer": {
      "displayName": "Alex No"
    },
    "starRating": "FIVE",
    "comment": "Had a wonderful treatment from the team at Cocoon Day spa. Thank you to Kathleen, Ayu, Weby \u0026 Santi. Very professional and welcoming.",
    "createTime": "2025-09-09T09:18:13.305825Z",
    "updateTime": "2025-09-09T09:18:13.305825Z",
    "reviewReply": {
      "comment": "Hi Alex, thank you so much for your kind words! It was great having you at Cocoon Canggu. \nWe’re delighted to hear you enjoyed your treatment and that Kathleen, Ayu, Weby, and Santi made you feel so welcome. \nWe look forward to seeing you again soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-10T02:36:01.470219Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pONlVEaGhRWEpZT0dzd1dqVjBRemN6UVcxeFQzYxAB"
  }, {
    "reviewer": {
      "displayName": "GYMLIVE PERSONAL TRAINING"
    },
    "starRating": "FIVE",
    "comment": "First time in Bali \u0026 I’m seriously impressed with the  team here at Canggu! The receptionist were really helpful (Weby + Santi) \u0026 my therapist (Tini) was outstanding. Highly recommend I’ll be back again. Thank you",
    "createTime": "2025-09-09T09:10:19.167601Z",
    "updateTime": "2025-09-09T09:10:19.167601Z",
    "reviewReply": {
      "comment": "Hello, thank you for sharing your first Bali experience with us! We’re so glad Weby and Santi could make you feel welcome from the moment you arrived, and it’s wonderful to hear Tini’s treatment left such a great impression. We’d love to see you again whenever you’re back in Canggu.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-23T07:32:06.750772Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2t0MlFXWkNibXBMVldGMk0xQmtRbm94YnkwM2MzYxAB"
  }, {
    "reviewer": {
      "displayName": "Léa Gutierrez"
    },
    "starRating": "FIVE",
    "comment": "I did a colon therapy with Kathleen who was very professional and kind, I felt in very good hands. Then I did a 360 hydrafacial care with Tini who has amazing hands, is very kind and professional. And also a special thanks to Weby and Santi, for the welcoming. Everything was perfect and I will come again. Thank you",
    "createTime": "2025-09-09T04:50:53.917971Z",
    "updateTime": "2025-09-09T04:54:46.263418Z",
    "reviewReply": {
      "comment": "Hi Léa, thank you so much for sharing your wonderful experience! \nWe’re so glad to hear that Kathleen and Tini took such good care of you, and that Weby and Santi made you feel so welcome. It means a lot to know everything was perfect for you. \nWe look forward to welcoming you back again soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-10T02:32:52.036808Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tSeFZrUXdiREJWUkhKeWNYWllkVkV5UkVWMGFGRRAB"
  }, {
    "reviewer": {
      "displayName": "Vilde Bakken"
    },
    "starRating": "FIVE",
    "comment": "calm atmosphere and peaceful treatment 🤍 dr Eva, Ayu, Weby \u0026 Santi welcomed me with open arms and made my treatment as perfect as it could be!",
    "createTime": "2025-09-08T08:19:54.535915Z",
    "updateTime": "2025-09-08T08:19:54.535915Z",
    "reviewReply": {
      "comment": "Hi Vilde, thank you so much for your kind words 🤍 \nWe’re delighted to hear that Dr Eva, Ayu, Weby, and Santi made your visit so special and that you enjoyed the calm, peaceful atmosphere. \nWe can’t wait to welcome you back again soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-10T02:29:38.452552Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tGV1NUbHZUaTAxTlhCeWREVktPWFEwTkhBeGNIYxAB"
  }, {
    "reviewer": {
      "displayName": "Aoife Mcateer"
    },
    "starRating": "FIVE",
    "comment": "I had the Classic Extraction at Cocoon Spa and it was absolutely excellent — a full 10/10 experience! From the moment I walked in, the atmosphere was calming and welcoming. My therapist Tini was professional, gentle, and clearly very skilled. My skin feels incredibly clean and refreshed, and the whole process was handled with such care. Highly recommend for anyone looking to deeply cleanse their skin in a relaxing, professional environment. I’ll definitely be coming back!",
    "createTime": "2025-09-08T04:54:22.934037Z",
    "updateTime": "2025-09-08T04:56:20.392540Z",
    "reviewReply": {
      "comment": "Hi Aoife, thank you so much for your wonderful feedback! \nWe’re so happy to hear you enjoyed your Classic Extraction and that Tini made the experience so comfortable and refreshing for you. Your recommendation means a lot to us.\nWe look forward to welcoming you back again soon for more relaxing treatments!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-10T02:23:05.237579Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2sxMlVrdDNVVnBqZDE4M2JHMUxaWFpmWmxnelUyYxAB"
  }, {
    "reviewer": {
      "displayName": "Amanda Rootsey"
    },
    "starRating": "FIVE",
    "comment": "Beautiful experience. I had the signature 360 hydra facial and my skin feels amazing and tight! The staff here are so caring and sweet, especially Ayu, Webi and Santi. I\u0027ll definitely be back. 🥰🥰",
    "createTime": "2025-09-06T04:02:13.599586Z",
    "updateTime": "2025-09-06T04:06:19.033984Z",
    "reviewReply": {
      "comment": "Hi Amanda, thank you so much for your lovely review! \nWe’re are delighted to hear you loved the Signature 360 Hydrafacial and that your skin feels amazing. Ayu, Weby, and Santi will be so happy to know they made your visit special. We can’t wait to welcome you back again soon 🥰💙\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T04:35:18.726653Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT20wNFZWOVFkRlZaVkhaRVNVOW1kV0UyZUcxM1VGRRAB"
  }, {
    "reviewer": {
      "displayName": "Sarah E"
    },
    "starRating": "FOUR",
    "comment": "Thank you Nurse Kathleen - very professional and kind. However be mindful with the colonics the machines are not as advanced as in western countries and it was quite uncomfortable!",
    "createTime": "2025-07-16T04:11:40.761835Z",
    "updateTime": "2025-09-05T10:08:15.433577Z",
    "reviewReply": {
      "comment": "Thank you, Sarah, for taking the time to share your experience and for your kind words about Nurse Kathleen’s professionalism and care. \n\nWe truly value your feedback regarding the equipment. While our colonics machines meet local and international health and safety standards, we understand that they may differ from those you’ve experienced abroad, and we’re always striving to improve comfort for our guests. \n\nYour comments help us continue enhancing our services, and we hope to welcome you back for an even better experience next time.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-06T05:51:05.093691Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tKRGNYSldkSFpXYTNCQlMxRTFOVkZ1WDBjeGFXYxAB"
  }, {
    "reviewer": {
      "displayName": "Jazmin"
    },
    "starRating": "FIVE",
    "comment": "Will defo come here again! I had a Hydrafacial done by Tini and im so pleased with results. Super professional and enjoyable experience",
    "createTime": "2025-09-05T09:48:09.477598Z",
    "updateTime": "2025-09-05T09:48:09.477598Z",
    "reviewReply": {
      "comment": "Hi Jazmin, thank you for sharing your experience! \nWe’re so glad you enjoyed your Hydrafacial with Tini and are pleased with the results. We look forward to welcoming you back to Cocoon Canggu for your next visit 💙\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T04:32:06.550990Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tocExYWXRhblF4V0RKTE5reHJPVGRvUmswNU5WRRAB"
  }, {
    "reviewer": {
      "displayName": "Nathalie Czajka"
    },
    "starRating": "FIVE",
    "comment": "Just had the 360 HydraFacial at Cocoon Spa Bali and wow — my skin has never felt better. Super hydrating, deeply cleansing, and so relaxing from start to finish. The space is beautiful, the staff are lovely, and the facial left me glowing for days. Highly recommend if you’re in Bali and want to treat your skin (and yourself)😍",
    "createTime": "2025-04-18T09:53:29.695682Z",
    "updateTime": "2025-09-05T08:26:59.180434Z",
    "reviewReply": {
      "comment": "Hi Nathalie, Thank you so much for the lovely feedback! We\u0027re so happy to hear your skin is glowing ✨ and that you enjoyed the facial. Tini will be thrilled to know you loved her massage and service! Looking forward to seeing you again soon!\n\n-Cocoon Team",
      "updateTime": "2025-04-26T02:04:42.497968Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNvMmZ6MXNnRRAB"
  }, {
    "reviewer": {
      "displayName": "Jo Hir"
    },
    "starRating": "FIVE",
    "comment": "Amazing service and such a wonderful treatment! The location is beautiful, the space is clean, and the atmosphere feels so relaxing. Weby and Tini were absolutely fantastic—professional, attentive, and made the whole experience so enjoyable. I’ll definitely be coming back next time I’m in the area.",
    "createTime": "2025-09-04T09:21:23.938687Z",
    "updateTime": "2025-09-04T09:21:23.938687Z",
    "reviewReply": {
      "comment": "Hi Jo, thank you for your kind words! \nWe’re so happy to hear you enjoyed your experience and felt relaxed in our clinic. Weby and Tini will be so happy to know they made your visit special. We look forward to welcoming you back to Cocoon Canggu on your next visit 💙\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-08T04:30:50.683135Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21ObVNVRmpkV1prVkVNemRXeExUbVp5UkZBdFYzYxAB"
  }]
}