{
  "reviews": [{
    "reviewer": {
      "displayName": "Luana Makenzie"
    },
    "starRating": "FIVE",
    "comment": "I just had a colon hydrotherapy session here and am blown away by the professionalism, care and high level of service. Their knowledge and kindness makes you feel so comfortable. The place is clean and staff makes you feel like family right away! I will definitely be back. Thank you Kathleen for your amazing service!",
    "createTime": "2025-07-07T03:40:36.302937Z",
    "updateTime": "2025-07-07T03:40:36.302937Z",
    "reviewReply": {
      "comment": "Hello Luana, Thank you so much for your kind words and thoughtful review. We\u0027re thrilled to hear that you had such a positive experience with your colon hydrotherapy session. Kathleen and the entire team are truly grateful for your appreciation. It’s wonderful to know you felt comfortable, cared for, and at home with us. We look forward to welcoming you back soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:14:12.002468Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21wc2RXRk5hWE4wVVdaZmNEUmtSemRZT0V4SVpFRRAB"
  }, {
    "reviewer": {
      "displayName": "Abby Hempfling"
    },
    "starRating": "FIVE",
    "comment": "I got botox here while I was in Bail for a couple months and the experience was fantastic. Super professional nurse and perfect outcome. Wish I could come here all the time!",
    "createTime": "2025-07-06T07:50:28.475374Z",
    "updateTime": "2025-07-06T07:50:28.475374Z",
    "reviewReply": {
      "comment": "Hi Abby, Thank you so much for your kind review! We\u0027re delighted to hear that you had a fantastic experience with your Botox treatment and that you were happy with the results. It means a lot to us to know you felt in good hands with our nurse. We wish you could visit us all the time too — you\u0027re always welcome back anytime you\u0027re in Bali!\n\nRegards,\nCocoon Team\n",
      "updateTime": "2025-07-11T02:15:24.629102Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pSclZHbEhOa3BtWTJoeVRHdEZhbE5CWkZGb1NWRRAB"
  }, {
    "reviewer": {
      "displayName": "Tanya-Maree Hunter"
    },
    "starRating": "FIVE",
    "comment": "The staff at Cocoon Medical were amazing in answering all my concerns. They kept regular contact over a couple of days as I considered the treatments available. I was so nervous getting injectables in Bali at a place I hadn’t been before. Miranda was so patient and reassuring and answered all my questions on WhatsApp.\n\nI was in Bali for my daughter’s wedding and wanted to top up my filler but I was worried about bruising as the wedding was only 4 days after the appointment.\n\nOn the day I met my Doctor Dr. Eva.\nDr. Eva patiently listened to my concerns and advised me by explaining detailed descriptions of what she was prescribing and why. I was made to feel so comfortable with numbing cream, all products and instruments were presented in sealed sterile packaging and were opened in front of me in a sterile room. Every precaution was taken so much so that I have never experienced this level of safety and safe protocols in Australia. All administering injectors in this clinic are qualified doctors.\n\nDr Eva was so gentle and while she didn’t promise I wouldn’t bruise I never had a mark on the area treated for the day. I had filler topped up in the right side of my face which was slightly more hallowed that the left side due to a car accident I’d had years ago.\n\nI had never been suggested the injection site that Dr Eva suggested before by injectors in Australia, but I was so happy with the results. It was truly an approach that worked, to balance out my face. I spent just under $400AUD for 1 mil of filler.\n\nI can’t recommend Cocoon Medical Clinic enough. If you are in Bali and want to get a top up it’s the perfect place to visit with total confidence. I am extremely happy with the results from my treatment with Dr Eva and I will be booking ahead of time on my next Bali trip because this place will soon be everyone’s priority destination visit.",
    "createTime": "2025-07-04T01:24:48.207056Z",
    "updateTime": "2025-07-04T01:24:48.207056Z",
    "reviewReply": {
      "comment": "Hi Tanya,\n\nThank you so much for taking the time to share your experience in such detail. We are truly honored by your trust and so pleased to know that you felt comfortable, safe, and well cared for throughout your journey with us.\n\nWe understand how important it is to feel confident—especially when preparing for such a special occasion like your daughter’s wedding—and we’re thrilled that Dr. Eva and our team were able to meet your expectations. Your kind words about our safety protocols, communication, and results mean the world to us.\n\nDr. Eva, Miranda, and the entire Cocoon team deeply appreciate your recognition and are grateful to have been part of your Bali experience. We look forward to welcoming you back on your next visit!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:19:23.780426Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tSR1pWSlJlRVpqTUV4NlJGVlBSRXRrTlZCUlNrRRAB"
  }, {
    "reviewer": {
      "displayName": "Reita Femala"
    },
    "starRating": "FIVE",
    "comment": "✨ Fresh out of my PRP (Vampire Lift) \u0026 IV Drip treatment at Cocoon Medical Spa — and the glow is REAL! 💉🌿\n\nFrom the moment I walked in, everything felt calm, clean, and luxurious. The team truly goes above and beyond to make you feel safe, cared for, and pampered.\n\nSpecial thanks to Dr. Eva — she explained everything so clearly and made the PRP treatment smooth and completely comfortable. My skin already feels tighter and more radiant — can’t wait to see the final glow-up in a few days! ✨\n\nKathleen was so kind and gentle with the IV Drip — I felt instantly hydrated and energized, just what I needed for Bali life or post-travel recovery. 💧\n\nAnd Ayu gave such a warm welcome and made sure I was taken care of throughout the entire experience 💛\n\nIf you’re in Bali and want real results with world-class care, I highly recommend Cocoon. Your skin (and body) will thank you!\n\n📍 Location: Cocoon Medical Spa, Bali\n#CocoonMedicalSpa #PRPBali #IVDripBali #Glowing",
    "createTime": "2025-07-03T05:25:43.421220Z",
    "updateTime": "2025-07-03T05:26:30.455081Z",
    "reviewReply": {
      "comment": "Hi Reita, Thank you so much for this wonderful and detailed feedback! We’re thrilled to hear that you had such a positive experience with your PRP and IV Drip treatments. It’s always our goal to create a calm, luxurious, and caring environment, and we’re so happy you felt that from the moment you arrived.\n\nDr. Eva, Kathleen, and Ayu will be so touched by your kind words — they’re truly dedicated to providing the highest level of care. We\u0027re excited for you to enjoy the full glow-up in the coming days, and we can’t wait to welcome you back to Cocoon on your next Bali visit.\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:20:13.853507Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tKNVRIcHFOMFJ6U0d4WFlrRm5VMnh4UlV4R1RIYxAB"
  }, {
    "reviewer": {
      "displayName": "Mohini Lata"
    },
    "starRating": "FIVE",
    "comment": "Cocoon Nusa Dua is set in a beautiful retreat forest. The staff are very professional kind and helpful.Dctr Brill was helpful in her assessment of my skin care needs and recommendations .\nNurse Yumi was very calm and friendly.\nMiranda was very helpful and professional great in all her communications and facilitated my bookings to accommodate my short stay in Bali",
    "createTime": "2025-06-30T08:07:44.526999Z",
    "updateTime": "2025-06-30T08:07:44.526999Z",
    "reviewReply": {
      "comment": "Hi Mohini, Thank you so much for your kind words and for sharing your experience at Cocoon Nusa Dua. We’re delighted to hear that you enjoyed the peaceful retreat setting and felt well supported by our team. Dr. Brill, Nurse Yumi, and Miranda will be so pleased to know their care and professionalism made your visit a positive one. We\u0027re glad we could accommodate your schedule during your short stay, and we hope to welcome you back again on your next trip to Bali!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:23:07.166309Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21VdFFXVTJTMEp2WDJ0UFJIcE9aVlo2WW1Kb09GRRAB"
  }, {
    "reviewer": {
      "displayName": "Emily Louise"
    },
    "starRating": "FIVE",
    "comment": "Ayu was my therapist, she did so amazing and made me feel so comfortable. Had the best experience here and will definitely be coming back. Highly reccommend!!",
    "createTime": "2025-06-30T06:09:02.255749Z",
    "updateTime": "2025-06-30T06:09:02.255749Z",
    "reviewReply": {
      "comment": "Hi Emily, Thank you very much for your kind feedback. We are delighted to hear that you had a wonderful experience and that Ayu made you feel comfortable and well cared for. Your recommendation means a great deal to us, and we look forward to welcoming you back in the near future.\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:27:05.976747Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWbVdFOUdUR2xWUmt4Q2MzaENaa1ZrTkdWWU5sRRAB"
  }, {
    "reviewer": {
      "displayName": "nancy bedard"
    },
    "starRating": "FIVE",
    "comment": "The name is Ayu, she is Fantastic and memorable.",
    "createTime": "2025-06-27T05:46:35.749358Z",
    "updateTime": "2025-06-27T05:46:35.749358Z",
    "reviewReply": {
      "comment": "Hi Nancy, Thank you for your thoughtful feedback. We’re so pleased to hear that Ayu left such a fantastic and lasting impression. She is a valued member of our team, and we’re delighted to know that her care made your experience truly memorable. We look forward to welcoming you again soon.\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:27:43.138540Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xkUVpGUndVa1JPUlcxa1JsOUpXUzFzZDBFeVJFRRAB"
  }, {
    "reviewer": {
      "displayName": "Anita Killip"
    },
    "starRating": "FIVE",
    "comment": "Friendly staff, easy process and a very quick and efficient appointment (for the Botox)",
    "createTime": "2025-06-25T03:23:18.938349Z",
    "updateTime": "2025-06-25T03:23:18.938349Z",
    "reviewReply": {
      "comment": "Hi Anita, Thank you for your kind feedback! We\u0027re so glad to hear that you found the process smooth and the appointment quick and efficient. Our team takes pride in making every visit as easy and comfortable as possible. We look forward to seeing you again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:28:18.135624Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2s0emVuUm1VV0oyUW1WMFFYSmhXbDkwUlVoTVpuYxAB"
  }, {
    "reviewer": {
      "displayName": "Ellie Rickard"
    },
    "starRating": "FIVE",
    "comment": "Thank you so much Tini!",
    "createTime": "2025-06-24T03:27:50.183130Z",
    "updateTime": "2025-06-24T03:27:50.183130Z",
    "reviewReply": {
      "comment": "Hi Ellie, We\u0027re so glad to hear you had a great experience. Tini will be so happy to know her care made a difference. We look forward to welcoming you back again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T05:37:29.315783Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pkMVFsQjJORkZZWkU5elQySkxkbXRQTXpWb1QwRRAB"
  }, {
    "reviewer": {
      "displayName": "Jovana Mijajev"
    },
    "starRating": "FIVE",
    "comment": "Amazing very clean and professional service. I had the remodeling facial package and feel great!",
    "createTime": "2025-06-21T08:41:39.171856Z",
    "updateTime": "2025-06-21T13:06:50.006195Z",
    "reviewReply": {
      "comment": "Hi Jovana, Thank you so much for your wonderful feedback! We\u0027re thrilled to hear you enjoyed the Remodeling Facial package and left feeling great. It\u0027s lovely to know you appreciated the cleanliness and professionalism of our service. We look forward to welcoming you back soon for more pampering! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T05:59:28.934247Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2kxclFuUjFXRmRXUlhWemJUY3pRVzlyYjBVd2NHYxAB"
  }, {
    "reviewer": {
      "displayName": "Bridget H"
    },
    "starRating": "FIVE",
    "comment": "I had the cocoon Signature 360 Hydrafacial with Tini in Canggu and she was amazing! Fantastic service, kind and professional. The treatment was fantastic my skin feels fresh, cleansed and most of all hydrated, would come again! 10/10",
    "createTime": "2025-06-21T08:35:08.519642Z",
    "updateTime": "2025-06-21T08:35:08.519642Z",
    "reviewReply": {
      "comment": "Hi Bridget, Thank you so much for your kind words! We\u0027re so happy to hear you had a fantastic experience with Tini during your Cocoon Signature 360 Hydrafacial in Canggu. She truly is a gem, and we’ll be sure to pass along your lovely feedback. It’s wonderful to know your skin feels fresh, cleansed, and deeply hydrated — exactly what we aim for! We look forward to welcoming you back soon. 10/10 guests like you make our day!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T07:11:28.458724Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tSWVJETnpSa2xSTUY5c2JtWkVRVlpwTTFwalJuYxAB"
  }, {
    "reviewer": {
      "displayName": "Mieke van Engelen"
    },
    "starRating": "FIVE",
    "comment": "Thank you Kathleen for your very professional and kind help! Definitely recommend.",
    "createTime": "2025-06-20T02:55:14.860905Z",
    "updateTime": "2025-06-20T02:55:14.860905Z",
    "reviewReply": {
      "comment": "Hi Mieke, Thank you so much for your kind words! We\u0027re delighted to hear that Kathleen was able to assist you with professionalism and care. Your recommendation means a lot to us, and we look forward to welcoming you back again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T07:13:52.894554Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT210WU5WWXhORTltUXkxaVgyVlRRVFZNVjFKV01YYxAB"
  }, {
    "reviewer": {
      "displayName": "Carrie Bell"
    },
    "starRating": "FIVE",
    "comment": "Massage with tini was incredible! Best massage I\u0027ve had. And iv infusion and colonic with Kathleen was amazing! Highly recommend",
    "createTime": "2025-06-18T09:15:27.748268Z",
    "updateTime": "2025-06-18T09:15:27.748268Z",
    "reviewReply": {
      "comment": "Hi Carrie, Thank you so much for sharing your experience! We\u0027re thrilled to hear that you enjoyed your massage with Tini — she’ll be so happy to know it was the best you\u0027ve had! We\u0027re also glad that your IV infusion and colonic with Kathleen were just as amazing. Your recommendation truly means a lot to us. We look forward to welcoming you back for more wellness and care soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T07:14:21.651121Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xkdE5ESmlVRVo2Tkd0VGQwcE9NMk42YjBGWGQzYxAB"
  }, {
    "reviewer": {
      "displayName": "Olivia Taylor"
    },
    "starRating": "FIVE",
    "comment": "Amazing treatment with Tini. I had the Hydrafacial 360 and my skin feels glowing! Highly recommend",
    "createTime": "2025-06-16T10:02:43.566541Z",
    "updateTime": "2025-06-16T10:02:43.566541Z",
    "reviewReply": {
      "comment": "Hi Olivia,\nThank you so much for your kind words! We’re thrilled to hear you loved your HydraFacial treatment with Tini, she’ll be so happy to know you felt the difference right away.\n\nHydration is one of the key benefits of the HydraFacial, and it’s great to know your skin felt refreshed and glowing. We look forward to welcoming you back for your next treatment!\n\nWarm regards,\nThe Cocoon Canggu Team",
      "updateTime": "2025-07-10T09:36:24.401880Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VPUDU1c0Q4dEtIVnRBRRAB"
  }, {
    "reviewer": {
      "displayName": "Emilie Taylor"
    },
    "starRating": "FIVE",
    "comment": "I loved my treatment today with Nurse Wida - my skin felt so hydrated after the Hydra Facial.",
    "createTime": "2025-06-16T08:19:58.183075Z",
    "updateTime": "2025-06-16T08:19:58.183075Z",
    "reviewReply": {
      "comment": "Hi Emilie,\nThank you so much for your lovely words. We’re thrilled to hear you loved your HydraFacial treatment with Nurse Wida.\n\nHydration is one of the key benefits of the HydraFacial, and it’s great to know your skin felt hydrated right away. \nWe look forward to welcoming you back for your next treatment!\n\nWarm regards,\nThe Cocoon Canggu Team",
      "updateTime": "2025-07-10T09:34:41.533324Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJTER2NEdKMzVldmlnRRAB"
  }, {
    "reviewer": {
      "displayName": "Rachel Behl"
    },
    "starRating": "FIVE",
    "comment": "I had a wonderful colon hydrotherapy treatment with Dita. She had great bedside manner! Dita was thorough and present with me before, during and after the treatment.\n\nThe staff is friendly and professional. No complaints! I will be back for another session and to try out other treatments.",
    "createTime": "2025-06-12T06:08:18.951667Z",
    "updateTime": "2025-06-12T06:08:18.951667Z",
    "reviewReply": {
      "comment": "Hi Rachel,\nThank you so much for taking the time to share your experience with us. We really appreciate it.\nWe’re really happy to hear that your colon hydrotherapy session with Dita at Cocoon Medical Spa Canggu went so well, indeed, she puts a lot of heart into her work, and your kind words will mean a lot to her. It’s also great to know you felt welcomed by the rest of the team. We can’t wait to have you back, whether it’s for another session or to try something new. \nThanks again for the trust! We look forward to welcoming you soon!\nBest regards, \nCocoon Medical Spa Canggu Team",
      "updateTime": "2025-07-09T15:23:47.494278Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJYTFrY3pidVl2eTR3RRAB"
  }, {
    "reviewer": {
      "displayName": "Ashleigh McNaughton"
    },
    "starRating": "FIVE",
    "comment": "Had microdermabrasion with nurse Dita, Diah and Dr Eva. Very friendly informative staff, comfortable procedure. Would recommend",
    "createTime": "2025-06-07T08:05:34.872308Z",
    "updateTime": "2025-06-07T08:05:34.872308Z",
    "reviewReply": {
      "comment": "Thank you for your lovely feedback! We’re so glad you had a comfortable experience with Nurse Dita, Diah, and Dr. Eva. Your kind words about our team mean a lot, and we truly appreciate your recommendation. Looking forward to welcoming you back soon!\n\nWarm regards,\nThe Cocoon Team",
      "updateTime": "2025-06-11T06:36:08.267591Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJZlctTkhacWN1d3h3RRAB"
  }, {
    "reviewer": {
      "displayName": "Kimberly M"
    },
    "starRating": "FIVE",
    "comment": "Booked in via WhatsApp for a same day treatment. Super easy to do. Quick response. Headed to the Canguu clinic where I had a colon cleanse with Kathleen, she was super helpful and informative. She also spoke amazing English which helped! I booked a follow up appointment with her. Highly recommend if you are looking for a closed colon cleanse. Venue was super clean as well.",
    "createTime": "2025-06-05T07:59:01.366329Z",
    "updateTime": "2025-06-05T07:59:01.366329Z",
    "reviewReply": {
      "comment": "Hi Kimberly, Thank you for your wonderful review! We’re so glad to hear that booking via WhatsApp was easy and that Kathleen provided helpful and informative care during your colon cleanse. We’ll be sure to pass along your kind words to her. It’s great to know you found our Canggu clinic clean and welcoming. We look forward to seeing you again for your follow-up appointment! - Cocoon Team",
      "updateTime": "2025-06-06T02:26:14.390695Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJcnY4ZTNFN1BiM3BRRRAB"
  }, {
    "reviewer": {
      "displayName": "Pooja Khetan"
    },
    "starRating": "FIVE",
    "comment": "Booked a gold detox at the Canggu branch from overseas and the staff were very helpful and accommodating. I had a great session with both Kathleen and Tini who took care of me all the way.",
    "createTime": "2025-06-05T06:30:06.451193Z",
    "updateTime": "2025-06-05T06:30:06.451193Z",
    "reviewReply": {
      "comment": "Hi Pooja, Thank you for choosing Cocoon Spa all the way from overseas! We’re delighted to hear that Kathleen and Tini took great care of you during your Gold Detox session at our Canggu branch. We truly appreciate your kind words and hope to welcome you back again soon! - Cocoon Team",
      "updateTime": "2025-06-06T02:33:38.348271Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VKYUpxOERVZzh5R0N3EAE"
  }, {
    "reviewer": {
      "displayName": "Cristina Vulart de Torres"
    },
    "starRating": "FIVE",
    "comment": "I had a wonderful experience with my facial treatment. Tini was incredibly kind and professional, making me feel comfortable and well cared for throughout the entire session.",
    "createTime": "2025-06-03T03:30:48.877849Z",
    "updateTime": "2025-06-03T03:30:48.877849Z",
    "reviewReply": {
      "comment": "Hi Cristina, Thank you for sharing your experience! We\u0027re so glad to hear you enjoyed your facial treatment and that Tini made you feel comfortable and cared for. She’ll be delighted to receive your kind words. We look forward to welcoming you back soon! - Cocoon Team",
      "updateTime": "2025-06-06T02:54:44.056623Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VMVGg2NXZPNmYtRVZREAE"
  }]
}