{
  "reviews": [{
    "reviewer": {
      "displayName": "T M"
    },
    "starRating": "FIVE",
    "comment": "Very friendly and professional staff (i.e. Ayu and Weby) Relaxing facial experience overall.",
    "createTime": "2025-08-26T04:25:36.420528Z",
    "updateTime": "2025-08-26T04:25:36.420528Z",
    "reviewReply": {
      "comment": "Thank you so much for sharing your experience! We’re delighted to hear that Ayu and Weby made you feel welcomed and that you enjoyed a relaxing facial. Your kind words mean a lot to our team, and we look forward to pampering you again soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-26T09:49:31.974976Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25GeVRGRjJPVlpJYnkxVmJtbEhkbWhFWVVoa2NGRRAB"
  }, {
    "reviewer": {
      "displayName": "Céline Leandri"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Thank you to Wida and Weby for their attentive and professional care. I highly recommend ❤️❤️❤️\n\n(Original)\nMerci à Wida et Weby pour leur soin attentif et professionnel. Je recommande chaleureusement ❤️❤️❤️",
    "createTime": "2025-08-23T10:09:14.220870Z",
    "updateTime": "2025-08-23T10:09:14.220870Z",
    "reviewReply": {
      "comment": "Merci beaucoup, Céline, \nThank you for your lovely words! We’re so happy to hear that Wida and Weby made your experience attentive and professional. Your warm recommendation means a lot to us, and we look forward to welcoming you back très bientôt.\nWarm regards,\n\nCocoon Canggu Team",
      "updateTime": "2025-08-26T09:19:56.691111Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2sxbFdYWmlNMDlXTldWdU0weHllVEExYzBOWmEzYxAB"
  }, {
    "reviewer": {
      "displayName": "Amy Baker"
    },
    "starRating": "FIVE",
    "comment": "Beautiful center, expert service. I have utilized the Ubud facility previously. Nusa Dua facility is beautiful. Very happy with the botox treatment. Miranda was wonderful setting everything up with the schedule and arranged complimentary pickup service for me as well.",
    "createTime": "2025-08-23T09:27:58.818680Z",
    "updateTime": "2025-08-23T09:27:58.818680Z",
    "reviewReply": {
      "comment": "Hi Amy, what a joy to read your review! It means so much that you’ve trusted us not only in Ubud but now also in Nusa Dua. We’re thrilled that you felt cared for from start to finish and that Miranda could make your visit seamless with the scheduling and pickup service. We’ll be sure to pass along your lovely words to her and the team. We can’t wait to welcome you back for your next visit—whether in Ubud, Nusa Dua, or Canggu or Legian Branch.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-26T09:18:17.692452Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xGUWVVTXdYMlozU0daM2FESnBaVmRNUm1sNlkzYxAB"
  }, {
    "reviewer": {
      "displayName": "Emma Leck"
    },
    "starRating": "FIVE",
    "comment": "I had laser hair removal at the canggu branch with Ayii and she was very attentive and professional throughout the service I felt very comfortable. Weby was also so friendly and welcoming when I arrived. The whole staff give you a premium experience, are very knowledgeable and you are very looked after.",
    "createTime": "2025-08-23T08:48:55.278009Z",
    "updateTime": "2025-08-23T08:48:55.278009Z",
    "reviewReply": {
      "comment": "Hi Emma, \nThank you so much for sharing your experience! We’re delighted to hear that Ayu made you feel comfortable and well taken care of during your treatment, and that Weby gave you such a warm welcome. We’ll be sure to share your kind words with the team. We truly appreciate your trust and look forward to seeing you again soon!\nCocoon Canggu Team",
      "updateTime": "2025-08-26T09:16:39.344390Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2taalJVdzRWazlqY2xSbU1rZzFWM2h1Vms5T00yYxAB"
  }, {
    "reviewer": {
      "displayName": "Lisa Schuster"
    },
    "starRating": "FIVE",
    "comment": "I am absolutely thrilled with this beauty clinic! The service was outstanding from start to finish – very friendly, attentive, and professional. The treatment itself was excellent, and I felt comfortable and well taken care of the entire time. You can tell they work with great expertise and attention to detail.\n\nThe results even exceeded my expectations. I can truly recommend this clinic to anyone who values quality, service, and an amazing treatment experience. Simply perfect – I will definitely come back!",
    "createTime": "2025-08-23T05:57:24.372357Z",
    "updateTime": "2025-08-23T05:57:24.372357Z",
    "reviewReply": {
      "comment": "Thank you so much, Lisa, for your beautiful feedback.  We’re delighted to know you felt cared for from the moment you arrived and that the results exceeded your expectations. Our team takes great pride in combining expertise with genuine attention to detail, and it means the world to hear that it made such a difference for you. We can’t wait to welcome you back for your next visit.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-23T09:52:48.676492Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tsaVlVWnNOa0p3WVVKV1gxOUhXVVpDWDNGdFExRRAB"
  }, {
    "reviewer": {
      "displayName": "N Dave"
    },
    "starRating": "FIVE",
    "comment": "I had a lovely experience with the team at Cocoon Medical Spa in Canggu.  Weby welcomed me with her gentle warmth and kindness.  Then Tini performed magic with the Cocoon Signature Hydra Facial, 90 mins of pure bliss leaving my skin, smooth,  hydrated and glowing.   Highly recommend!",
    "createTime": "2025-08-22T04:30:55.421072Z",
    "updateTime": "2025-08-22T04:30:55.421072Z",
    "reviewReply": {
      "comment": "Hi N Dave,\nWe truly appreciate your kind words. It’s wonderful to know that Weby’s warm welcome and Tini’s touch made your Cocoon Signature Hydra Facial a memorable escape of relaxation and renewal. ✨ Your skin’s glow is our greatest reward, and we look forward to creating another rejuvenating experience for you on your next visit.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-23T08:31:06.183845Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2paUlEyNHlRazF0Y0hseU9EQlZNMWRTWVZCU1VXYxAB"
  }, {
    "reviewer": {
      "displayName": "Mana Dave"
    },
    "starRating": "FIVE",
    "comment": "The service from the team was amazing. Miranda was incredibly efficient and helpful organising my booking via WhatsApp. Weby on front of house was professional and friendly. My therapist Tini worked her magic with the Cocoon Signature 360 Hydra Facial - would highly recommend it! PS - the fit out is stunning.",
    "createTime": "2025-08-21T04:53:22.726589Z",
    "updateTime": "2025-08-21T04:53:22.726589Z",
    "reviewReply": {
      "comment": "Thank you for sharing your experience with us. 🌸 We’re so pleased to hear that Miranda made your booking smooth and easy, Weby gave you a warm welcome, and Tini delivered a magical Cocoon Signature 360 Hydra Facial. Hi Mana,\nThank you so much for your several visit to Cocoon Canggu during your short vacation in Bali.\nYour kind words about our team and our spa setting mean so much, we look forward to welcoming you back for another beautiful experience soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-23T08:34:16.913809Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT205R2RIbzBZMDVrWVROa2RIQmtWUzFvTUdaVlZWRRAB"
  }, {
    "reviewer": {
      "displayName": "Ekaterina Grigoreva"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Beauty salon that opened quite recently. New equipment and design. Very professional staff 👍 Special thanks to Kathleen, Tini, Webi and manager Santi. All DETOX LAB procedures are just super 👍\n\n(Original)\nСалон красоты который открыли совсем недавно . Новое оборудование и дизайн . Очень профессиональные сотрудники 👍 Особое спасибо Kathleen , Tini , Webi и менеджеру Santi .  Все процедуры DETOX LAB просто супер 👍",
    "createTime": "2025-08-20T05:08:28.026692Z",
    "updateTime": "2025-08-20T05:08:28.026692Z",
    "reviewReply": {
      "comment": "Dear Ekaterina,\n\nThank you so much for your wonderful review and support! We’re so happy you enjoyed our newly opened clinic, equipment, and design of Cocoon Canggu Branch. It means a lot to hear that you found our team professional, and your special mention of Kathleen, Tini, Weby, and Manager Santi will absolutely make their day! We\u0027re also thrilled that you loved the Detox Lab procedures.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-21T04:06:14.007825Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2s4M2FrNVZZalZEYlc4Mk1YSlZTbmRVV0cxV05uYxAB"
  }, {
    "reviewer": {
      "displayName": "Chef Max Mariola"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Fantastic experience. European-level service 👍 Compliments to the staff and especially to nurse Kathleen, therapist Tini and Resectionist Weby. See you soon!\n\n(Original)\nFantastica esperienza . Servizio al livello europeo 👍 Complimenti allo staff e specialmente a infermiera Kathleen , terapista Tini e Reseptionist Weby .  Ci vediamo presto !",
    "createTime": "2025-08-20T05:02:40.969944Z",
    "updateTime": "2025-08-20T05:02:40.969944Z",
    "reviewReply": {
      "comment": "Dear Chef Max Mariola,\n\nGrazie mille for your wonderful review! We’re thrilled to hear that you had a fantastic experience and that our service met European standards. A special thank you for recognizing Nurse Kathleen, Therapist Tini, and Receptionist Weby, they’ll be so happy to hear your kind words. We truly look forward to welcoming you back soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-21T04:04:19.085423Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWR1dVOUJiRzFsUVROMlVYSnBRVlpXVVZaUWJFRRAB"
  }, {
    "reviewer": {
      "displayName": "Fabian Braunmüller"
    },
    "starRating": "FIVE",
    "comment": "Great experience in medical spa canggu today! Thanks to Ayu and Weby!!! Recommend",
    "createTime": "2025-08-19T09:27:18.221106Z",
    "updateTime": "2025-08-19T09:27:18.221106Z",
    "reviewReply": {
      "comment": "Dear Fabian,\nThank you for your kind words and recommendation. We’re so pleased to know that Ayu and Weby helped make your visit such a wonderful experience. It’s always our goal to provide exceptional care, and we look forward to welcoming you back to Cocoon Canggu soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-23T07:59:01.490917Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pKNVQxTXpRVXN3TW01M0xXSXpibVZxVkZweExXYxAB"
  }, {
    "reviewer": {
      "displayName": "Laura Würfel"
    },
    "starRating": "FIVE",
    "comment": "Thank you dr. Eva, Ayu and Weby for the nice dermapen treatment ❤️",
    "createTime": "2025-08-19T04:42:10.284213Z",
    "updateTime": "2025-08-19T04:42:10.284213Z",
    "reviewReply": {
      "comment": "Dear Laura,\n\nThank you so much for your kind words and for taking the time to leave us a review. We\u0027re delighted to hear that you enjoyed your Dermapen treatment with Dr. Eva, Ayu, and Weby. Your satisfaction means the world to us, and we look forward to welcoming you back for your next visit.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-21T04:03:12.079175Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWRmR6UkVXVU5xWVhOaWVFZDRjSHBZUjFSbVNYYxAB"
  }, {
    "reviewer": {
      "displayName": "Claudia Cañas"
    },
    "starRating": "FIVE",
    "comment": "I had a treatment here with nurse Ima and she was amazing! Webi and Ria from front office were also very helpful and the center is beautiful and very well located in Canggu",
    "createTime": "2025-08-16T08:04:51.405556Z",
    "updateTime": "2025-08-16T08:04:51.405556Z",
    "reviewReply": {
      "comment": "Hi Claudia,\nWe’re delighted to hear you had such a positive treatment experience with Nurse Ima and that Weby and Ria made you feel well cared for at the front office. It’s also wonderful that you enjoyed our beautiful Canggu center and location. We look forward to seeing you again soon!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T08:56:20.909595Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21SM1pEVkNaM1JHYzFCbVEwNU5WMEowVjA5QlZGRRAB"
  }, {
    "reviewer": {
      "displayName": "Philippe Kadilu"
    },
    "starRating": "FIVE",
    "comment": "It was great I got a 360 hydrafacial and add on extraction and honestly Tini the therapist did a great job in making sure I was comfortable and made the whole process super easy, my skin after the treatment felt amazing I could honestly do it again. Would highly recommend. Thank you Tini and thank you Cocoon!",
    "createTime": "2025-08-16T06:34:31.485062Z",
    "updateTime": "2025-08-16T06:34:31.485062Z",
    "reviewReply": {
      "comment": "Hi Philippe,\nThank you so much for sharing your experience! We’re thrilled that your 360 Hydrafacial with extraction left your skin feeling amazing, and that Tini’s care and attention made the whole process so easy and comfortable for you. It means a lot to know you would happily do it again and recommend us. We’ll be here to welcome you back whenever you’re ready for your next treatment.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T08:55:30.173733Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT20xQ1dYUXlaMEphYUhSbWVsaFZkRE5XY0d0TFExRRAB"
  }, {
    "reviewer": {
      "displayName": "Anastasiia Korniienko"
    },
    "starRating": "FIVE",
    "comment": "Very nice place with professional service!\nMade colony therapy, IV, massage and crystal mat! Feeling brand new)Highly recommend",
    "createTime": "2025-08-16T05:13:38.930299Z",
    "updateTime": "2025-08-16T05:13:38.930299Z",
    "reviewReply": {
      "comment": "Hi Anastasiia,\nThank you for taking the time to share your experience! We’re thrilled to know that your visit, including colon hydrotherapy, IV therapy, massage, and the crystal mat, left you feeling brand new. It means a lot that you found the service professional and the atmosphere enjoyable. We truly appreciate your recommendation and look forward to welcoming you back for more rejuvenating treatments.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T08:54:34.569626Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tSNFRVVkhaemhZWDA4d1pFOUJTRlJTU0VkNVFtYxAB"
  }, {
    "reviewer": {
      "displayName": "Neha"
    },
    "starRating": "FIVE",
    "comment": "I had a wonderful experience at Cocoon Medical Spa receiving a Supercharge immunity IV drip. All of the staff were fantastic, including Ayu and Weby. Nurse Kathleen was incredible and made sure to answer any questions I had, as well as making the entire process smooth and relaxing. The foot massage and complimentary ginger water were also really lovely touches, really rounding the experience. The space was clean, beautiful and I highly recommend coming here!",
    "createTime": "2025-08-15T10:08:17.061059Z",
    "updateTime": "2025-08-15T10:08:17.061059Z",
    "reviewReply": {
      "comment": "Hi Neha,\nWe’re so pleased to hear you had such a wonderful experience with your Supercharge Immunity IV Drip. It’s great that Nurse Kathleen’s care and attention helped you feel at ease, and that Ayu and Weby made the visit extra enjoyable. We’re also glad you appreciated the foot massage, ginger water, and the clean, welcoming atmosphere. Thank you for recommending us — we can’t wait to see you again!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T08:53:29.073660Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21RdFZHdGhjRFZZZGtFelMxUk5ZMkZqVVVZNGRXYxAB"
  }, {
    "reviewer": {
      "displayName": "Divya Jagtiani"
    },
    "starRating": "FIVE",
    "comment": "Would highly recommend the Cocoon Medical Spa in Canggu. I had the supercharger IV drip which was painless and administered by Nurse Kathleen. The whole team - Nurse Kathleen, Tini and Weby made the experience enjoyable! I feel refreshed and energised after my treatment. Thanks again!",
    "createTime": "2025-08-15T10:07:09.708877Z",
    "updateTime": "2025-08-15T10:07:09.708877Z",
    "reviewReply": {
      "comment": "Hi Divya,\nThank you so much for sharing your experience and for recommending Cocoon Canggu! We’re delighted that your Supercharger IV Drip with Nurse Kathleen was painless and effective, and that the care from Tini and Weby made your visit so enjoyable. It’s fantastic to hear you left feeling both refreshed and energized. We truly appreciate your feedback and look forward to seeing you again.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T06:02:15.117718Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tGWmFGUjJVM2RETVdoVVVuSndXRkowTmxCc09GRRAB"
  }, {
    "reviewer": {
      "displayName": "safa ghoul"
    },
    "starRating": "FIVE",
    "comment": "The facial was nice and relaxing. The staff were very friendly. Worth a visit.",
    "createTime": "2025-08-15T05:29:10.929922Z",
    "updateTime": "2025-08-15T05:29:10.929922Z",
    "reviewReply": {
      "comment": "Hi Safa,\nWe’re so pleased to hear you had a relaxing facial and that our friendly staff made your visit enjoyable. Thank you for recommending us, we look forward to seeing you again soon!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:58:45.587366Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tacFVIcFlWakZKWDBwS2NFWlpSemxSYkhsNGJsRRAB"
  }, {
    "reviewer": {
      "displayName": "Kate Kelly"
    },
    "starRating": "FIVE",
    "comment": "Brilliant experience at the new Cocoon Spa in Canggu today.  Amazing staff, quality and beautiful treatment rooms, most comfortable massage bed ever. I got the gold detox package? Wida was my nurse for the hydrotherapy and was super professional, Ayu gave a great massage and Weby looked after me beautifully between treatments.  Super relaxing and top notch experience, highly recommend! Miranda also made the booking process on whatsapp super easy 😍",
    "createTime": "2025-08-14T07:49:17.253948Z",
    "updateTime": "2025-08-14T07:49:17.253948Z",
    "reviewReply": {
      "comment": "Hi Kate,\nThank you for sharing your wonderful experience! We’re delighted that Wida, Ayu, Weby, and Miranda all made your Gold Detox Package so relaxing and enjoyable. We look forward to welcoming you back again soon.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:57:13.610650Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xWaUxXOHRiMjFSYTBaSFVDMXBSRVJPTFd0dU0zYxAB"
  }, {
    "reviewer": {
      "displayName": "Jasmin"
    },
    "starRating": "FIVE",
    "comment": "I had an incredible experience at Cocoon Canggu. I booked a Hydrofacial with Miss Ayuk, which was absolutely wonderful and so relaxing – and as a bonus, I even received a lovely hand massage. I also had a consultation and Botox treatment with Dr. Eva, who was highly professional and really took the time to listen to my wishes. She made me feel completely at ease and delivered great results. My visit to Cocoon Canggu was such a treat, and I would definitely recommend it to anyone considering these treatments!",
    "createTime": "2025-08-13T05:13:51.572044Z",
    "updateTime": "2025-08-13T05:13:51.572044Z",
    "reviewReply": {
      "comment": "Hi, Jasmin,\nThank you for taking the time to share such a detailed and thoughtful review. We’re thrilled that your Hydrofacial with Ayuk was both relaxing and pampering, and that Dr. Eva’s professionalism and attentive care made your consultation and Botox treatment a comfortable and positive experience. It means a lot to know your visit felt like a treat and that you left with results you’re happy with. We truly appreciate your recommendation and look forward to welcoming you back.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:55:24.034959Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21JMWFrTnRjRVJrWmxkTGNEaFVZa3g0ZFZWUFdFRRAB"
  }, {
    "reviewer": {
      "displayName": "Marion Stoop"
    },
    "starRating": "FIVE",
    "comment": "I just had a treatment and I\u0027m very happy. Tini has the best hands for massage!\nNice location, nice staf,  beautiful and clean salon.\nOverall very happy\nThanks Tini, Weby and Ria",
    "createTime": "2025-08-13T03:09:42.039998Z",
    "updateTime": "2025-08-13T03:09:42.039998Z",
    "reviewReply": {
      "comment": "Hi Marion,\nWe’re delighted to hear how much you enjoyed your treatment! Tini will be thrilled to know her massage made such a difference, and Weby and Ria will be happy their care added to your experience. Thank you for highlighting our salon — we can’t wait to see you again!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:53:04.687218Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25vMFUxaFJhWFJGU2xNNU1UVk1XRkJKTldsVWRVRRAB"
  }]
}