{
  "reviews": [{
    "reviewer": {
      "displayName": "jackson teo"
    },
    "starRating": "FIVE",
    "comment": "Had my first facial at Cocoon Canggu. Tini was great and was very meticulous and I actually felt so relaxed, I fell asleep.  Recommended!",
    "createTime": "2025-04-03T07:07:54.358364Z",
    "updateTime": "2025-04-03T07:07:54.358364Z",
    "reviewReply": {
      "comment": "Thank you for your lovely review! We’re so happy to hear that Tini took such great care of you during your first facial at Cocoon Canggu. It’s wonderful that you felt so relaxed that you even fell asleep! We’re so glad you had such a positive experience and appreciate the recommendation. We can’t wait to welcome you back soon! ",
      "updateTime": "2025-04-08T10:10:12.842612Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNJbWNDeThBRRAB"
  }, {
    "reviewer": {
      "displayName": "adinda serafim"
    },
    "starRating": "FIVE",
    "comment": "the place really is aesthetic, it was my first impression :D\ni heard about how it is recommended to come and have something there. i came to visit and turned out i had my best facial in canggu! (also the staff are all friendly; a good one)",
    "createTime": "2025-04-03T06:11:39.507299Z",
    "updateTime": "2025-04-03T06:11:39.507299Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We’re thrilled that our aesthetic made such a great first impression on you. We’re even happier to hear that you had your best facial in Canggu with us! It’s also fantastic to know that our staff made your experience even better. We can’t wait to welcome you back for more treatments and great experiences!",
      "updateTime": "2025-04-08T10:11:01.426782Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNJNmZybnRBRRAB"
  }, {
    "reviewer": {
      "displayName": "Andhita Fiqih"
    },
    "starRating": "FIVE",
    "comment": "The place was really beautiful and the service was excellent. I had the best Lip Filler in Canggu ❤️",
    "createTime": "2025-04-03T05:34:44.187467Z",
    "updateTime": "2025-04-03T05:34:44.187467Z",
    "reviewReply": {
      "comment": "Thank you so much for your kind words! We\u0027re so glad you loved the beauty of our space and the excellent service. It’s wonderful to hear that you had the best lip filler experience in Canggu with us! We can’t wait to welcome you back for more treatments in the future. ",
      "updateTime": "2025-04-08T10:11:21.246398Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNJNlpDblJ3EAE"
  }, {
    "reviewer": {
      "displayName": "naysilah ali"
    },
    "starRating": "FIVE",
    "comment": "Best spa in Bali it was great ,amazing experience thank you so much cocoon wellness spa",
    "createTime": "2025-04-03T04:48:28.599874Z",
    "updateTime": "2025-04-03T04:48:28.599874Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We’re thrilled to hear that you had an amazing experience with us. It’s our pleasure to provide you with the best spa experience in Bali, and we can’t wait to welcome you back for more relaxing treatments. ",
      "updateTime": "2025-04-08T10:12:55.771620Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNJcVl5VGtBRRAB"
  }, {
    "reviewer": {
      "displayName": "Petra Lee"
    },
    "starRating": "FIVE",
    "comment": "Great facial by Tini and very good results on my facial. Good location,great service! Coming back again!",
    "createTime": "2025-04-03T04:42:34.421532Z",
    "updateTime": "2025-04-03T04:42:34.421532Z",
    "reviewReply": {
      "comment": "Thank you for your fantastic review! We\u0027re so glad to hear you had a great facial with Tini and are happy with the results. It’s wonderful that you enjoyed our location and service, and we can’t wait to welcome you back for your next visit!",
      "updateTime": "2025-04-08T10:13:25.865295Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNJcWFUWlN3EAE"
  }, {
    "reviewer": {
      "displayName": "Mieke Coster"
    },
    "starRating": "FIVE",
    "comment": "Absolutely fantastic experience at Cocoon Medical Spas Canggu site. Went for colon hydrotherapy - staff were extremely professional, explained every step of the process and were friendly! They truly listen to your needs and look after you. The place is super hygienic and classy! Fully recommended!",
    "createTime": "2025-04-02T21:49:29.638517Z",
    "updateTime": "2025-04-02T21:49:29.638517Z",
    "reviewReply": {
      "comment": "Thank you so much for your amazing review! We\u0027re thrilled to hear you had such a fantastic experience at our Canggu location. Our team takes great pride in providing professional, attentive care, and we\u0027re so glad you felt well taken care of during your colon hydrotherapy session. Cleanliness and comfort are top priorities for us, and it’s wonderful to know that came through. We truly appreciate your recommendation and hope to welcome you back again soon!",
      "updateTime": "2025-04-08T10:29:57.691104Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNJc2ZuWWtRRRAB"
  }, {
    "reviewer": {
      "displayName": "Muggle Born"
    },
    "starRating": "FIVE",
    "comment": "Very comfortable place, shout out to Gauri, the friendliest therapist in the neighborhood 🤗\nGinger tea after massage is always a nice touch",
    "createTime": "2025-03-22T08:53:55.980117Z",
    "updateTime": "2025-03-22T08:53:55.980117Z",
    "reviewReply": {
      "comment": "Thank you for the kind words! We\u0027re so happy to hear you felt comfortable and well taken care of. Gauri will be absolutely thrilled to get a shoutout — she really is a gem! 😊 And yes, nothing like a cup of ginger tea to wrap up a relaxing massage. Looking forward to having you back again soon!",
      "updateTime": "2025-04-08T10:30:49.566113Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUN3MzhIRmdnRRAB"
  }, {
    "reviewer": {
      "displayName": "Juan Pantion"
    },
    "starRating": "FIVE",
    "comment": "Excellence Medical and SPA Services\nMy experience at Cocoon has been exceptional from the very beginning. The team is highly professional, providing attentive and personalized service that made me feel in the best hands.\n\nI chose the colon hydrotherapy and vitamin IV and Botox and was impressed by the staff\u0027s dedication to explaining each step of the procedure, ensuring I felt comfortable and safe throughout. The facilities are modern and extremely clean, which gave me great peace of mind. The location is excellent, central in Canggu and echo beach.\n\nAfter the treatment, I felt revitalized and experienced a general sense of well-being. I highly recommend Cocoon to anyone seeking high-quality treatments and unmatched care. I will definitely return for future treatments.",
    "createTime": "2025-01-11T07:56:57.607424Z",
    "updateTime": "2025-03-19T10:10:13.012110Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We’re thrilled to hear that your experience at Cocoon was exceptional from start to finish. Our team is committed to providing personalized care and ensuring each guest feels comfortable and well taken care of, so we’re delighted to know that you felt in great hands during your treatments.\n\nIt’s fantastic to hear that you enjoyed the colon hydrotherapy, vitamin IV, and Botox, and that our modern, clean facilities contributed to your peace of mind. We look forward to welcoming you back for future treatments and are so grateful for your high recommendation. Take care, and we can’t wait to see you again soon!",
      "updateTime": "2025-04-08T10:40:21.359684Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnSURmNzR6aldnEAE"
  }, {
    "reviewer": {
      "displayName": "agus plenger"
    },
    "starRating": "FIVE",
    "comment": "the best place massage in canggu 😍😍😍",
    "createTime": "2025-03-19T08:15:38.363017Z",
    "updateTime": "2025-03-19T08:15:38.363017Z",
    "reviewReply": {
      "comment": "Thank you so much for the love! We\u0027re thrilled to be your top pick for massages in Canggu! 😍 We can\u0027t wait to welcome you back for another relaxing experience soon.",
      "updateTime": "2025-04-08T10:40:36.025972Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUN3d2M2SHB3RRAB"
  }, {
    "reviewer": {
      "displayName": "princess kulasa"
    },
    "starRating": "FIVE",
    "createTime": "2025-03-19T00:28:26.537096Z",
    "updateTime": "2025-03-19T00:28:26.537096Z",
    "reviewReply": {
      "comment": "Thank you for the 5-star rating! We\u0027re so glad you had such a fantastic experience with us at Cocoon Medical Spa Canggu. Your feedback means a lot, and we look forward to welcoming you back for more amazing treatments!",
      "updateTime": "2025-04-08T10:45:00.742675Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUN3cnVQSWR3EAE"
  }, {
    "reviewer": {
      "displayName": "Kelly Ariella"
    },
    "starRating": "FIVE",
    "comment": "I’m so happy to have Cocoon Medical Spa open in Canggu! Their staff and treatments are top-notch. I had the hydra facial, and my therapist, Tiny, was incredible. She had very gentle hands and gave me an amazing massage. I almost fell asleep (that’s how relaxing it was). Following my facial, I had an in-depth consultation with Dr. Eva regarding my concerns about facial balancing. She was extremely knowledgeable and kind. I felt very well looked after, and I’ll definitely be coming back for more treatments! Thank you, Cocoon team 💞",
    "createTime": "2025-03-18T06:20:05.107329Z",
    "updateTime": "2025-03-18T06:20:05.107329Z",
    "reviewReply": {
      "comment": "Thank you so much for your kind words! We’re thrilled to hear that you’re enjoying Cocoon Medical Spa in Canggu. Tini will be so happy to hear you loved your HydraFacial and the relaxing massage — we agree, she has a magical touch! 😊 We\u0027re also so glad that Dr. Eva provided you with the thoughtful consultation you were looking for, and that you felt well looked after.\n\nWe can’t wait to welcome you back for more treatments, and we truly appreciate your support. Thank you again for choosing us, and we look forward to seeing you soon! 💞",
      "updateTime": "2025-04-08T10:45:50.211548Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUN3bXNLQlJnEAE"
  }, {
    "reviewer": {
      "displayName": "Jihan Farra"
    },
    "starRating": "FIVE",
    "comment": "I had an amazing experience at Cocoon Medical Spa Canggu! The staff was incredibly professional, friendly, and attentive to every detail. The clinic is clean, modern, and has a relaxing atmosphere. I tried a Hydra facial, and the results were fantastic! The team explained every step thoroughly, making me feel comfortable and well taken care of. I highly recommend this place to anyone looking for high-quality aesthetic and wellness treatments in Bali!",
    "createTime": "2025-03-18T05:28:39.707367Z",
    "updateTime": "2025-03-18T05:28:39.707367Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We’re so happy to hear that you had an amazing experience with us at Cocoon Medical Spa Canggu. Our team strives to provide professional, friendly, and attentive care, and it’s fantastic to know that it made you feel comfortable and well taken care of.\n\nWe’re also glad you loved the HydraFacial and saw fantastic results! Creating a relaxing, modern, and clean environment is a top priority for us, and we’re thrilled that you enjoyed every aspect of your visit. Your high recommendation means the world to us, and we can’t wait to welcome you back for more aesthetic and wellness treatments!",
      "updateTime": "2025-04-08T10:44:32.470116Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUN3Nm8zeEVREAE"
  }, {
    "reviewer": {
      "displayName": "Santhe lab"
    },
    "starRating": "FIVE",
    "comment": "Amazing spa and team !\nAll the time I need to relax and renew my energy I go to cocoon !\nThe facial is my favorite treatment ever , I always leave with that new and fresh look that last for daysss ;)\nThey are in few locations in bali , the one in Canggu is very cool and very near by all cool restaurants and beaches !\nThanks cocoon to always give the best care 🌹",
    "createTime": "2025-03-17T12:30:03.249171Z",
    "updateTime": "2025-03-17T12:30:03.249171Z",
    "reviewReply": {
      "comment": "Thank you so much for the wonderful review! We\u0027re so happy to hear that Cocoon is your go-to spot for relaxation and energy renewal. We\u0027re thrilled that the facial treatment gives you that fresh, glowing look that lasts! 😊\n\nIt’s also great to know you love our Canggu location and its proximity to all the cool spots in Bali. We truly appreciate your kind words about the team, and we’re always here to provide the best care.\n\nThank you again, and we can’t wait to welcome you back soon! ",
      "updateTime": "2025-04-08T10:46:34.631724Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUN3Z3JYRk13EAE"
  }, {
    "reviewer": {
      "displayName": "Tania Thain"
    },
    "starRating": "FIVE",
    "comment": "I attended the spa today beautiful clean and hygienic and staff attentive and kind. I had dermabrasion and laser facial and Botox, so happy with results, would highly recommend I will be back, Thank you so much",
    "createTime": "2025-03-17T09:48:05.580524Z",
    "updateTime": "2025-03-17T09:48:05.580524Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We\u0027re so glad to hear you had a great experience with us. We take pride in maintaining a clean, hygienic space, and we\u0027re thrilled that you felt well taken care of by our attentive and kind staff.\n\nIt’s fantastic to know you\u0027re happy with the results of your dermabrasion, laser facial, and Botox! Your high recommendation means the world to us, and we can’t wait to welcome you back for your next treatment.\n\nThank you again, and we look forward to seeing you soon!",
      "updateTime": "2025-04-08T10:47:02.356071Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUN3dlA3VHdBRRAB"
  }, {
    "reviewer": {
      "displayName": "Lathifah Ambarwati"
    },
    "starRating": "FIVE",
    "comment": "Saw them on IG and decided to try last week for massages and scrub packages. Knowing that they also have spa and thai massage, I did hold back myself to try massage this time. Wow. it was such and amazing experience.\nDefinitely come back again!!",
    "createTime": "2025-03-16T07:45:45.435200Z",
    "updateTime": "2025-03-16T07:45:45.435200Z",
    "reviewReply": {
      "comment": "We’re so happy to hear that you had such an amazing experience with the massage and scrub packages. We’re glad you decided to come in and try our treatments — and we can’t wait to have you back for the Thai massage next time! 😊\n\nThank you again for your kind words, and we look forward to welcoming you back soon!",
      "updateTime": "2025-04-08T10:48:51.589260Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUN3aUtQVnBBRRAB"
  }, {
    "reviewer": {
      "displayName": "Info Segerre"
    },
    "starRating": "FIVE",
    "comment": "When I walked to Canggu someone gave me the flyers of new Medical Spa, to my surprise it\u0027s something I really wanted after 3 days hanging out here in this area. They have spa, facial, massage and scrub, also thai massage. It was absolutely beautiful place to be!!! Staff were nice. Room was cozy. After I had my massage, I could\u0027ve sleep for hours if they\u0027re not waken me up. It\u0027s worth your penny!",
    "createTime": "2025-03-16T06:34:09.822887Z",
    "updateTime": "2025-03-16T07:37:18.782487Z",
    "reviewReply": {
      "comment": "Thank you so much for sharing your experience with us! We’re so glad you discovered us and that our services were exactly what you needed after your time in Canggu. It’s wonderful to hear that you enjoyed the atmosphere, cozy room, and your relaxing massage. We’re also happy to know that the staff made your visit even more enjoyable!\n\nWe’re thrilled you found it worth every penny and look forward to welcoming you back for more pampering. Thank you again for your kind words, and we can\u0027t wait to see you soon!",
      "updateTime": "2025-04-08T10:49:35.299735Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUN3OEstU0NnEAE"
  }, {
    "reviewer": {
      "displayName": "Skaiste Joneliukstyte"
    },
    "starRating": "FIVE",
    "comment": "Lovely, professional doctor and great staff ☺️ Large selection of treatments\n\nBe back!",
    "createTime": "2025-03-13T05:32:32.433728Z",
    "updateTime": "2025-03-13T05:32:32.433728Z",
    "reviewReply": {
      "comment": "Thank you so much for your kind words! 😊 We\u0027re thrilled you had a great experience with our doctor and team. Excited to welcome you back soon!",
      "updateTime": "2025-04-10T01:22:24.685475Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTURRN2NxOVN3EAE"
  }, {
    "reviewer": {
      "displayName": "PUTRI ARDIYANA"
    },
    "starRating": "FIVE",
    "comment": "Thankyou Cocoon for the best botox in Canggu, definitely will come back for another treatment 🫶🏻✨",
    "createTime": "2025-03-08T07:19:17.573879Z",
    "updateTime": "2025-03-08T07:19:17.573879Z",
    "reviewReply": {
      "comment": "Thank you so much for the love! We\u0027re so happy you’re loving your results — can’t wait to welcome you back for your next treatment!",
      "updateTime": "2025-04-10T01:26:02.782499Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNRdjRTUlV3EAE"
  }, {
    "reviewer": {
      "displayName": "Юлия Честикова"
    },
    "starRating": "FIVE",
    "comment": "I did Signature 360 hydrafacial and it was good ! Recommend 👍🏽",
    "createTime": "2025-02-25T06:38:35.185415Z",
    "updateTime": "2025-02-25T06:38:35.185415Z",
    "reviewReply": {
      "comment": "Thank you for the great feedback! 😊 We\u0027re so glad you loved the Signature 360 HydraFacial. Looking forward to seeing you again for more glowing skin!",
      "updateTime": "2025-04-10T01:30:34.576932Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURnd2ZtY3dnRRAB"
  }, {
    "reviewer": {
      "displayName": "Rika Ianastasia Sebayang"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Ms. Krisna highly recommends it.\nI will come again.\n\n(Original)\nMba Krisna reccoment banget\nBakal\nDatang lagi",
    "createTime": "2025-02-22T05:44:06.135578Z",
    "updateTime": "2025-02-22T05:44:06.135578Z",
    "reviewReply": {
      "comment": "Thank you so much for the recommendation! Glad to hear that you are satisfied with Therapist Krisna\u0027s service. We look forward to welcoming you back to Cocoon!",
      "updateTime": "2025-04-10T01:31:21.917462Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURnaU5mMnJ3RRAB"
  }]
}