{
  "reviews": [{
    "reviewer": {
      "displayName": "Lorra Dailey"
    },
    "starRating": "FIVE",
    "comment": "Thank you so much! Incredible experience! Ayu, Erdin, and Santi were amazing! Great ppl and great place! They were so attentive and helpful. Best facial!",
    "createTime": "2025-11-19T07:39:18.301493Z",
    "updateTime": "2025-11-19T07:42:00.177112Z",
    "reviewReply": {
      "comment": "Hi Lorra,\n\nThank you for the kind words. We’re so happy to hear you enjoyed your facial and felt well looked after. Ayu, Erdin, and Santi will be delighted to know they made your visit special.\n\nWe’d love to welcome you back anytime.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T08:00:46.538963Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2psR1JXUkNhbkppZDBSQ2RVaERVRk5uYWpGZlJtYxAB"
  }, {
    "reviewer": {
      "displayName": "Kiaya Wood"
    },
    "starRating": "FIVE",
    "comment": "Absolutely LOVED my cocoon experience and Cocoon signature 360 hydrofacial. I was looking for a hydrofacial to clean out all my poors and then hydrate. This was exactly that and then some+! Hands down the best facial I’ve ever had. Very clean and professional business. Everyone was extremely helpful and spoke English well.This company is modern, updated and fair prices. Ayu, Weby and Janti were very helpful and great during my experience. Excited to get many more treatments here. Bali is the perfect place to treat yourself",
    "createTime": "2025-11-19T02:40:35.655757Z",
    "updateTime": "2025-11-19T02:40:35.655757Z",
    "reviewReply": {
      "comment": "Hi Kiaya,\n\nThank you so much for taking the time to share your experience with us. Reading your words truly means a lot to our entire team. We’re thrilled to hear that the Signature 360 Hydrofacial exceeded your expectations and gave you the results you were hoping for. Knowing it became your favorite facial ever is the best feedback we could hope for.\n\nWe also appreciate your kind words about our therapists and front-of-house team. Ayu, Weby, and Santi will be delighted to hear that their care and professionalism stood out during your visit.\n\nIt’s wonderful to hear that you felt supported, understood, and welcomed throughout your treatment journey. \n\nWe look forward to welcoming you back for more self-care and skin confidence moments during your time in Bali.\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-12-08T07:42:02.910726Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25KaVEzQkNYM1pEYnpCUmRXNVBWVXRDWDFaeldsRRAB"
  }, {
    "reviewer": {
      "displayName": "Nicole Zerbola"
    },
    "starRating": "FIVE",
    "comment": "First experience at Cocoon and it was really nice.\nI tried the Microdermabrasion and it was great.\nThe reservation doe. By WhatsApp and email was already very professional.\nMiranda by WhatsApp was super friendly and detailed.\nAt the spa, i was welcomed by Weby! Good English, very friendly and professional. She explained well about questions i had regarding other treatments.\nAyu was my therapist and was very friendly, explaining every step of the treatment, gentle and professional.\nDefinitely a place to recommend!",
    "createTime": "2025-11-16T06:37:00.705156Z",
    "updateTime": "2025-11-16T06:37:00.705156Z",
    "reviewReply": {
      "comment": "Thank you so much, Nicole. It’s wonderful to hear that your first visit felt smooth and welcoming from the very beginning. Miranda, Weby, and Ayu will be thrilled to know their care and clear communication made a difference for you, they truly enjoy making guests feel comfortable and informed.\n\nWe’re happy you loved the Microdermabrasion, and we’d be delighted to welcome you back whenever you’re ready to try more treatments.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-18T03:34:13.180297Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pNNWMwYzJNME5oYkdaUVVrbE9jRE5rYTJwaGJXYxAB"
  }, {
    "reviewer": {
      "displayName": "Diane Huestis"
    },
    "starRating": "FIVE",
    "comment": "Very nice place yoi will mot regret it .the lady are so nice here and the place is so cool looking .you want good work come here 😀",
    "createTime": "2025-11-15T08:54:36.045384Z",
    "updateTime": "2025-11-15T08:54:36.045384Z",
    "reviewReply": {
      "comment": "Thank you so much, Diane. We’re really glad you enjoyed your visit and felt well taken care of. Our team truly loves creating a warm, welcoming space, and it means a lot that you noticed. We’d be happy to have you back anytime.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-18T03:33:21.352210Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tOamN6VXRlbUZ1VVZVeWJYZDRSV0ZqY21NeVQzYxAB"
  }, {
    "reviewer": {
      "displayName": "Krissy Jesudason"
    },
    "starRating": "FIVE",
    "comment": "My first time in the Canggu branch and I had an amazing experience.  The beds were so comfortable, the treatment was luxurious and service was perfect.\nAyu and Weby did an awesome job! Worth it.",
    "createTime": "2025-11-15T04:44:00.901815Z",
    "updateTime": "2025-11-15T04:44:00.901815Z",
    "reviewReply": {
      "comment": "Thank you, Krissy, for taking the time to share this. We’re delighted that your first visit to our Canggu branch felt so comfortable and luxurious. Ayu and Weby will be thrilled to know they helped make your experience such a good one. We’d love to welcome you back whenever you’re in the area.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-18T03:32:22.971867Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2s1NlMyMUVabWxsVlVkdE1sWlphMk53VEdnMGRrRRAB"
  }, {
    "reviewer": {
      "displayName": "Iwan Sugata"
    },
    "starRating": "FIVE",
    "comment": "Didi it at thrivein event. Awesome!\nTime to take care of myself.",
    "createTime": "2025-11-12T10:35:58.942678Z",
    "updateTime": "2025-11-12T10:35:58.942678Z",
    "reviewReply": {
      "comment": "Hi Pak Iwan,\n\nThank you for sharing that, we’re so glad you discovered us through the ThriveIn event! It’s wonderful that you’ve decided to give yourself some well-deserved care. We’re here whenever you’re ready for your next moment of relaxation and rejuvenation.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-18T03:29:55.032232Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25GME1VNWpabEZOVGxkNlVqQnZNbm94TkdoUGNsRRAB"
  }, {
    "reviewer": {
      "displayName": "Nur Yuksel"
    },
    "starRating": "FIVE",
    "comment": "Very friendly staff, lovely care, and great products! Everything was handled with such kindness and attention. I felt truly looked after. Highly recommend!",
    "createTime": "2025-11-12T03:51:42.851186Z",
    "updateTime": "2025-11-12T03:51:42.851186Z",
    "reviewReply": {
      "comment": "Hi Nur,\n\nThank you so much for sharing this. We’re really glad to hear you felt well cared for during your visit. The team takes a lot of pride in creating a warm, attentive experience, and it means a lot to know that came through for you. We truly appreciate the recommendation and hope to welcome you back anytime you feel like another dose of care.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-18T03:27:25.809901Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2s5ME1rWndTaloxVTFKMVJITTVNblZKTVc5Q1ZtYxAB"
  }, {
    "reviewer": {
      "displayName": "Sacred DivineGoddess"
    },
    "starRating": "FIVE",
    "comment": "It was a wonderful experience! Super professional and very sweet and kind staff. Very clean facilities and beautiful design. I recommend the colon hydrotherapy and red light sauna. Miss Kathleen, Santi \u0026 Webi were amazing!",
    "createTime": "2025-11-04T06:47:12.857966Z",
    "updateTime": "2025-11-04T06:47:12.857966Z",
    "reviewReply": {
      "comment": "Hi, Thank you so much for your lovely words! We’re really happy to hear you enjoyed your experience and felt cared for by Kathleen, Santi, and Weby — they’ll be thrilled to know they made your visit so special. It means a lot that you appreciated both the treatments and the atmosphere we’ve created here at Cocoon. We look forward to welcoming you back soon for more moments of relaxation and wellness.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-11T05:21:37.234100Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pod01WSk9Ra1JTWVRGTWJIZEtTMkZqWTNWUGVVRRAB"
  }, {
    "reviewer": {
      "displayName": "Nevy Widya Pangestika"
    },
    "starRating": "FIVE",
    "comment": "The staff are very friendly,  my first time doing bikini laser,  the staff Ayu,  Weby and Santi make sure that I feel comfortable.",
    "createTime": "2025-10-31T06:25:30.393156Z",
    "updateTime": "2025-10-31T06:27:26.652022Z",
    "reviewReply": {
      "comment": "Thank you so much, Nevy, for your lovely review! 🌸\nWe’re so glad to hear that your first bikini laser experience was comfortable and that Ayu, Weby, and Santi helped make you feel at ease. Your kind words mean a lot to our team.\n\nWe look forward to welcoming you back again soon for more treatments!\n\nWarm regards,\nCocoon Medical Spa Team",
      "updateTime": "2025-11-07T10:25:20.306724Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pKSVZsRnhOM1ZzZVZGYVRrVkJTeTA1VVdWSmVrRRAB"
  }, {
    "reviewer": {
      "displayName": "Sarah Hennings"
    },
    "starRating": "FIVE",
    "comment": "The most beautiful spa. Staff was super professional and on point. Highly recommend",
    "createTime": "2025-10-30T06:47:45.102233Z",
    "updateTime": "2025-10-30T06:47:45.102233Z",
    "reviewReply": {
      "comment": "Dear Sarah,\n\nThank you so much for your kind words. We’re delighted to hear you enjoyed your time at our spa and appreciated the professionalism of our team. Your recommendation means a lot to us, and we hope to welcome you back soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-06T05:16:32.552900Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xKSVZXTjNkRzkwT0RSWVpUUnBkbkZSY2xSSWExRRAB"
  }, {
    "reviewer": {
      "displayName": "Daniel Ryan"
    },
    "starRating": "FIVE",
    "comment": "Cocoon Canggu, was an amazing experience, but more than that the treatment was was even better. Tini, Weby and Santi, made such an enjoyable time. Will definitely be back next time I\u0027m in Canggu.",
    "createTime": "2025-10-29T05:37:00.338970Z",
    "updateTime": "2025-10-29T05:37:27.354355Z",
    "reviewReply": {
      "comment": "Dear Daniel,\n\nThank you for your wonderful feedback. We’re so happy to hear that your experience and treatment exceeded your expectations. Tini, Weby, and Santi will be delighted to know they helped make your visit enjoyable. We look forward to welcoming you back next time you’re in Canggu!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-06T05:08:25.305111Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25CWlMyUlhRWGRFVDI5Nk1XSm1NWFJEZEZKa2EyYxAB"
  }, {
    "reviewer": {
      "displayName": "Kata"
    },
    "starRating": "FIVE",
    "comment": "I had a colonic with Nurse Kathleen. She was very gentle and knowledgeable. The aftercare was very good and I would like to come back for a facial.",
    "createTime": "2025-10-29T05:02:48.892169Z",
    "updateTime": "2025-10-29T05:02:48.892169Z",
    "reviewReply": {
      "comment": "Dear Kata,\n\nThank you for sharing your experience. We’re glad to hear that Kathleen’s gentle care and knowledge made your colonic comfortable, and that you felt supported with the aftercare. We look forward to welcoming you back soon for a facial!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-06T05:06:35.313748Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21JelEzVTRWa1ZNUm1ONU1GWkVlV2hDYUZCWlpXYxAB"
  }, {
    "reviewer": {
      "displayName": "Alex Warnock"
    },
    "starRating": "FIVE",
    "comment": "I had a lovely facial at Cocoon and will becoming back! Tina, Weby, and Santi were very attentive and welcoming. Tini was very thorough and the facial included an arm massage which was great!",
    "createTime": "2025-10-28T09:50:51.361355Z",
    "updateTime": "2025-10-28T09:50:51.361355Z",
    "reviewReply": {
      "comment": "Dear Alex,\n\nThank you for your kind words! We’re so happy to hear you enjoyed your facial and felt well cared for by Tini, Weby, and Santi. That arm massage is definitely a favorite touch! We can’t wait to welcome you back for your next visit.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-06T05:04:53.045951Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT205Q0xXTm5jV0psWjB0WU9XcFJaRTUxV2s1ZlEwRRAB"
  }, {
    "reviewer": {
      "displayName": "Renee Gullo"
    },
    "starRating": "FIVE",
    "comment": "I saw Dr Brill who was transparent and explained my experience so well. I will return",
    "createTime": "2025-10-28T03:48:26.568718Z",
    "updateTime": "2025-10-28T03:48:26.568718Z",
    "reviewReply": {
      "comment": "Dear Renee,\nThank you for your kind words. We’re glad Dr. Brill could provide clear and transparent care that made you feel confident about your experience. We look forward to welcoming you back soon!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-06T05:02:54.154425Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25Wb2NXWlVZak53WjBReU9TMXVUSFZqTldaMGIxRRAB"
  }, {
    "reviewer": {
      "displayName": "Luciana Vargas"
    },
    "starRating": "FIVE",
    "comment": "Excellent service. Dr. Reva quickly identified the issue and provided an effective solution,\nI’m very pleased with the results. Nurse Ayu was gentle, professional, and exceptionally kind throughout the process. I’m truly grateful to have found this clinic and highly recommend it to anyone seeking quality care.",
    "createTime": "2025-10-27T10:14:39.433578Z",
    "updateTime": "2025-10-27T10:14:39.433578Z",
    "reviewReply": {
      "comment": "Dear Luciana,\n\nThank you for sharing your experience with us. We’re so happy to hear that Dr. Reva was able to quickly find the right solution and that Ayu’s gentle care made the process comfortable for you. Your kind words mean a lot, and we truly appreciate your recommendation. We look forward to welcoming you back whenever you need us.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-11-06T02:44:20.338083Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21GbVgyVlFXVWxuUm1KWFdYVmZYelZwYm5GdWQwRRAB"
  }, {
    "reviewer": {
      "displayName": "Danielle Hunt"
    },
    "starRating": "FIVE",
    "comment": "The team at cocoon Canggu are wonderful and super professional. From the moment I arrived and was welcomed but Weby, Surya and Santi, the team was incredibly friendly and helpful. It was my first Colonic and Santi really put me at ease by sharing her similar health challenges. The whole process was done with Kathleen who did the an incredible job, they went beyond to make sure we cleared as much as possible. They are very knowledgeable and lovely 🙏🏼🫶🏼✨\n\nI will be returning for sure.\nIf you are nervous about trying for the first time  I would definitely recommend.",
    "createTime": "2025-10-27T03:22:56.509523Z",
    "updateTime": "2025-10-27T03:22:56.509523Z",
    "reviewReply": {
      "comment": "Hi Danielle,\nThank you so much for your heartfelt words. We’re really glad Weby, Surya, and Santi could make you feel so welcome from the moment you arrived. It means a lot that Santi helped put you at ease, especially on your first colonic experience. Kathleen will be touched to know her care and attention made a difference.\n\nYour recommendation means a lot to us, and we can’t wait to welcome you back for your next visit.\n\nWith gratitude,\nCocoon Canggu Team",
      "updateTime": "2025-11-06T02:43:11.013563Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25seE9VRjZRMnRvUzBnMVIwNURhVVJOYnpOQ1FsRRAB"
  }, {
    "reviewer": {
      "displayName": "Ella Parnell Harrison"
    },
    "starRating": "FIVE",
    "comment": "I had a wonderful very relaxing time. I got the hydra facial and it was amazing, better then some treatment I get back in Australia. Tini was my therapist and was so accomodating and individualised her treatments to suit me. Weby and Santi on reception were very welcoming upon arrival and give you time to relax before you leave.\nThe clinic is so clean, products all sterilised and checked with you before they apply them to your face. Highly recommend !!!",
    "createTime": "2025-10-25T04:01:36.806669Z",
    "updateTime": "2025-10-25T04:01:36.806669Z",
    "reviewReply": {
      "comment": "Hi Ella,\nThank you so much for sharing your experience with us! We’re really happy to hear you enjoyed your HydraFacial and felt so relaxed during your visit. Tini will be thrilled to know her personalized touch made a difference, and Weby and Santi will love hearing that their warm welcome stood out to you.\n\nIt’s wonderful to know you noticed the care we take with cleanliness and products — we believe those little details matter.\n\nWe hope to see you again soon for another pampering visit.\nWith gratitude,\nThe Cocoon Canggu Team",
      "updateTime": "2025-11-04T06:58:27.555783Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWSFduWnNVRzVJWVdZdFpXdFFZbmN4UVdSTE1uYxAB"
  }, {
    "reviewer": {
      "displayName": "Gareth Thomas"
    },
    "starRating": "FIVE",
    "comment": "Amazing spa, with the comfiest massage beds. The people are so nice. Big shout out to Ayu, Kathleen \u0026 Santi for looking after us and providing 5 star service. We will be back!",
    "createTime": "2025-10-24T07:16:46.555894Z",
    "updateTime": "2025-10-24T07:16:46.555894Z",
    "reviewReply": {
      "comment": "Hey Gareth, thank you so much for spending a full day spa with us. From HydraFacial, Kundalini Back Massage to IV Drip, a total relax and recharge! We\u0027re so glad you enjoyed your time with us and found the massage beds comfy. So lovely to hear that! Ayu, Kathleen, and Santi will be delighted to know they made your visit special. We truly appreciate your kind words and can’t wait to welcome you back soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-25T03:48:48.269884Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xwVWFGOXJXR1ZDTm1ONlRtTkJaMVkzV0daNWFIYxAB"
  }, {
    "reviewer": {
      "displayName": "Kirsty Hargreave"
    },
    "starRating": "FIVE",
    "comment": "Had the most beautiful and relaxing day at this gorgeous spa.\n\nTini, Kathleen, Weby and Santi were absolutely fantastic.. Loved every moment and I’ll be back 🤍",
    "createTime": "2025-10-24T07:15:44.356128Z",
    "updateTime": "2025-10-24T07:15:44.356128Z",
    "reviewReply": {
      "comment": "Hey Kirsty! \nThanks so much for the review. We are so happy to hear you had such a beautiful and relaxing day with us. Such a great time having you and Gareth yesterday at Cocoon Canggu for a Cocoon HydraFacial, IV Supercharge, and Kundalini Back Massage.\n\nTini, Kathleen, Weby, and Santi will be so happy to know they made your experience special. We can’t wait to welcome you back for another wonderful visit!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-25T03:41:44.552145Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21wSVpqSmxUMUpCU0dSVVFqQTFNa3hwVjNkcFpFRRAB"
  }, {
    "reviewer": {
      "displayName": "Belle Song"
    },
    "starRating": "FIVE",
    "comment": "Fantastic Balinese massage and thorough extraction facial — Tini was wonderful!",
    "createTime": "2025-10-23T05:10:04.390025Z",
    "updateTime": "2025-10-23T05:10:04.390025Z",
    "reviewReply": {
      "comment": "Thank you, Belle, for sharing your experience! We\u0027re so happy to hear you enjoyed your Balinese massage and extraction facial. Tini will be so pleased to know her care made your visit special. We hope to see you again soon for more relaxation and pampering.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-25T03:33:25.405100Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25BMFUycDBibTkwU25FeVFXaG9WSGRLZDJWd1NGRRAB"
  }]
}