{
  "reviews": [{
    "reviewer": {
      "displayName": "Oh Snap Auckland"
    },
    "starRating": "FIVE",
    "comment": "So happy Cocoon has opened in Canggu! The staff are so lovely and friendly and Dr Eva was very knowledgeable, she gave great advice and the perfect treatment.  ⭐️⭐️⭐️⭐️⭐️",
    "createTime": "2025-07-21T02:45:03.626453Z",
    "updateTime": "2025-07-21T02:45:03.626453Z",
    "reviewReply": {
      "comment": "Hi Oh Snap Auckland, Thank you so much! We\u0027re so happy to hear you\u0027re loving our new Canggu location! 🌴 Dr. Eva and the team will be thrilled to know you felt well taken care of and received the perfect treatment. We truly appreciate your support and 5-star feedback — see you again soon! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-22T05:37:51.496312Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xKblRIaE1WRUp0TldSWE1UbG1aSEo2YnpKS2QyYxAB"
  }, {
    "reviewer": {
      "displayName": "Julia Meck"
    },
    "starRating": "FIVE",
    "comment": "Very kind and good Spa :)",
    "createTime": "2025-07-19T05:18:34.188912Z",
    "updateTime": "2025-07-19T05:18:34.188912Z",
    "reviewReply": {
      "comment": "Hi Julia, \nThank you for your kind words. We are thrilled to know that you enjoyed your treatment with us.\n\nWe hope to see you very soon for another treatment.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-20T03:26:30.205841Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xGRWMzUmtaa2t5UjBSRlVWOW1WekF0VG1VMGEwRRAB"
  }, {
    "reviewer": {
      "displayName": "Divine Feminine"
    },
    "starRating": "FIVE",
    "comment": "Been coming to Coccon for 3 years now for their high quality services with their treatments. The staff is professional and warm always willing to help. Plus they prepare you before and after for all treatments with many places lack in Bali. Will continue to comeback 🌹",
    "createTime": "2025-07-17T10:36:20.305927Z",
    "updateTime": "2025-07-17T10:36:20.305927Z",
    "reviewReply": {
      "comment": "Hi Divine, Thank you so much for your continued trust and loyalty over the past 3 years!\nWe’re truly grateful for your kind words and so happy to hear that you consistently enjoy the quality of our treatments and the care from our team.\n\nIt’s our priority to make sure every guest feels prepared, supported, and well cared for — before, during, and after each treatment. We can’t wait to welcome you back again soon! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-18T08:42:53.182611Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT214UldESkZRbXhNVGpaSFpFNU9XREpqU21GVFRGRRAB"
  }, {
    "reviewer": {
      "displayName": "Denis Bedin"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) The most wonderful spa in Canggu.\nCame for their signature facial program. Was very pleased.\nPlus at the end of the program they gave me a face mask and a voucher for the next visit.\nI can safely recommend it.\nThe price level also, in my opinion, corresponds to the level of quality of service.\n\n(Original)\nПрекраснейший спа в Чангу.\nПришел на их фирменную программу по уходу за лицом. Остался очень доволен.\nПлюс в завершении программы подарили маску для лица и ваучер на следующее посещение.\nСмело рекомендую.\nУровень цен также на мой взгляд соответствует уровню качества сервиса.",
    "createTime": "2025-07-17T08:02:31.038322Z",
    "updateTime": "2025-07-17T08:02:31.038322Z",
    "reviewReply": {
      "comment": "Hi Denis, Thank you so much for your wonderful feedback!\nWe’re delighted to hear you enjoyed your signature facial treatment and that you were happy with the results.\n\nIt’s great to know you appreciated the little extras like the complimentary face mask and voucher — we love treating our guests!\n\nThank you for your kind recommendation, and we look forward to welcoming you back soon in Canggu! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-18T08:43:31.833816Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xGZkxVVkVWMjlTU1ZoTGVIVlNNazFMT0drNU1XYxAB"
  }, {
    "reviewer": {
      "displayName": "Jade"
    },
    "starRating": "FIVE",
    "comment": "Had a wonderful experience at Cocoon. Couldn\u0027t pick a better place in Canggu. The staff are professsional, super friendly and really hospitable. I would highly recommend, and return in a heartbeat :-)",
    "createTime": "2025-07-17T05:55:31.184341Z",
    "updateTime": "2025-07-17T05:55:31.184341Z",
    "reviewReply": {
      "comment": "Hi Jade, Thank you so much for your kind words! 😊\nWe’re so happy to hear that you had a wonderful experience at Cocoon and felt well taken care of by our friendly and professional team.\n\nIt truly means a lot that you would recommend us—and we’d absolutely love to welcome you back anytime. See you again soon in Canggu!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-18T08:44:01.135708Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xWeExXTXhTM3BmY1dOV2RIbDNhRlpUZVRONFRIYxAB"
  }, {
    "reviewer": {
      "displayName": "Justin Walsh"
    },
    "starRating": "FIVE",
    "comment": "Thank you very much to Tini, I had a fabulous hydra facial, I will 100% be back 😊",
    "createTime": "2025-07-17T03:42:45.666258Z",
    "updateTime": "2025-07-17T03:42:45.666258Z",
    "reviewReply": {
      "comment": "Hi Justin, Thank you so much for your lovely feedback! 😊\nWe’re thrilled to hear you enjoyed your HydraFacial with Tini — she’ll be so happy to know you had a fabulous experience.\n\nWe can’t wait to welcome you back again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-18T08:44:53.339377Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT210WVJVZzBRM0JIUjFaZlYyZGljMmhtUlY5NU9VRRAB"
  }, {
    "reviewer": {
      "displayName": "Jess M"
    },
    "starRating": "FIVE",
    "comment": "Great experience at Cocoon! The staff is so incredibly helpful, friendly, and knowledgeable. I felt taken care of every step of the way and would highly recommend going here for any treatments! Miranda offers exceptional customer service :) she is always so accommodating and helpful with anything needed!",
    "createTime": "2025-06-03T08:55:31.977079Z",
    "updateTime": "2025-07-16T11:24:00.814328Z",
    "reviewReply": {
      "comment": "Hi Jess, Thank you so much for your lovely feedback! We\u0027re thrilled to hear you had a great experience at Cocoon and felt well cared for throughout your visit. Our team truly appreciates your kind words and recommendation. We look forward to welcoming you back for future treatments! - Cocoon Team",
      "updateTime": "2025-06-06T02:53:25.160601Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VKTFc0ZS1WamE3UmhBRRAB"
  }, {
    "reviewer": {
      "displayName": "Mizna Khairunnisa (Insomizna)"
    },
    "starRating": "FIVE",
    "comment": "The BEST facial i’ve done so far. I tried the microdermabrasion facial and it was aaawesome. For oily and acne prone with dull skin and pollution, this is a literal game changer. Very light but thorough facial that sucked all the dead skinn cells like vacuum cleaner, literally. Their therapist , Tini, is very skill full that made the treatment even more enjoyable. Plus they have an excellent and calming vibe even since you step in to the place. Would very much recommend this place for anyone looking for their facial upgrades. They also do injections and would keen to try as so far price matches with quality.",
    "createTime": "2025-07-16T09:38:38.865356Z",
    "updateTime": "2025-07-16T09:38:38.865356Z",
    "reviewReply": {
      "comment": "Hi Mizna, \n\nWow such a thorough and wonderful review! Thank you so much! We’re thrilled to hear that you had such a great experience with the microdermabrasion facial and that it made a real difference for your skin. Tini will be so happy to know her skill and care made the treatment even more enjoyable for you, we’re lucky to have her on our team. It’s also lovely to hear you felt the calming atmosphere from the moment you arrived; we put a lot of thought into creating that feeling. \nWe’re looking forward to welcoming you back soon, maybe for your next facial upgrade or to explore our injectable treatments. \n\nThanks again for the trust and the kind words!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-17T06:05:42.262859Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT201WVRUY3hOMFZ3Y1cxNVRreENVWFJtWlVSZlZsRRAB"
  }, {
    "reviewer": {
      "displayName": "Tyler Garcia"
    },
    "starRating": "FIVE",
    "comment": "Very great service, kind staff and detailed process.\n\nDerm microneedling did not hurt!",
    "createTime": "2025-07-16T06:27:47.220072Z",
    "updateTime": "2025-07-16T06:27:47.220072Z",
    "reviewReply": {
      "comment": "Hi Tyler, Thank you for your wonderful feedback! We\u0027re so glad to hear you had a great experience and felt well cared for by our team. It\u0027s great to know the dermal microneedling was comfortable for you — we always aim to make every treatment as smooth and gentle as possible.\n\nWe look forward to seeing you again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-16T09:25:05.915033Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWVVlsOW9lVUpUUVhjdGRuazRUMmhTZURCeFNrRRAB"
  }, {
    "reviewer": {
      "displayName": "lickle man"
    },
    "starRating": "FIVE",
    "comment": "Great spa , had colonic therapy it was very professional staff where very kind and Kathleen was very good and helpful through out the procedure",
    "createTime": "2025-07-15T06:14:03.897702Z",
    "updateTime": "2025-07-15T06:14:03.897702Z",
    "reviewReply": {
      "comment": "Hi Lickle,\nThank you so much for sharing your experience! \n\nWe’re really glad to hear that you felt supported and well cared for during your colonic therapy. Kathleen will be especially happy to know her presence made a difference, she’s deeply committed to making each session as comfortable and reassuring as possible. \n\nWe’ll be sure to pass on your kind words to the entire team. Looking forward to welcoming you back whenever you’re ready for your next wellness moment. \n\nWarmest regards,\n\nCocoon Canggu Team",
      "updateTime": "2025-07-16T07:33:23.810428Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWeWExVkRVV2hDVkV4MlMxVTVkbmhOTkVObWJFRRAB"
  }, {
    "reviewer": {
      "displayName": "MrSunnyDilinger"
    },
    "starRating": "FIVE",
    "comment": "1st time getting a Colon Hydrotherapy. It was amazing. The staff was so sweet as well as professional. I will be coming back and referring my friend as well.",
    "createTime": "2025-07-14T03:31:22.730229Z",
    "updateTime": "2025-07-14T03:31:22.730229Z",
    "reviewReply": {
      "comment": "Hi Sunny, \n\nThank you so much for your kind words. It\u0027s great to know that your first Colon Hydrotherapy experience with us went so well. Our team truly appreciate your compliment. And we\u0027re thrilled you\u0027ll be coming back and even recommending us to your friend. \nIt\u0027s an honor to meet you personally, was nice to chat with you.\nWe look forward to welcome you and your friend soon. \n\n\nWarm regards,\nCocoon Canggu Team\n",
      "updateTime": "2025-07-14T09:30:55.373704Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWQ2VqQllUMWg0ZVZKemQxaEVlWFpmUzJaM1ptYxAB"
  }, {
    "reviewer": {
      "displayName": "Kimmie"
    },
    "starRating": "FIVE",
    "comment": "Great experience. Dr Eva and Tini were amazing",
    "createTime": "2025-07-13T03:52:16.970999Z",
    "updateTime": "2025-07-13T03:52:16.970999Z",
    "reviewReply": {
      "comment": "Hi Kimmie, Thank you for sharing your experience! We\u0027re so glad to hear that Dr. Eva and Tini made your visit amazing. We\u0027ll be sure to pass along your kind words to them. Looking forward to welcoming you back soon! 🌟😊\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-15T04:14:59.561827Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21zdFVuQndabEV0UW5SWlNIaHlkVzh5TTNsMFRsRRAB"
  }, {
    "reviewer": {
      "displayName": "Nicole Levesque"
    },
    "starRating": "FIVE",
    "comment": "Such a great med spa! The place is beautiful and clean, and the staff are all friendly. Dita and Dr. Eva were so helpful, patient, and kind throughout my visit. They helped identify the appropriate treatments, they explained everything, and they were meticulous. Miranda was also very helpful with scheduling many treatments for my friend and I.",
    "createTime": "2025-07-12T05:38:20.177424Z",
    "updateTime": "2025-07-12T05:38:20.177424Z",
    "reviewReply": {
      "comment": "Hi Nicole, \nThank you for your thoughtful review. We\u0027re truly grateful to hear that your experience with us - from the care \nprovided by Dita and Dr. Eva to the support from Miranda with scheduling - met your expectations. It\u0027s always our goal to make each visits as comfortable and helpful as possible, and we\u0027re glad that we could do that for both you and your friend. \nWe appreciate you taking the time to share your experience with us.\nWe look forward to welcoming you back in the near future. \n\nWarm regards, \nCocoon Medical Spa Canggu Team\n",
      "updateTime": "2025-07-12T08:48:59.771376Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2t4QlFrbHpTMnR1ZVVOblIzRjFhblZVZGxSTmRYYxAB"
  }, {
    "reviewer": {
      "displayName": "Romi"
    },
    "starRating": "FIVE",
    "comment": "The best facial in Bali. I’ve enjoyed Coccoon signature hydra facial and my face is glowing! I will definitely come back again next month for another session. Thanks Tini for the attentive care:)",
    "createTime": "2025-07-09T09:17:42.660355Z",
    "updateTime": "2025-07-09T09:17:42.660355Z",
    "reviewReply": {
      "comment": "Hi Romi, Thank you so much for the glowing review—literally! ✨ We\u0027re so happy to hear you loved the Cocoon Signature HydraFacial and that your skin is feeling fresh and radiant. Tini will be thrilled to know her care made your experience extra special. We can\u0027t wait to welcome you back next month! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T01:57:56.475137Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25wMlZqTlZWVzQyY2pSd2VXOXJiSEJoZDBKVlJYYxAB"
  }, {
    "reviewer": {
      "displayName": "Noelle Van Straten"
    },
    "starRating": "FIVE",
    "createTime": "2025-07-09T04:12:08.228526Z",
    "updateTime": "2025-07-09T04:12:08.228526Z",
    "reviewReply": {
      "comment": "Hi Noelle, Thank you so much for the 5-star rating! 🌟 We truly appreciate your support and look forward to welcoming you again soon! - Cocoon Team",
      "updateTime": "2025-07-11T01:58:28.595946Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xkUVFWbDFjMHRFY1habFlVMVNVM0JyZDFKaFgwRRAB"
  }, {
    "reviewer": {
      "displayName": "Hannah Buchberger"
    },
    "starRating": "FIVE",
    "comment": "Tini was wonderful! Very professional and kind :)",
    "createTime": "2025-07-09T03:56:48.989546Z",
    "updateTime": "2025-07-09T03:56:48.989546Z",
    "reviewReply": {
      "comment": "Hi Hannah, Thank you for your lovely words! We\u0027re so happy to hear you had a great experience with Tini — she truly is a gem. We\u0027ll be sure to pass on your kind feedback to her. Hope to see you again soon! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T01:59:15.645747Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pkR1l6SkhURVZTUkdkck5sTlBhM0l4TkVwWVFYYxAB"
  }, {
    "reviewer": {
      "displayName": "Sahara Rose"
    },
    "starRating": "FIVE",
    "comment": "Amazing experience! The staff was caring, delightful and really made you feel tended to the entire way! By far exceeded my expectations! Highly recommend!",
    "createTime": "2025-07-08T10:03:44.096268Z",
    "updateTime": "2025-07-08T10:03:44.096268Z",
    "reviewReply": {
      "comment": "Hello Sahara, Thank you very much for your kind words and thoughtful recommendation. We are delighted to hear that your experience with us exceeded your expectations. It is always our priority to ensure each guest feels well cared for throughout their visit. We truly appreciate your support and look forward to welcoming you again soon. \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:02:48.545894Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25WRWVGaG9NM0F4ZEZoVlZpMUNhVTR3T0RKellVRRAB"
  }, {
    "reviewer": {
      "displayName": "Solenn READ"
    },
    "starRating": "FIVE",
    "comment": "I had a wonderful experience at Cocoon Medical Spa. Nurse Kathleen was absolutely amazing; so gentle, caring, and reassuring throughout the entire session. She really made me feel at ease!\nThe staff is fantastic as well: professional, kind, and welcoming.\nThe space is clean, calming, and feels very safe.\nThey even offered some natural supplements and little drinks after the session, which was such a thoughtful touch.\nHonestly, nothing to complain about! I highly recommend this place, and I’ll definitely be coming back! 🙏✨",
    "createTime": "2025-07-08T04:29:56.224781Z",
    "updateTime": "2025-07-08T04:29:56.224781Z",
    "reviewReply": {
      "comment": "Hi Solenn, Thank you so much for your kind and detailed feedback. We are truly pleased to hear that your experience at Cocoon Medical Spa was a positive one. Nurse Kathleen will be especially grateful for your kind words — she is indeed a valued member of our team. We\u0027re glad you felt at ease and well cared for throughout your visit. It’s wonderful to know that the little touches, like the natural supplements and drinks, added to your overall experience. We deeply appreciate your recommendation and look forward to welcoming you back in the near future. \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:11:49.371550Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tkeVFrVmFVSGx6TWxNNFNXdDNOVTlLUWxkS1dVRRAB"
  }, {
    "reviewer": {
      "displayName": "Boris Van Steene"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) I had a wonderful experience at Cocoon Medical Spa Canggu, a clean, calm, and welcoming place. The atmosphere is soothing, with minimalist yet warm decor that quickly puts you at ease.\n\nThe staff was extremely professional, respectful, and reassuring throughout the process. A big thank you to Kathleen in particular, who guided me well and gently explained each step, allowing me to feel confident and relaxed! I felt very well taken care of and truly appreciated the caring approach of the entire team.\n\nI recommend this place to anyone who wants to take care of their body in a safe and serene environment. Thank you again for this wonderful experience 🙏🌿\n\n(Original)\nJ’ai vécu une superbe expérience au Cocoon Medical Spa Canggu, un lieu propre, calme et accueillant. L’atmosphère y est apaisante, avec une décoration minimaliste mais chaleureuse qui met rapidement à l’aise.\n\nLe personnel a été extrêmement professionnel, respectueux et rassurant tout au long du processus. Un grand merci à Kathleen particulièrement qui m’a bien accompagné, expliqué chaque étape avec douceur, ce qui m’a permis de me sentir en confiance et détendu! Je me suis senti très bien pris en charge et j’ai réellement apprécié l’approche bienveillante de toute l’équipe.\n\nJe recommande cet endroit à celles et ceux qui souhaitent prendre soin de leur corps dans un cadre sûr et serein. Merci encore pour cette belle expérience 🙏🌿",
    "createTime": "2025-07-08T03:31:15.608659Z",
    "updateTime": "2025-07-08T03:31:15.608659Z",
    "reviewReply": {
      "comment": "Hi Boris, Thank you so much for your heartfelt feedback. We’re delighted to hear that your experience at Cocoon Medical Spa Canggu met your expectations. Your kind words about the atmosphere, the setting, and the professionalism of our team — especially Kathleen — truly mean a lot to us. We’re so pleased that you felt supported, at ease, and well cared for throughout your visit. Your recommendation is sincerely appreciated, and we look forward to welcoming you back again soon.\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-11T02:13:22.805715Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT205dWJqTTJUVEpuTURVeFdVNDJZbTFaUzNGclpWRRAB"
  }, {
    "reviewer": {
      "displayName": "Konstantinos Giannopoulos"
    },
    "starRating": "ONE",
    "comment": "European prices non transparent Indonesian quality. Also the place stings. Stay safe stay away.",
    "createTime": "2025-07-07T07:32:41.385220Z",
    "updateTime": "2025-07-07T07:34:36.911569Z",
    "reviewReply": {
      "comment": "Dear guest,\nThank you for taking the time to leave feedback, although we must clarify several inaccuracies of facts.\n\nTo set the record straight, no treatment was performed during your visit. You attended a free consultation lasting approximately 10 minutes. From the outset, our staff and doctor experienced challenging behavior from you, including a refusal to provide your full name or complete the required medical consultation form—both of which are essential for safety and legal compliance.\n\nOur doctor nonetheless proceeded to answer all of your questions professionally and provided detailed information about Botox dosage and treatment options. At no point during the consultation were prices discussed, nor was a quote provided. Therefore, your comments about high pricing are unfounded.\n\nWe take pride in offering respectful, high-quality care to all guests, and we welcome constructive feedback. However, misrepresenting events, especially when no treatment occurred, is misleading and unfair to our team. The nature of your behavior and the inaccuracies in your review raise concerns about the intent behind your comments.\n\nFor all our guests, we welcome comments that will help us improve our services. However we do not accept reviews that are not honest and behaviour that is not respecful of our staff. \n\nSincerely\nCocoon Medical Spa Canggu",
      "updateTime": "2025-07-09T15:28:38.116609Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xaUFRXbEtOREo2ZGtsRmNGZ3llRmN5VVZCVVFVRRAB"
  }]
}