{
  "reviews": [{
    "reviewer": {
      "displayName": "Alexandra Shvarova"
    },
    "starRating": "FIVE",
    "comment": "Today was my second visit and the spa.\nNurse Ima and my other therapist always stand out ❤️\ncoming back soon for facials!",
    "createTime": "2025-07-29T04:52:23.167797Z",
    "updateTime": "2025-07-29T04:52:23.167797Z",
    "reviewReply": {
      "comment": "Dear Alexandra,\nThank you so much for coming back and for your kind words! We’re thrilled to hear that Nurse Ima and our therapist continue to make your visits special We’ll be ready to welcome you back for your next facial soon!\n\nWarm wishes,\nThe Cocoon Medical Spa Canggu Team",
      "updateTime": "2025-07-30T03:39:28.781683Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xCb01YQmFhVEJpUTJ4cGNIbExOWHAyUlVSc1drRRAB"
  }, {
    "reviewer": {
      "displayName": "Dejana Pantic"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) I had a facial cleansing treatment to remove all impurities. The service was excellent and Tini took great care of me. Weby at the reception gave me a warm welcome! I recommend it.\n\n(Original)\nJ’ai fait un soin nettoyant du visage pour enlever toutes les impuretés. Le service était excellent et Tini était au petit soin pour moi. Accueil chaleureux de Weby à la réception ! Je recommande.",
    "createTime": "2025-07-28T10:07:25.504587Z",
    "updateTime": "2025-07-28T10:07:25.504587Z",
    "reviewReply": {
      "comment": "Dear Dejana,\nThank you so much for your lovely review! We’re so happy to hear you enjoyed your facial treatment with Tini and felt warmly welcomed by Weby at reception. Your kind words and recommendation truly mean a lot to us. We look forward to seeing you again at Cocoon Canggu!\n\nWarm regards,\nThe Cocoon Medical Spa Canggu Team",
      "updateTime": "2025-07-30T03:28:29.208405Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21jMlJqZG5XbEExTTNsR2VXTlBXa2N0TUhWdVNsRRAB"
  }, {
    "reviewer": {
      "displayName": "Tayane VNH"
    },
    "starRating": "FIVE",
    "comment": "Everything was smooth, the doctor listened to our concerns and gave us her honest and professional opinions.",
    "createTime": "2025-07-28T09:53:39.045785Z",
    "updateTime": "2025-07-28T09:53:39.045785Z",
    "reviewReply": {
      "comment": "Dear Tayane,\nThank you for your kind feedback! We’re glad to hear that your experience was smooth and that you felt heard and supported by our doctor. Providing honest, professional care is at the heart of what we do, and we truly appreciate your trust. We hope to see you again soon!\n\nWarm regards,\nThe Cocoon Medical Spa Canggu Team",
      "updateTime": "2025-07-30T03:22:16.117743Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21ReVZ6RnphR0YxYjFFMWVsSkNSaTFKWmpkWWVsRRAB"
  }, {
    "reviewer": {
      "displayName": "Martina Andreoni"
    },
    "starRating": "FIVE",
    "comment": "I had an amazing experience at Cacoon Medical Spa, in Canggu. I did the diamond microdermabrasion 24K gold anti-aging facial, and it was great. Both Ayu and Webi were amazing, and so kind. I totally recommend it!",
    "createTime": "2025-07-28T09:10:55.242798Z",
    "updateTime": "2025-07-28T09:10:55.242798Z",
    "reviewReply": {
      "comment": "Dear Martina,\nThank you so much for your wonderful review! We’re delighted to hear you had an amazing experience with the 24K Gold Anti-Aging Facial. Ayu and Webi will be so happy to know their care made your visit special. We truly appreciate your recommendation and hope to welcome you back to Cocoon Canggu soon!\n\nWarm regards,\nThe Cocoon Medical Spa Canggu Team",
      "updateTime": "2025-07-30T03:20:10.333525Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tOVFQyUlVRbEJZVTBkVmJEWlBiVVZoUVZWWFNWRRAB"
  }, {
    "reviewer": {
      "displayName": "Monique Teal"
    },
    "starRating": "FIVE",
    "comment": "Great reception staff and very comfortable experience for my colon hydrotherapy with staff Kathleen",
    "createTime": "2025-07-28T07:18:38.840824Z",
    "updateTime": "2025-07-28T07:18:38.840824Z",
    "reviewReply": {
      "comment": "Hi Monique,\nThank you so much for your kind words! We’re glad to hear you had a comfortable experience and felt well taken care of by our reception team and Nurse Kathleen. We’ll be sure to pass along your lovely feedback to them. Looking forward to welcoming you again soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-30T03:18:42.938155Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2w4M1ZsZ3lWR2g1ZVRKUmEyNVBUMGN5YTNSMlZrRRAB"
  }, {
    "reviewer": {
      "displayName": "AnnsoAvocado"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Amazing, professional and Nice doctor and Staff. I recommend +++\n\n(Original)\nAmazing, professionnal and Nice docteur and Staff. I recommend +++",
    "createTime": "2025-07-28T04:08:40.212130Z",
    "updateTime": "2025-07-28T04:08:40.212130Z",
    "reviewReply": {
      "comment": "Dear Annso,\nThank you so much for your kind review! We’re truly grateful for your recommendation and thrilled to hear that you had a great experience with our doctor and staff. Your support means a lot to us, and we look forward to seeing you again soon!\n\nWarm regards,\nCocoon Canggu Team\n",
      "updateTime": "2025-07-30T03:16:55.397543Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tkNVJHZ3pOVGhhWlZrNVFVeE9iVFpUZVdoVFNYYxAB"
  }, {
    "reviewer": {
      "displayName": "Heal with Emily"
    },
    "starRating": "FIVE",
    "comment": "Dr Eva, Toni and webi were amazing. Made me feel really comfortable and treatment was pretty painless",
    "createTime": "2025-07-28T02:16:47.911125Z",
    "updateTime": "2025-07-28T02:16:47.911125Z",
    "reviewReply": {
      "comment": "Hi Emily,\nThank you so much your review. \nWe are so thrilled to know that you enjoyed the treatment with us and feel comfortable. Dr. Eva, Tini and Webby will be very happy that you shout their name out.\nWe look forward to welcoming you for another treatment in the near future. \nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-29T07:57:07.959607Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xkVWVGaDFjREJXUzFSUk1DMVpiRXMzUmt0eFJtYxAB"
  }, {
    "reviewer": {
      "displayName": "Francesca van de Pavert"
    },
    "starRating": "FIVE",
    "comment": "Best spa of Canggu! Really enjoyed my treatment. True gem! Tini \u0026 Webi were amazing!",
    "createTime": "2025-07-26T09:52:30.601269Z",
    "updateTime": "2025-07-26T09:52:30.601269Z",
    "reviewReply": {
      "comment": "Hi Francesca, \nThank you for your kind words. We are so thrilled to know that you enjoyed the treatment with us. Tini and Webby will be very happy that you shout their name out. \nWe are looking forward to welcoming you soon. \nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-27T05:01:24.760927Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25ZM1dqTnRjVm81VkVwTlgyMTRXWFIyZEV0TU4wRRAB"
  }, {
    "reviewer": {
      "displayName": "Michelle Le"
    },
    "starRating": "FIVE",
    "comment": "I\u0027ve had 3 foot massages, 2 facials, 2 back massages already in Bali but my treatment by Tini was my absolute favorite! I was the most relaxed and so happy with my cocoon signature facial. As soon as you walk in the door you are greeted by warm and kind people like Webi and it makes the whole experience even better and very comfortable 😊",
    "createTime": "2025-07-24T07:30:29.140948Z",
    "updateTime": "2025-07-24T07:30:29.140948Z",
    "reviewReply": {
      "comment": "Thank you so much, Michelle! \nWe’re honored to hear that out of all your treatments in Bali, your Cocoon Signature Facial with Tini was your favorite. That means a lot! Tini and Webi will be so happy to know they helped make your visit extra special. We truly appreciate your kind words and hope to welcome you back for more relaxation soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-24T12:15:47.237681Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pKbVYwNVdlbTVoWkRCQ1oxWmhlRmRVYUZCbE5tYxAB"
  }, {
    "reviewer": {
      "displayName": "Yousra Benziane"
    },
    "starRating": "FIVE",
    "createTime": "2025-07-23T09:57:11.517030Z",
    "updateTime": "2025-07-23T09:57:11.517030Z",
    "reviewReply": {
      "comment": "Thank you Yousra for your 5 stars review! We look forward to welcoming you at Cocoon Canggu anytime soon.\n\nWarm regards,\n\nCocoon Canggu Team",
      "updateTime": "2025-07-24T12:13:08.276961Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tOeWNXaENOMTh4UkdWZlpYVmxMVVI2ZEdsZk5sRRAB"
  }, {
    "reviewer": {
      "displayName": "Aimee Nessling"
    },
    "starRating": "FIVE",
    "comment": "Truly 5-star service from start to finish!\nI visited Cocoon Medical Spa in Canggu for their detox package and had the most incredible experience. From the moment I walked in, the team made me feel comfortable, relaxed, and totally taken care of.\n\nThe package included a colon cleanse, a beautiful Balinese massage, and a session in the red light therapy bed (can’t remember the exact name, but it was amazing). As a lovely surprise, I was also given a complimentary collagen mask, which left my skin feeling so fresh and glowing!\n\nA special thank you to Tini and Nurse Dita – they were both so kind, professional, and attentive. Nurse Dita even offered me helpful aftercare advice and some great tips to support my diet and overall wellness in everyday life.\n\nI walked out feeling lighter, calmer, and absolutely pampered. Highly recommend Cocoon to anyone looking for a holistic, healing, and luxurious experience. I’ll definitely be back!",
    "createTime": "2025-07-23T09:13:56.328211Z",
    "updateTime": "2025-07-23T09:13:56.328211Z",
    "reviewReply": {
      "comment": "Hi Aimee,\nThank you so much for this beautiful review! We’re so happy to hear that you had such a positive and pampering experience with our detox package. It means a lot to know that you felt cared for from start to finish, that’s exactly what we aim for.\n\nTini and Nurse Dita will be thrilled to hear your kind words. We’re also glad the treatments (including the amethyst PEMF Biomat therapy and collagen mask!) left you feeling lighter, calmer, and glowing.\n\nWe can’t wait to welcome you back for more wellness and relaxation. Until then, take care and keep shining!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-24T12:11:56.913915Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25OZmFFdHZRbkZEUmtrM1IwNVNRMk56VlhOSlFYYxAB"
  }, {
    "reviewer": {
      "displayName": "Zeina Sleiman"
    },
    "starRating": "FIVE",
    "comment": "Amazing service, excellent team nurse Dita; Tini, Ayu, Webi and doctor Eva, and outstanding treatments, best medical spa!",
    "createTime": "2025-07-23T05:51:34.054865Z",
    "updateTime": "2025-07-23T05:51:34.054865Z",
    "reviewReply": {
      "comment": "Thank you Zeina so much for your kind words! We’re thrilled to hear you had such a great experience with Nurse Dita, Tini, Ayu, Webi, and Dr. Eva. The whole team truly appreciates your support, and we’re so glad you enjoyed the treatments. Looking forward to welcoming you back to Cocoon again soon!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-07-24T12:04:54.206929Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2prMmFGbFpWalpOYnpWVVdWOU1Rbk5YYmpoaWRYYxAB"
  }, {
    "reviewer": {
      "displayName": "Ali Mandalis"
    },
    "starRating": "FIVE",
    "comment": "I had a great experience at Cocoon. The space is thoughtfully designed and welcoming, with a wide range of treatments available. Tini and Weby were both professional and attentive, with a clear depth of knowledge that made me feel well looked after. The location is convenient if you’re staying around the Canggu area, and with several venues across Bali, it’s easy to find one nearby. Definitely a place I’d return to and recommend.",
    "createTime": "2025-07-22T06:52:17.321337Z",
    "updateTime": "2025-07-22T06:52:17.321337Z",
    "reviewReply": {
      "comment": "Hi Ali,\n\nThanks so much for your review.\nWe\u0027re glad to know that you enjoyed your time with us and felt well taken care of. \nTini and Weby will really appreciate the shoutout. Happy to hear that the space worked well with you too.\n\nLooking forward to welcoming you back anytime you\u0027re around.\n\nWarm regards, \nCocoon Canggu Team\n",
      "updateTime": "2025-07-23T01:48:14.114506Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25CdUxUUjRRMGxsV2xwVlRGOHRkMk5zWDFSQ2NHYxAB"
  }, {
    "reviewer": {
      "displayName": "Linda Meyer"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) A luxury time-out in everyday life. Had a purifying facial at Ayu and am very satisfied. 10 out of 10 service ⭐️\n\n(Original)\nEn luksus time-out i hverdagen. Hadde en purifying facial hos Ayu og er meget fornøyd. 10 av 10 service ⭐️",
    "createTime": "2025-07-22T03:28:01.158454Z",
    "updateTime": "2025-07-22T03:28:01.158454Z",
    "reviewReply": {
      "comment": "Hi Linda, Thank you for your lovely review! We\u0027re so happy to hear you enjoyed your purifying facial with Ayu — she’ll be thrilled to know you were so satisfied. A perfect 10 out of 10 means the world to us! ✨ Hope to welcome you back for another luxury time-out soon! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-22T04:48:22.044588Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2taWWRtRXljblJ5VlZKUE5XVnJiVmg2WkZCNGNYYxAB"
  }, {
    "reviewer": {
      "displayName": "Jenn L"
    },
    "starRating": "FOUR",
    "comment": "Tini was my therapist for hot stone massage and it was lovely! Reflexology was added on and I felt like a new person. (I did leave feedback that they should consider adding a curtain to block off noise from reception that can be heard in the private rooms/pods)",
    "createTime": "2025-07-21T23:10:47.721943Z",
    "updateTime": "2025-07-21T23:10:47.721943Z",
    "reviewReply": {
      "comment": "Hi Jenn, Thank you so much for your kind words! We\u0027re glad to hear you enjoyed your hot stone massage and reflexology with Tini — she’ll be so happy to know you felt refreshed and renewed after your session. We also truly appreciate your feedback about the noise from reception. It’s valuable input that helps us improve the overall experience. \nLooking forward to welcoming you back soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-22T04:49:49.411652Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25kdFNIVlhjbGRyTlZwbmJtcDJkM0ZIUWtnMWEzYxAB"
  }, {
    "reviewer": {
      "displayName": "Lucia Misuraca"
    },
    "starRating": "FIVE",
    "comment": "Lovely place and very professional people!\nDr.Eva, Tini and Weby they treated me like a queen:)",
    "createTime": "2025-07-21T08:33:02.272704Z",
    "updateTime": "2025-07-21T08:34:50.856281Z",
    "reviewReply": {
      "comment": "Thank you so much, Lucia! 👑 We\u0027re delighted to hear you had such a lovely experience and felt truly cared for by Dr. Eva, Tini, and Weby. They’ll be thrilled to know they made you feel like royalty! We can’t wait to welcome you back again soon\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-22T05:35:28.397951Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pSc05rcFZPRzlhYm5wTmQycHRVVWhqU1dKaGVsRRAB"
  }, {
    "reviewer": {
      "displayName": "Kellie Murton"
    },
    "starRating": "FIVE",
    "comment": "A beautiful and relaxing environment. The staff were all absolutely lovely and helpful throughout the booking process and during my appointment. Special mentions to Dr Eva, Weby, Tini and Miranda. Thanks.",
    "createTime": "2025-07-21T08:09:19.692438Z",
    "updateTime": "2025-07-21T08:09:19.692438Z",
    "reviewReply": {
      "comment": "Hi Kellie, Thank you for your kind words! We\u0027re so happy you enjoyed the beautiful and relaxing atmosphere, and that our team made your experience smooth and pleasant from start to finish. Dr. Eva, Weby, Tini, and Miranda will be so glad to hear your appreciation. We hope to see you again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-22T05:37:07.691375Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2s1dllqTjRaRTFuTlZadmNFUnZhbUZLV2kweFJWRRAB"
  }, {
    "reviewer": {
      "displayName": "Emma Tickelpenny"
    },
    "starRating": "FIVE",
    "comment": "Amazing! Dr Eva, Ayu and Weby were so helpful. I will be back!",
    "createTime": "2025-07-21T06:21:43.515385Z",
    "updateTime": "2025-07-21T06:21:43.515385Z",
    "reviewReply": {
      "comment": "Hi Emma, Thank you so much! We\u0027re thrilled to hear you had an amazing experience with Dr. Eva, Ayu, and Weby they’ll be so happy to hear your kind words. We can’t wait to welcome you back soon\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-23T01:41:41.386114Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xwU1JGUllkMGRqZGpoTlUwOUVPVGx4VFcxM05rRRAB"
  }, {
    "reviewer": {
      "displayName": "Jess Louise Potter"
    },
    "starRating": "FIVE",
    "comment": "Amazing process from start to finish a was helped by Webi at reception. Got helped by Dr Eva and was the perfect amount of guidance without pushing to get more. Gave amazing advice to provide a natural looking injectable treatment ☺️ nurse Ayu was great with the ice pack and tapping, meant for a pain free and quick process ☺️",
    "createTime": "2025-07-21T06:21:22.811569Z",
    "updateTime": "2025-07-21T06:21:22.811569Z",
    "reviewReply": {
      "comment": "Hi Jess Louise, Thank you for your amazing feedback! We\u0027re so glad to hear you had a smooth and comfortable experience from start to finish. Webi, Dr. Eva, and Nurse Ayu will be so happy to know they made you feel well taken care of. It\u0027s wonderful to hear you appreciated the natural approach and gentle touch — that’s exactly what we aim for. Looking forward to seeing you again soon\n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-22T05:34:47.574982Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25wUFdWTlJPRTkyT0ZremEwVkJRMHR3VG5SSlRGRRAB"
  }, {
    "reviewer": {
      "displayName": "Bonjuk Bay"
    },
    "starRating": "FIVE",
    "createTime": "2025-07-21T05:10:58.799416Z",
    "updateTime": "2025-07-21T05:10:58.799416Z",
    "reviewReply": {
      "comment": "Hi Bonjuk, Thank you so much for the 5-star review! ⭐️ We\u0027re thrilled you had a great experience and truly appreciate your support. Looking forward to welcoming you back soon! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-07-22T05:37:24.583800Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25WNGFVRXlUMVZyWjNwck1UTlRjV1V4T1c5eVJWRRAB"
  }]
}