{
  "reviews": [{
    "reviewer": {
      "displayName": "Victoria Colombato"
    },
    "starRating": "FIVE",
    "comment": "I absolutely love cocoon medical spa. I’ve been here many times for several treatments and every time I felt at home all the way from welcome smile and drinks, to the professionalism, quality of machines and the results that I’m very happy with.\nThe whole team is so kind and welcoming! Thank you all 🤍",
    "createTime": "2025-10-06T10:48:14.009786Z",
    "updateTime": "2025-10-06T10:48:14.009786Z",
    "reviewReply": {
      "comment": "Dear Victoria,\n\nYour message truly made us smile. It means so much to know you feel at home every time you visit, that’s exactly what we hope for each guest. We’re grateful for your trust and so happy that you’ve enjoyed both the care from our team and the results of your treatments. Thank you for your lovely words and for always coming back to see us.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-22T05:05:04.404399Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2twSGNsRnBhamRWV1dWT1dXOTZSRkZ1U2pWalVuYxAB"
  }, {
    "reviewer": {
      "displayName": "Stéphie Fumaki"
    },
    "starRating": "FIVE",
    "comment": "Kathleen webi and santi very good I really appreciate take care of me",
    "createTime": "2025-10-06T05:35:26.113020Z",
    "updateTime": "2025-10-06T05:35:26.113020Z",
    "reviewReply": {
      "comment": "Thank you so much, Stéphie! \nWe’re happy to hear that Kathleen, Weby, and Santi took great care of you. We truly appreciate your visit and hope to welcome you back soon. \n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:37:51.920255Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pKd2JIZGxjMU5GTkdkMFZYUjRUVTEwV1hGWVRrRRAB"
  }, {
    "reviewer": {
      "displayName": "Hazel Butters"
    },
    "starRating": "FIVE",
    "comment": "Beautiful experience.  Was met by website and Santi and treatment done by ayu. Beautiful team . Highly recommend",
    "createTime": "2025-10-06T03:38:40.681806Z",
    "updateTime": "2025-10-06T03:38:40.681806Z",
    "reviewReply": {
      "comment": "Thank you so much, Hazel! \nWe’re so glad you had a beautiful experience and felt warmly welcomed by Weby and Santi. Ayu will be happy to know you enjoyed your treatment. We truly appreciate your recommendation and hope to see you again soon. \n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:36:40.615033Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25WYWVIcElVbXRIVWtSRVdISkNWelJrTkhCRFJsRRAB"
  }, {
    "reviewer": {
      "displayName": "Anastacia Bijou"
    },
    "starRating": "FIVE",
    "comment": "Had the most amazing session with Kathleen. The rest of the staff were by and santi are so lovely.",
    "createTime": "2025-10-06T03:01:19.584064Z",
    "updateTime": "2025-10-06T03:01:19.584064Z",
    "reviewReply": {
      "comment": "Thank you so much, Anastacia! \nWe’re happy to hear you had an amazing session with Kathleen and felt well cared for by Santi and the rest of our team. We truly appreciate your visit and hope to see you again soon. \n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:34:04.713501Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tKVE0wRjROMWh0WVV0U04wNXdaVTFGVlZoSWFHYxAB"
  }, {
    "reviewer": {
      "displayName": "Valentina Grande"
    },
    "starRating": "FIVE",
    "comment": "Loved my facial! Tini and Dr Ivan suggested the best facial for my hyper sensitive skin and I’m super happy with the result! Thanks Ria and staff! ♥️",
    "createTime": "2025-10-03T09:01:05.329526Z",
    "updateTime": "2025-10-03T09:01:05.329526Z",
    "reviewReply": {
      "comment": "Thank you so much, Valentina! \n\nWe’re delighted to hear you loved your facial and that Dr. Ivan, Tini, and Ria provided the right care for your sensitive skin. Your happiness means a lot to us, and we hope to see you again soon. \n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:28:40.308208Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tkbGNsWkhUVmxJU1hwdlVtaEVUWGx0V2trMWExRRAB"
  }, {
    "reviewer": {
      "displayName": "simpleindonesianwith yohanes"
    },
    "starRating": "FIVE",
    "comment": "This was my first time getting a facial treatment, and honestly, I had no idea what to expect. But during the treatment with Tini, it felt amazing. I even fell asleep! The results were outstanding, my face looks noticeably brighter and smoother.\n\nIt wasn’t just the therapist who made the experience great. I was warmly welcomed by Weby, and Surya served the warmest and most comforting ginger tea ever.\n\nOverall, this is a fantastic place to get a treatment. Shoutout to Santi, the manager, for running the place so well!",
    "createTime": "2025-10-02T08:51:32.938506Z",
    "updateTime": "2025-10-02T08:51:32.938506Z",
    "reviewReply": {
      "comment": "Dear Yohannes,\n\nThank you so much for sharing your wonderful first facial experience! We’re thrilled to hear that Tini helped you feel relaxed and that you loved the results. It’s also lovely to know that Weby, Surya, and Santi made your visit extra special. We truly appreciate your kind words and can’t wait to welcome you back for your next treatment. \n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:26:14.730854Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21sNVRGOWhWbWhqYld4TmVGRk9hVkJxVlhRd1MyYxAB"
  }, {
    "reviewer": {
      "displayName": "Stanislava Stiborová Mrázková"
    },
    "starRating": "FIVE",
    "comment": "Very professional approach, everything explained, clean, professional.\nBig thanks to kind and helpful staff Dr. Brill, nurse Kathleen and Webi at the reception.",
    "createTime": "2025-09-30T07:36:11.588635Z",
    "updateTime": "2025-09-30T07:36:11.588635Z",
    "reviewReply": {
      "comment": "Thank you so much, Stanislava! \n\nWe’re happy to know you had a great experience and appreciated the professionalism and care from Dr. Brill, Kathleen, and Weby. We truly value your kind words and hope to welcome you back again soon. \n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:23:19.306694Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pKc1IyeGtNbXBTWTBkNFgwNVhlRzB3ZDFKdVgyYxAB"
  }, {
    "reviewer": {
      "displayName": "Alisa Tierhold"
    },
    "starRating": "FIVE",
    "comment": "I had the colon hydro therapy- my experience was very pleasant, Kathleen \u0026 Weby did an amazing job, very kind, felt safe and relaxed.",
    "createTime": "2025-09-26T09:57:49.657091Z",
    "updateTime": "2025-09-26T09:57:49.657091Z",
    "reviewReply": {
      "comment": "Hi Alisa,\nThank you so much for sharing your experience! We’re glad to hear you felt safe, relaxed, and well cared for during your colon hydrotherapy with nurse Kathleen and Weby at the front desk. Your comfort means a lot to us, and we look forward to seeing you again soon\n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:11:49.421044Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xaMlVrVnhNa0phTTB0NWJqUTNjaTFzT0cwM2VYYxAB"
  }, {
    "reviewer": {
      "displayName": "Sunniva Kamp"
    },
    "starRating": "FIVE",
    "comment": "Really nice medical spa in Canggu! Friendly welcome with ginger water by the ladies in reception Weby \u0026 Sant, and very professional consultation by Dr. Eya and got good recommendations for my skin condition and what treatments to do and why. Very comfortable rooms with good mattresses and cozy with blankets ☺️  Got a facial cleans by Tini, and she was really calming and meticulous 🙌  Will definitely come back!",
    "createTime": "2025-09-25T09:18:46.013379Z",
    "updateTime": "2025-09-25T09:18:46.013379Z",
    "reviewReply": {
      "comment": "Thank you so much, Sunniva! We’re happy to hear you enjoyed your visit and felt well taken care of by Dr. Eya, Tini, Weby, and Santi. It’s great to know the consultation and treatment made you feel comfortable and relaxed. We look forward to welcoming you back soon for your next visit! \n\nBest regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:08:46.741079Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tKU2VEbGFSbXhrYjJsSFEyeHJNa1ZPTkdGS1UzYxAB"
  }, {
    "reviewer": {
      "displayName": "Ulises I. Orozco"
    },
    "starRating": "FIVE",
    "comment": "Very impressed with the level of service and professionalism at Cocoon. I came in for a stem cell IV treatment and massage and the whole team was absolutely fantastic. Dr. Eva was very knowledgeable and attentive. Kathleen, Ayu, Tini, Weby and Santi were all so kind and generous with their time to ensure that I was comfortable and happy with my experience. I highly recommended that you check them out if you’re looking for any IV or Spa services in Bali!",
    "createTime": "2025-09-25T03:57:48.292968Z",
    "updateTime": "2025-09-25T03:57:48.292968Z",
    "reviewReply": {
      "comment": "Dear Uly,\n\nThank you for your thoughtful review. We’re delighted to hear that both your stem cell IV treatment and massage left such a positive impression. Dr. Eva, Kathleen, Ayu, Tini, Weby, and Santi will be so pleased to know their care and attention made you feel comfortable and well looked after. Your kind words and recommendation mean a lot to us, and we’d love to welcome you back whenever you’re in Bali.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-25T06:27:41.243250Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT20xbGRYWXdZVk5RZGw5WFdIaDJNekZOUzJWak9YYxAB"
  }, {
    "reviewer": {
      "displayName": "Daniella Princi"
    },
    "starRating": "FIVE",
    "comment": "I had the best experience today! The caring, nurturing, professional manner of the staff, each going above and beyond!\nI had a colonic with nurse Kathleen \u0026 while nervous at first, she quickly put me at ease and the process was interesting, even with a few laughs :-)\nMy massage with Ayu was magical- I couldn’t even roll over when she asked me to, as I was so relaxed…\nAnd behind the scenes, helping to sort appointments and run the package smoothly, were Weby \u0026 Santi. I made a mistake with my appointment and again, they very eagerly and kindly helped me to rectify it!\nI am going back in 2 days and have already recommended the service to friends 🙏🏼\n\nThank you amazing ladies 🙏🏼💚",
    "createTime": "2025-09-24T10:31:33.505904Z",
    "updateTime": "2025-09-24T10:31:33.505904Z",
    "reviewReply": {
      "comment": "Dear Daniella,\n\nThank you for such a heartfelt review. We’re so happy to hear that Kathleen’s gentle care helped ease your nerves during the colonic, and that Ayu’s massage left you completely relaxed. Weby and Santi will be touched to know how much you appreciated their patience and support in arranging your appointments.\n\nIt means a lot that you’ve already shared your experience with friends, and we’re excited to welcome you back in just a couple of days. Guests like you make what we do so rewarding.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-25T06:17:46.702281Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25CMmRIa3hUVXRUV25CWGVGSnBjRXhyWlRabmVFRRAB"
  }, {
    "reviewer": {
      "displayName": "Alia Kirschbaum"
    },
    "starRating": "FIVE",
    "comment": "I love this mediacal spa! Everyone is very friendly and the results of Dr. Evas treatments are amazing. I rather go there instead of a medical spa in Germany. Also Weby and Santi are soo nice, I directly felt welcomed :)",
    "createTime": "2025-05-15T05:40:03.145056Z",
    "updateTime": "2025-09-24T07:24:41.030648Z",
    "reviewReply": {
      "comment": "Hi Alia, Thank you so much for your kind words! We\u0027re thrilled to hear you\u0027re happy with your Botox results from Dr. Eva, and that communication with Miranda made everything smooth and easy. We look forward to welcoming you back next time you\u0027re in Canggu! -Cocoon Team",
      "updateTime": "2025-05-27T02:51:52.092603Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VPVGN5TjZIei1YZWdRRRAB"
  }, {
    "reviewer": {
      "displayName": "Maria Carlota Del Real"
    },
    "starRating": "FIVE",
    "comment": "⭐️⭐️⭐️⭐️⭐️\nI’ve been a Cocoon Medical Spa customer for years, but this was my first time at their new Canggu branch — and wow, what an experience! I had the Kundalini Massage (the perfect revival after a red-eye flight), followed by my usual Beauty Booster IV drip while being pampered with a gold facial mask and the most heavenly foot massage ever.\n\nHuge thanks to the incredible team — Tini, Kathleen, Weby, and especially Santi (who even spoke to me in Spanish, my mother tongue!) — for making me feel so welcomed and cared for. These girls are the heart and soul of Cocoon Canggu, and they made my day unforgettable.\n\nIf you’re in Bali, don’t miss this sanctuary of relaxation and wellness — you’ll leave glowing, energized, and already planning your next visit! ✨",
    "createTime": "2025-09-19T14:01:23.523959Z",
    "updateTime": "2025-09-24T05:18:23.512483Z",
    "reviewReply": {
      "comment": "Hola Carlota,\n\nReading your words truly made our day. We’re so happy your first visit to Cocoon Canggu felt like such a memorable experience. The combination you chose; Kundalini Massage, Beauty Booster IV, gold mask, and foot massage, sounds like the perfect way to recover after your flight and leave fully renewed.\n\nAyu, Kathleen, Weby, and Santi will be overjoyed to hear how much their care meant to you. And Santi will be especially touched to have shared a moment with you in Spanish, it’s little connections like this that make everything more personal.\n\nThank you for trusting us over the years and for bringing your kind energy to our new branch. We look forward to welcoming you back whenever you’re in Bali.\nMil gracias a ti y a Bea, un beso grande\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-10-06T06:04:21.421198Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21WNlVGY3lkbTFMYkVsTFZHaGlRV1ptWDJsblpsRRAB"
  }, {
    "reviewer": {
      "displayName": "Lucia Ištoňová"
    },
    "starRating": "FIVE",
    "comment": "I had a great experience with my first Botox and microneedling treatment. Dr. Eva took the time to explain everything thoroughly, which made me feel completely comfortable. I’ll definitely be coming back and highly recommend her!",
    "createTime": "2025-09-23T07:35:08.571584Z",
    "updateTime": "2025-09-23T07:35:08.571584Z",
    "reviewReply": {
      "comment": "Dear Lucia,\n\nThank you for trusting us with your first Botox and microneedling treatment. We’re so pleased to hear that Dr. Eva’s clear explanations helped you feel comfortable and confident throughout the process. Your recommendation means a lot, and we look forward to welcoming you back for your next visit.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-25T06:14:43.582684Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25kMGRsbDVia3BZWmpsaFFrWktTR0l0WW1WNWRWRRAB"
  }, {
    "reviewer": {
      "displayName": "Judge Potter"
    },
    "starRating": "FIVE",
    "comment": "Absolutely amazing experience here and super relaxing massage. Just what I needed after my body taking a beating all year sitting a desk. Ayu, Weby, and Ria took great care of me. Provided me with water and a snack as soon as I walked in and fresh tea with honey after my massage. Phenomenal experience. I highly recommend",
    "createTime": "2025-09-20T09:42:36.979603Z",
    "updateTime": "2025-09-20T09:47:57.089344Z",
    "reviewReply": {
      "comment": "Dear Judge,\n\nThank you for sharing your experience with us. We’re so glad the massage gave your body the relief it needed and that Ayu, Weby, and Ria could make you feel well cared for throughout your visit. From the welcome to the tea after your treatment, it’s wonderful to know the little touches made a difference for you. We truly appreciate your recommendation and hope to see you again soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-23T07:42:53.901857Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25WUFpGQnBkak5XVlRSUk5EVkVRM2MyYlROSWVWRRAB"
  }, {
    "reviewer": {
      "displayName": "Beatriz Mayz"
    },
    "starRating": "FIVE",
    "comment": "Ayu gave me the most therapeutic and relaxing Kundalini back massage, which was exactly what I needed after my flight from Australia. All the staff were knowledgeable, friendly, and very accommodating. Santi and Weby patiently answered all my questions, and nurse Kathleen administered my IV drip with clear explanations and it was smooth and painless. The place itself is clean, beautifully designed, and creates a calming atmosphere. Highly recommended!",
    "createTime": "2025-09-19T09:27:47.482437Z",
    "updateTime": "2025-09-19T09:29:11.601599Z",
    "reviewReply": {
      "comment": "Dear Beatriz,\n\nThank you for taking the time to share such a detailed and kind review. We’re delighted to hear that Ayu’s Kundalini massage gave you the relief you needed after your flight, and that Santi and Weby could make you feel comfortable by answering all your questions. Kathleen will also be so pleased to know her gentle care made your IV drip experience smooth and reassuring.\n\nIt’s wonderful that you enjoyed not only the treatments but also the calming atmosphere of our space. We truly appreciate your recommendation and look forward to welcoming you back on your next visit to Bali.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-23T07:40:58.009273Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2t0TFZ6bGtRVlYzWWpkYVFUVmljRkZvZVc5R1NsRRAB"
  }, {
    "reviewer": {
      "displayName": "Sofiya Schön"
    },
    "starRating": "FIVE",
    "comment": "My experience here was really good! I had a colon hydrotherapy and everything went well. Kathleen explained to me the whole procedure and was really kind. All of the other girls were really kind too. Recommend!",
    "createTime": "2025-09-19T08:15:48.853882Z",
    "updateTime": "2025-09-19T08:15:48.853882Z",
    "reviewReply": {
      "comment": "Dear Sofiya,\nThank you for sharing your experience with us. We’re glad to hear that your colon hydrotherapy went smoothly and that Kathleen’s care and guidance made you feel comfortable throughout the process. The rest of the team will also be happy to know their kindness left a positive impression on you. We truly appreciate your recommendation and look forward to welcoming you again.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-23T07:39:08.033031Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xnMWFVdENSV1U0ZUV4Q04xZDNSbDlwZFVobE0wRRAB"
  }, {
    "reviewer": {
      "displayName": "Maelle Cherpillod"
    },
    "starRating": "FIVE",
    "comment": "Such a great experience! The facial was relaxing and effective, my skin feels amazing afterwards. Very professional and friendly, highly recommend! Thank you to Dr Eva, Ayu, Weby and Ria for the amazing service.",
    "createTime": "2025-09-18T04:13:22.818393Z",
    "updateTime": "2025-09-18T04:13:22.818393Z",
    "reviewReply": {
      "comment": "Thank you, Maelle, for your lovely feedback. We’re so happy to hear you enjoyed your facial and felt well cared for by Dr. Eva, Ayu, Weby, and Ria. Great to know your skin is feeling amazing afterwards!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T08:13:10.316737Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21aRWR6ZzVZVkp2UnpaNFFtaHBNMVV4TXpGdFZuYxAB"
  }, {
    "reviewer": {
      "displayName": "Dana Michell"
    },
    "starRating": "FIVE",
    "comment": "I has an amazing colon hydrotherapy session at Cocoon Canggu todat and the girls who work there were all so welcoming and knowledgeable. Weby, Santi and Kathleen. Thank you for making my first time so calm and enjoyable 😉 also the spa is very clean, calming and luxurious. I will be back.",
    "createTime": "2025-09-17T06:07:31.152529Z",
    "updateTime": "2025-09-17T06:07:31.152529Z",
    "reviewReply": {
      "comment": "Thank you, Dana, for sharing your first experience with us. We’re so glad Weby, Santi, and Kathleen made you feel comfortable and cared for. Happy to know you enjoyed the spa environment too — we’ll be looking forward to your next visit.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T08:02:12.465935Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pkS1RrYzRhMFo0ZW5WRFkxRklTVVF5VWxkNWVHYxAB"
  }, {
    "reviewer": {
      "displayName": "Kilyan"
    },
    "starRating": "FIVE",
    "comment": "Very nice place with great treatments and kind people ☺️",
    "createTime": "2025-09-17T03:19:55.098629Z",
    "updateTime": "2025-09-17T03:36:26.737494Z",
    "reviewReply": {
      "comment": "Thank you, Kilyan! We’re glad you enjoyed the treatments and felt welcomed by the team. Hope to see you again soon.\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-09-18T07:59:48.926054Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2pjeFdYa3hUSFUzTkd0NVgwdEtiMFpNZEV0WlVVRRAB"
  }]
}