{
  "reviews": [{
    "reviewer": {
      "displayName": "Malin Johanne Nybakke Bjørke"
    },
    "starRating": "FIVE",
    "comment": "Amazing customer service!\nThank you to Miranda for the quick respons.\nThe appointment was very professional and fast.\n\nI can definitely recommend this place.",
    "createTime": "2025-04-20T03:55:38.466254Z",
    "updateTime": "2025-04-20T03:55:38.466254Z",
    "reviewReply": {
      "comment": "Hi Malin, Thank you so much for your kind words! We\u0027re thrilled to hear you had a great experience with us. Miranda will be so happy to know her quick response and professionalism made a positive impact. We truly appreciate your recommendation and look forward to seeing you again here in Cocoon!\n\n-Cocoon Team",
      "updateTime": "2025-04-26T01:58:34.985888Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNvbTRxeURBEAE"
  }, {
    "reviewer": {
      "displayName": "arabella ovenden"
    },
    "starRating": "FIVE",
    "comment": "I had the fat loss treatment it was so good I highly recommend, the spa was very clean and the staff were very lovely",
    "createTime": "2025-04-18T04:02:31.852349Z",
    "updateTime": "2025-04-18T04:02:31.852349Z",
    "reviewReply": {
      "comment": "Hi Arabella, Thank you for your wonderful review! We\u0027re so glad you enjoyed the fat loss treatment and felt comfortable in our clean and welcoming space. Our team truly appreciates your kind words and we are looking forward to see you again soon!\n-Cocoon Team",
      "updateTime": "2025-04-26T02:06:16.597244Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNveWZfV3RBRRAB"
  }, {
    "reviewer": {
      "displayName": "Kim Murray"
    },
    "starRating": "FIVE",
    "comment": "I had a fantastic experience here! I had the colonoscopy hydrotherapy with Nurse Wida. Made me feel so much relaxed. I can’t wait to come back",
    "createTime": "2025-04-17T09:08:19.567733Z",
    "updateTime": "2025-04-17T09:08:47.112067Z",
    "reviewReply": {
      "comment": "Hi Kim, Thank you so much for sharing your fantastic experience! We\u0027re so happy to hear that Nurse Wida helped you feel relaxed during your colon hydrotherapy session. We look forward to welcoming you back soon! -Cocoon Team",
      "updateTime": "2025-04-26T02:48:40.104853Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNvdnBqZjJRRRAB"
  }, {
    "reviewer": {
      "displayName": "Chandre\u0027 Millar"
    },
    "starRating": "FIVE",
    "comment": "The ladies at Cocoon Medical Spa Canggu are the best, from the moment I walked in the door I was offered a glass of water something to eat and then escorted to the room for IPL Laser and Colonic. The ladies are very welcoming, super gentle and very comforting would absolutely recommend!",
    "createTime": "2025-04-17T05:46:34.247980Z",
    "updateTime": "2025-04-17T05:46:34.247980Z",
    "reviewReply": {
      "comment": "Hi Chandre, Thank you so much for your kind words! We\u0027re delighted to hear that you felt so welcomed and cared for from the moment you arrived. Our team at Cocoon Medical Spa takes pride in creating a gentle, comforting experience, and we\u0027re so glad that came through. We truly appreciate your recommendation and hope to see you again soon! -Cocoon Team",
      "updateTime": "2025-04-26T02:54:59.382293Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNvN3VXUWRREAE"
  }, {
    "reviewer": {
      "displayName": "Karen Frederica"
    },
    "starRating": "FIVE",
    "comment": "Great treatment",
    "createTime": "2025-04-16T04:02:54.039824Z",
    "updateTime": "2025-04-16T04:02:54.039824Z",
    "reviewReply": {
      "comment": "Hi karen, Thank you for your feedback. We\u0027re pleased to hear you had a positive experience with your treatment and look forward to welcoming you again here in Cocoon. -Cocoon Team",
      "updateTime": "2025-04-26T02:56:32.659830Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNvOHM3ZXNRRRAB"
  }, {
    "reviewer": {
      "displayName": "Jemma McMahon"
    },
    "starRating": "FIVE",
    "comment": "Great service!",
    "createTime": "2025-04-16T03:52:19.366453Z",
    "updateTime": "2025-04-16T03:52:19.366453Z",
    "reviewReply": {
      "comment": "Hi Jemma, Thank you for your feedback. We are pleased to know that you were satisfied with the level of service provided. We are looking forward to see you again in Cocoon!. - Cocoon Team",
      "updateTime": "2025-04-26T02:59:35.870349Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNvOHBxOG13RRAB"
  }, {
    "reviewer": {
      "displayName": "Verica Kitanova"
    },
    "starRating": "FIVE",
    "comment": "I recently tried an anticellulite massage and was genuinely impressed with the results. The treatment not only helped improve the texture and appearance of my skin, but it also left me feeling more relaxed and energized. After just a few sessions, I noticed a visible reduction in cellulite and improved circulation in the targeted areas.\n\nA huge part of the positive experience was thanks to Tini, the therapist. She is incredibly skilled, attentive, and knowledgeable. Tini took the time to understand my concerns and tailored the massage to suit my needs. Her technique was firm yet comfortable, and she explained each step of the process, which made me feel completely at ease.\n\nIf you\u0027re considering trying anticellulite massage, I highly recommend booking a session with Tini. She truly makes a difference!",
    "createTime": "2025-04-15T16:41:23.365254Z",
    "updateTime": "2025-04-15T16:41:23.365254Z",
    "reviewReply": {
      "comment": "Thank you so much for your detailed and glowing review, Verica! We\u0027re thrilled to hear about the positive results you experienced from the anticellulite massage. Tini will be delighted to know that her skill, care, and personalized approach made such a difference for you. We truly appreciate your recommendation and look forward to welcoming you back soon! -Cocoon Team",
      "updateTime": "2025-04-26T03:00:12.014584Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNvd3R5Rjh3RRAB"
  }, {
    "reviewer": {
      "displayName": "sharan dhami"
    },
    "starRating": "FIVE",
    "comment": "I had a wonderful time at Cocoon Medical Spa in Canggu. I had a few treatments, and they were all great! The receptionist was lovely, as we\u0027re Dr Eva and the rest of the staff.\nI would highly recommend it there, it was professional, clean and a very pleasant experience! Especially the Hydra Facial. 10/10!",
    "createTime": "2025-04-15T06:32:19.058081Z",
    "updateTime": "2025-04-15T06:32:19.058081Z",
    "reviewReply": {
      "comment": "Hi Sharan, Thank you so much for your kind words and glowing feedback! We\u0027re delighted to hear that you had such a wonderful experience at Cocoon Medical Spa in Canggu. It\u0027s great to know that our team, including Dr. Eva and our lovely receptionist, helped make your visit so enjoyable. We\u0027re especially glad you loved the HydraFacial! We truly appreciate your recommendation and hope to welcome you back again soon! -Cocoon Team",
      "updateTime": "2025-04-26T03:02:25.647292Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNveE5yb1hnEAE"
  }, {
    "reviewer": {
      "displayName": "Sheree Z"
    },
    "starRating": "FIVE",
    "comment": "Fabulous! Extremely gentle, thorough \u0026 precise! Dr Eva \u0026 team are wonderful!",
    "createTime": "2025-04-15T05:56:47.948950Z",
    "updateTime": "2025-04-15T05:56:47.948950Z",
    "reviewReply": {
      "comment": "Hi Sheree, Thank you for your fabulous feedback! We\u0027re so pleased to hear that you found Dr. Eva and the team gentle, thorough, and precise. Your kind words mean a lot to us, and we look forward to welcoming you again soon! -Cocoon Team",
      "updateTime": "2025-04-26T03:02:47.643724Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNvaE5fYU5nEAE"
  }, {
    "reviewer": {
      "displayName": "Billie Lim"
    },
    "starRating": "FIVE",
    "comment": "I came into the clinic with red, sensitive and dry skin from the sun/sea/pollution in Bali. My therapist Tini was very professional and I came out  of the treatment with rejuvenated, hydrated and a much calmer skin!",
    "createTime": "2025-04-12T11:08:27.448974Z",
    "updateTime": "2025-04-12T11:08:27.448974Z",
    "reviewReply": {
      "comment": "Thank you for sharing your experience! We\u0027re so glad Tini was able to provide the care and professionalism you needed—your skin deserves that post-Bali refresh! It’s wonderful to hear you left feeling rejuvenated and hydrated. We hope to welcome you back soon for more pampering!",
      "updateTime": "2025-04-15T04:14:35.576874Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTURJdllxT2R3EAE"
  }, {
    "reviewer": {
      "displayName": "Kailee Keiser"
    },
    "starRating": "FIVE",
    "comment": "I got the Cocoon signature hydra facial with Tini. Tini was excellent and made sure that I was comfortable the whole time. My skin looks and feels so much better. Also, the front desk staff including Sri were sooo kind and welcoming.",
    "createTime": "2025-04-08T05:58:58.600393Z",
    "updateTime": "2025-04-08T05:58:58.600393Z",
    "reviewReply": {
      "comment": "Thank you so much for your lovely review! We’re so happy to hear that you had a fantastic experience with the Cocoon Signature HydraFacial and that Tini made sure you were comfortable throughout the treatment. It’s wonderful to know that your skin is feeling and looking much better. We also truly appreciate your kind words about our front desk team, including Sri. We can’t wait to welcome you back for more amazing treatments!",
      "updateTime": "2025-04-08T09:55:01.674362Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTURJdlBIQ09BEAE"
  }, {
    "reviewer": {
      "displayName": "Charika Muthumala"
    },
    "starRating": "FIVE",
    "comment": "I had such an incredible therapist- her name was Tini, and she has amazing hands! Literally one of the best massages I’ve had!",
    "createTime": "2025-04-08T04:03:56.258301Z",
    "updateTime": "2025-04-08T04:03:56.258301Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We’re thrilled to hear that Tini provided you with such an incredible massage. It’s always great to know when our therapists make such a positive impact. We can’t wait to welcome you back for another amazing experience",
      "updateTime": "2025-04-08T09:55:31.502876Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURJM0tTLXNRRRAB"
  }, {
    "reviewer": {
      "displayName": "Jennifer Schraube"
    },
    "starRating": "FIVE",
    "comment": "One of my favorite facials in Bali. High standards and great service. Everything is very clean and the studios is very beautiful. My skin is glowing. Thanks to Tini. Highly recommend her.",
    "createTime": "2025-04-07T06:22:29.275076Z",
    "updateTime": "2025-04-07T06:22:29.275076Z",
    "reviewReply": {
      "comment": "Thank you so much for your lovely review! We’re so happy to hear that you had one of your favorite facials in Bali and that you enjoyed the high standards, beautiful studio, and clean environment. It’s wonderful to know that your skin is glowing, and we’re thrilled that Tini made such an impact on your experience. We truly appreciate your recommendation and can’t wait to welcome you back for more amazing treatments! ",
      "updateTime": "2025-04-08T09:57:46.584645Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURJeEtYQzhnRRAB"
  }, {
    "reviewer": {
      "displayName": "Béatrice Hamel"
    },
    "starRating": "FIVE",
    "comment": "Cocoon Medical Spa in Canggu is an absolute gem. The staff are super professional, the treatments feel luxurious yet affordable, and the space is insanely relaxing. I left glowing—literally. If you’re in Bali and want to treat yourself, this place is a must. Five stars, no question.",
    "createTime": "2025-04-07T03:57:23.390743Z",
    "updateTime": "2025-04-07T03:57:23.390743Z",
    "reviewReply": {
      "comment": "Thank you so much for your glowing review! We’re thrilled to hear that you had such a luxurious and relaxing experience at Cocoon Medical Spa in Canggu. It’s wonderful to know that our professional staff and affordable treatments made such a positive impact on your visit. We’re so happy you left glowing and can’t wait to welcome you back for more amazing experiences!",
      "updateTime": "2025-04-08T09:58:12.588439Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTURJaE9IWkNnEAE"
  }, {
    "reviewer": {
      "displayName": "Tara Huseman"
    },
    "starRating": "FIVE",
    "comment": "I bet the best experience at this spa! They do a foot massage and collagen face mask with every IV and it just makes you so relaxed. Thank you Dita and Tini! I will be back",
    "createTime": "2025-04-05T04:15:47.072817Z",
    "updateTime": "2025-04-05T04:15:47.072817Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We’re so happy to hear that you had the best experience at our spa and enjoyed the relaxing foot massage and collagen face mask with your IV treatment. Dita and Tini will be thrilled to hear your kind words. We can’t wait to welcome you back for more rejuvenating experiences!",
      "updateTime": "2025-04-08T09:59:06.935354Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNJeC03RlpBEAE"
  }, {
    "reviewer": {
      "displayName": "Indie Purnami"
    },
    "starRating": "FIVE",
    "comment": "Had my facials and sis botox, we really enjoy our time and the staff so accommodating ! Couldn\u0027t get any better!!",
    "createTime": "2025-04-04T07:22:50.242246Z",
    "updateTime": "2025-04-04T07:22:50.242246Z",
    "reviewReply": {
      "comment": "Thank you so much for your lovely review! We’re thrilled to hear that you enjoyed your facials and Botox treatments, and that our staff made you feel so comfortable and accommodated. We truly appreciate your kind words and are so happy to know that your experience couldn’t have been any better. We can’t wait to welcome you back for more amazing treatments!",
      "updateTime": "2025-04-08T10:03:17.653462Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNJX2FmQVVREAE"
  }, {
    "reviewer": {
      "displayName": "Philip Mowforth"
    },
    "starRating": "FIVE",
    "comment": "Tini and prima where amazing and took me through all the steps well",
    "createTime": "2025-04-04T05:08:53.663876Z",
    "updateTime": "2025-04-04T05:08:53.663876Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We’re so happy to hear that Tini and Prima provided you with an amazing experience and guided you through every step of your treatment. We truly appreciate your kind words and can’t wait to welcome you back for more fantastic treatments!",
      "updateTime": "2025-04-08T10:03:36.756745Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNJdllUdXR3RRAB"
  }, {
    "reviewer": {
      "displayName": "giulia Musini"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) I had a wonderful facial (Cocoon Signature 360) with Tini. In addition to a deep and rejuvenating facial, I also received an incredible shoulder, arm, and hand massage.\nI will definitely be back for a full-body massage and will definitely ask for Tini again; she\u0027s amazing.\nIf you want professional treatment in a clean, modern setting with expert staff... this is the place!\n\n(Original)\nHo fatto un meraviglioso trattamento viso (cocoon signature 360) con Tini. Oltre a una pulizia viso profonda e ringiovanente mi è stato anche fatto un massaggio spalle, braccia e mani incredibile.\nTornerò sicuramente per un massaggio full body e chiederò sicuramente ancora di Tini che è pazzesca.\nSe volete prendervi cura di voi in modo professionale, in un luogo pulito, moderno e con persone esperte… questo è il posto giusto!",
    "createTime": "2025-04-04T04:46:14.724322Z",
    "updateTime": "2025-04-04T04:46:14.724322Z",
    "reviewReply": {
      "comment": "Thank you so much for your wonderful review! We are so happy that you had such a positive experience with the Cocoon Signature 360 ​​facial and that Tini made you feel so pampered. It is great to hear that you had such a good time and that our environment left a good impression on you. We look forward to welcoming you again for a full body massage!",
      "updateTime": "2025-04-08T10:04:40.347961Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNJM2JmS0p3EAE"
  }, {
    "reviewer": {
      "displayName": "Deborah Vanderhoek"
    },
    "starRating": "FIVE",
    "comment": "Had a divine facial  as k here at Cocoon, my go to for everything beauty. Abd very excited to tip up on my skin care products too.",
    "createTime": "2025-04-03T08:52:29.862489Z",
    "updateTime": "2025-04-03T08:52:29.862489Z",
    "reviewReply": {
      "comment": "Thank you so much for your lovely review! We’re thrilled to hear that you had a divine facial and that Cocoon is your go-to for all your beauty needs. It’s fantastic to know you’re excited to try our skincare products too. We can’t wait to welcome you back for more amazing treatments and to continue helping you with your beauty journey!",
      "updateTime": "2025-04-08T10:05:06.885528Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNJMmVPa1J3EAE"
  }, {
    "reviewer": {
      "displayName": "Michael Swandana"
    },
    "starRating": "FIVE",
    "comment": "Best Botox in Canggu",
    "createTime": "2025-04-03T07:36:51.609347Z",
    "updateTime": "2025-04-03T07:36:51.609347Z",
    "reviewReply": {
      "comment": "Thank you so much for your fantastic review! We\u0027re thrilled to hear that you had the best Botox experience in Canggu with us. Your satisfaction is our top priority, and we can’t wait to welcome you back for more amazing treatments in the future!",
      "updateTime": "2025-04-08T10:05:37.218364Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNJbWI3VU1BEAE"
  }]
}