{
  "reviews": [{
    "reviewer": {
      "displayName": "M F"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) A very nice doctor. Dr. Eva gave me very good advice and even advised me against certain treatments that wouldn\u0027t have much effect. I\u0027m excited to see the results. 5 stars 🤍\nNurse Kathleen also did a great job; she\u0027s so lovely. See you soon :)\n\n(Original)\nGanz liebe Ärztin. Dr Eva sie hat mich sehr gut beraten und mir auch von gewissen behandlungen abgeraten, die nicht viel bringen würden. Ich bin auf das Ergebnis gespannt. 5 Sterne 🤍\nSchwester Kathleen hat ebenfalls ihren job so toll gemacht sie ist so ne liebe, bis bald :)",
    "createTime": "2025-04-19T06:16:52.293555Z",
    "updateTime": "2025-05-13T16:06:41.542088Z",
    "reviewReply": {
      "comment": "Hi M F, Thank you so much for your kind words and 5-star review! We\u0027re so glad to hear that Dr. Eva provided you with honest, helpful advice and that you\u0027re excited about your results. We\u0027ll be sure to pass along your lovely feedback to her! and we are looking forward on welcoming you back here in Cocoon. \n\n-Cocoon Team",
      "updateTime": "2025-04-26T01:59:51.632983Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNvbmF5akhREAE"
  }, {
    "reviewer": {
      "displayName": "Jessica Alexandra"
    },
    "starRating": "FIVE",
    "comment": "Whether you’re in Bali for a relaxing getaway or just need a little self-care, I highly recommend treating yourself to a facial here. Pure indulgence and worth every moment\n\nI haven’t had a facial in a while so I was thrilled to finally try Cocoon’s Hydra facial at their new spot in Canggu\n\nFrom the moment I walked in, I was greeted with warm smiles, calming scents, and a serene atmosphere that instantly put me at ease\n\nI left with my skin feeling deeply nourished, refreshed, and glowing 🌞🌟",
    "createTime": "2025-05-12T04:49:56.382250Z",
    "updateTime": "2025-05-12T04:49:56.382250Z",
    "reviewReply": {
      "comment": "Hi Jessica, Thank you so much for your glowing recommendation! We\u0027re delighted to hear that your Hydra facial at our new Canggu location was a truly indulgent and refreshing experience. It’s wonderful that our warm welcome and peaceful atmosphere helped you feel right at home. We look forward to pampering you again soon for more moments of self-care and glow! -Cocoon Team",
      "updateTime": "2025-05-27T02:54:24.634963Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VNSFBpNk9DamF5UU5BEAE"
  }, {
    "reviewer": {
      "displayName": "Stefanie Voncken"
    },
    "starRating": "FIVE",
    "comment": "I Booked a package youthful detox.\nTini gave me the best cellulitis treatment, it really works ( now 2 day after my treatment and see a big difference)\nTini is really professional and knows very well what she is doing!\nAfter I had a colon clean with Kathleen, very good, knows her work. I definitely would recommend this clinic",
    "createTime": "2025-05-11T03:19:30.372706Z",
    "updateTime": "2025-05-11T03:19:30.372706Z",
    "reviewReply": {
      "comment": "Hi Stefanie, Thank you so much for sharing your experience! We\u0027re thrilled to hear that Tini\u0027s cellulite treatment made such a noticeable difference and that Kathleen provided excellent care during your colon cleanse. Your recommendation means a lot to us, and we look forward to welcoming you back for more treatments soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:55:00.799148Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VLeU1fZWF0M09fdThnRRAB"
  }, {
    "reviewer": {
      "displayName": "Natasha Ning"
    },
    "starRating": "FIVE",
    "comment": "Dr Eva, Tini and winda were so helpful! I came last min and they managed to slot me in for facial. My skin feels smooth and bright now\n10/10",
    "createTime": "2025-05-10T09:16:01.134717Z",
    "updateTime": "2025-05-10T09:16:01.134717Z",
    "reviewReply": {
      "comment": "Hi Natasha, Thank you so much for your kind words! We\u0027re happy we could accommodate you last minute and that Dr. Eva, Tini, and Winda took great care of you. So glad your skin feels smooth and bright — 10/10 means the world to us! We look forward to welcoming you back soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:55:22.304519Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VNN1loY25BeEx6WVlBEAE"
  }, {
    "reviewer": {
      "displayName": "Jennifer Doak"
    },
    "starRating": "FIVE",
    "comment": "Had such a lovely facial with Tini! She spent so much time taking care of me and giving me a beautiful experience.\nI had Botox with Dr Eva who was super professional and made sure I was happy with the price I was paying before we went ahead. Will be returning ☺️",
    "createTime": "2025-05-08T04:48:22.377332Z",
    "updateTime": "2025-05-08T04:48:22.377332Z",
    "reviewReply": {
      "comment": "Hi Jennifer, Thank you so much for your wonderful feedback! We\u0027re delighted to hear that Tini gave you such a lovely facial experience and that Dr. Eva made you feel comfortable and informed throughout your Botox treatment. We look forward to welcoming you back soon for more care and pampering! -Cocoon Team",
      "updateTime": "2025-05-27T02:55:56.272665Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VQLWpwWmo5NUkzQlpnEAE"
  }, {
    "reviewer": {
      "displayName": "Allie"
    },
    "starRating": "FIVE",
    "comment": "Really great facial that left me feeling relaxed and my face glowing! They were running late and offered me a session on a grounding mat while I was waiting which I really appreciated.\n\nSpecial thanks to Miranda and Tini 💜",
    "createTime": "2025-05-08T04:03:46.535802Z",
    "updateTime": "2025-05-08T04:03:46.535802Z",
    "reviewReply": {
      "comment": "Hi Allie, Thank you so much for your kind words! We\u0027re glad to hear your facial left you feeling relaxed and glowing. It’s great that Miranda and Tini made your experience special, and we’re happy the grounding mat helped during the wait. We look forward to welcoming you back soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:57:25.322257Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJenVyN2VCcWFxOXF3RRAB"
  }, {
    "reviewer": {
      "displayName": "Dee Duncan"
    },
    "starRating": "FIVE",
    "comment": "The spa was super clean and relaxing.  Great experience and attentive and professional staff. I had the package with the colonic, IV, foot massage and sauna. Kathleen and Tini was awesome. Thank you both 🥰.\nDonna",
    "createTime": "2025-05-07T11:11:47.774681Z",
    "updateTime": "2025-05-07T11:11:47.774681Z",
    "reviewReply": {
      "comment": "Hi Dee, Thank you so much, Donna! We’re thrilled to hear you enjoyed your entire package and that Kathleen and Tini took such great care of you. It means a lot to us that you felt relaxed and well looked after. We look forward to welcoming you back soon!  - Cocoon Team",
      "updateTime": "2025-05-27T02:57:50.005770Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VLdksxTHZQM2NMMkxnEAE"
  }, {
    "reviewer": {
      "displayName": "Gabby Svencis"
    },
    "starRating": "FIVE",
    "comment": "So easy to make a booking! Miranda was so helpful and responsive, I can’t wait for my treatment",
    "createTime": "2025-05-06T12:30:26.109557Z",
    "updateTime": "2025-05-06T12:30:26.109557Z",
    "reviewReply": {
      "comment": "Hi Gabby, Thank you for your kind words! We\u0027re so glad Miranda made your booking easy and enjoyable. We can\u0027t wait to welcome you for your treatment soon! - Cocoon Team",
      "updateTime": "2025-05-27T02:58:52.533105Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VQTDJnS0cxOE12ZV9nRRAB"
  }, {
    "reviewer": {
      "displayName": "Sabrina Brown"
    },
    "starRating": "FIVE",
    "comment": "Just had the most incredible PRP treatment at Cocoon Medical Spa in Canggu and I couldn’t be happier with the experience! I booked the full-face, neck, and chest PRP session and was so impressed with the professionalism, cleanliness, and care from start to finish.\n\nThe staff made me feel completely at ease — they explained every step of the process in detail and were so gentle during the treatment. My practitioner was skilled, precise, and clearly experienced in PRP, which made me feel completely safe and relaxed throughout.\n\nWhat made it even better? The soothing LED light therapy mask at the end — the perfect way to finish off such a rejuvenating session. My skin already feels firmer and more radiant, and I can’t wait to see the results over the next few weeks.\n\nHighly recommend Cocoon to anyone looking for advanced aesthetic treatments with a touch of luxury. I’ll definitely be back!",
    "createTime": "2025-05-06T04:45:47.340113Z",
    "updateTime": "2025-05-06T04:45:47.340113Z",
    "reviewReply": {
      "comment": "Hi Sabrina, Thank you so much for sharing your incredible PRP experience! We\u0027re thrilled to hear that from the detailed explanations to the gentle care, you felt comfortable and well looked after throughout your session. The LED light therapy is indeed a perfect finishing touch, and we’re so happy your skin is already feeling firmer and radiant. Your recommendation means the world to us, and we can’t wait to welcome you back for more luxurious treatments soon! - Cocoon Team",
      "updateTime": "2025-05-27T02:59:57.132077Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VPX1VzS2lDOHZUYzdBRRAB"
  }, {
    "reviewer": {
      "displayName": "will sabatini"
    },
    "starRating": "FIVE",
    "comment": "Great experience did the Telax package with Colonic, infra red sauna and massage. Got rid of tons of blockage so coming back for sure. Super clean and very friendly staff.",
    "createTime": "2025-05-05T05:05:30.982638Z",
    "updateTime": "2025-05-05T05:05:30.982638Z",
    "reviewReply": {
      "comment": "Hi Will, Thank you for sharing your experience! We\u0027re so glad the Relax Me Gold Detox package left you feeling refreshed and rejuvenated. It’s wonderful to hear that you appreciated the cleanliness and friendliness of our team. We look forward to welcoming you back for your next visit! -Cocoon Team",
      "updateTime": "2025-05-06T03:49:19.692170Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNZaVpDWUR3EAE"
  }, {
    "reviewer": {
      "displayName": "maria genovese"
    },
    "starRating": "FIVE",
    "comment": "I received RF Microneedling and Dermapen treatments at the Cocoon clinic in Canggu, and I couldn’t be happier with the experience. The office was pristine, and the staff were incredibly friendly and professional.\n\nMiranda was quick to respond to all my inquiries and made booking my treatments smooth and effortless. Dr. Eva made each session a breeze — she’s truly skilled and made me feel comfortable throughout the process.\n\nI highly recommend Cocoon in Canggu for anyone looking for high-quality med spa treatments!",
    "createTime": "2025-05-04T03:33:10.203061Z",
    "updateTime": "2025-05-04T03:33:10.203061Z",
    "reviewReply": {
      "comment": "Hi Maria, Thank you so much for your glowing review! We’re thrilled to hear you had such a positive experience with your RF Microneedling and Dermapen treatments at our Canggu clinic. We\u0027re especially happy to know Miranda and Dr. Eva helped make everything smooth and comfortable for you—your kind words mean a lot to our team. We truly appreciate your recommendation and look forward to seeing you again soon! -Cocoon Team",
      "updateTime": "2025-05-06T03:53:08.928759Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNZbHIyckt3EAE"
  }, {
    "reviewer": {
      "displayName": "Karina Manik"
    },
    "starRating": "FIVE",
    "comment": "I recently indulged in the 24K Gold Facial at Cocoon Medical Spa, and it was nothing short of exceptional. The treatment began with a thorough cleansing and deep exfoliation, followed by a brightening and hydration infusion using ultrasound technology. The radiofrequency session for skin tightening and LED red light therapy for rejuvenation left my skin feeling revitalized. The highlight was the gold collagen mask infused with 24K gold hyaluronic acid serum, which gave my skin a radiant glow. The session concluded with the application of Cocoon\u0027s peptide, hyaluronic acid, and collagen skincare products.\n\nThe staff were professional and attentive, ensuring a comfortable and relaxing experience throughout. The spa\u0027s serene ambiance added to the overall sense of luxury. If you\u0027re in Bali and seeking a top-tier facial treatment, I highly recommend Cocoon Medical Spa. Their range of services, from IV drips to advanced facials, caters to various wellness needs.",
    "createTime": "2025-05-03T09:46:57.586165Z",
    "updateTime": "2025-05-03T09:46:57.586165Z",
    "reviewReply": {
      "comment": "Hi Karina, Thank you so much for your incredible review! We’re so glad you enjoyed the 24K Gold Facial and that every step of the treatment left your skin glowing and revitalized. It’s wonderful to hear that our team made your experience both comfortable and luxurious. We truly appreciate your recommendation and are thrilled to know you’re satisfied with the results. We look forward to welcoming you back for more rejuvenating treatments at Cocoon! -Cocoon Team",
      "updateTime": "2025-05-06T03:54:25.458160Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VJQ0FnTUNZeXNmQ2FBEAE"
  }, {
    "reviewer": {
      "displayName": "Ewa Bereszko"
    },
    "starRating": "FIVE",
    "comment": "Great service, super friendly staff. My therapist Tini was very experienced and made excellent time for me. I will definitely be back :)",
    "createTime": "2025-05-03T04:46:38.093683Z",
    "updateTime": "2025-05-03T04:46:38.093683Z",
    "reviewReply": {
      "comment": "Hi Ewa, Thank you for your kind words! We’re so happy to hear that you had a great experience with Tini and that she made you feel well taken care of. We\u0027re proud of our friendly and experienced team, and we can’t wait to welcome you back for your next visit! -Cocoon Team",
      "updateTime": "2025-05-06T03:55:08.572800Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNZOHFTNDhnRRAB"
  }, {
    "reviewer": {
      "displayName": "Hélène Dufour"
    },
    "starRating": "FIVE",
    "comment": "Really clean salon, nice personal! I totally recommend",
    "createTime": "2025-05-02T06:18:50.013170Z",
    "updateTime": "2025-05-02T06:18:50.013170Z",
    "reviewReply": {
      "comment": "Hi Helene, Thank you for the wonderful feedback! We\u0027re so glad to hear you enjoyed the clean salon and friendly atmosphere. We truly appreciate your recommendation and look forward to seeing you again soon! -Cocoon Team",
      "updateTime": "2025-05-06T03:55:29.694692Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTUNZckkzWTRRRRAB"
  }, {
    "reviewer": {
      "displayName": "Simone"
    },
    "starRating": "FIVE",
    "comment": "Best facial in Canggu 💞💖💫",
    "createTime": "2025-04-29T07:12:50.888103Z",
    "updateTime": "2025-04-29T07:12:50.888103Z",
    "reviewReply": {
      "comment": "Hi Simone, Thank you so much for the amazing compliment! We\u0027re thrilled to hear you had the best facial experience with us in Canggu. We can’t wait to welcome you back for more luxurious treatments! -Cocoon Team",
      "updateTime": "2025-05-06T03:59:04.696956Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURvMjlXbWpBRRAB"
  }, {
    "reviewer": {
      "displayName": "Leigha Driver"
    },
    "starRating": "FIVE",
    "comment": "Beautiful clean place, the staff are so respectful kind and welcoming. Will definitely go again next time I visit Bali ☺️☺️",
    "createTime": "2025-04-29T06:29:17.993234Z",
    "updateTime": "2025-04-29T06:29:17.993234Z",
    "reviewReply": {
      "comment": "Hi Leigha, Thank you so much for your kind words! We’re delighted you enjoyed your time with us and felt comfortable in our clean, welcoming space. It was a pleasure having you, and we’ll be so happy to see you again on your next trip to Bali! -Cocoon Team",
      "updateTime": "2025-05-06T04:31:37.839724Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURvMjlLSV93RRAB"
  }, {
    "reviewer": {
      "displayName": "Melanie Palummo"
    },
    "starRating": "FIVE",
    "comment": "I got the Cocoon Signature Hydra facial. It was so relaxing. My skin looks refreshed! My therapist Tini was wonderful!",
    "createTime": "2025-04-29T04:30:45.453221Z",
    "updateTime": "2025-04-29T04:30:45.453221Z",
    "reviewReply": {
      "comment": "Hi Melanie, Thank you for sharing your experience! We\u0027re so glad you enjoyed the Cocoon Signature Hydra Facial and that your skin feels refreshed. Tini will be so happy to hear your kind words—she truly is wonderful! We look forward to welcoming you back for more pampering soon. -Cocoon Team",
      "updateTime": "2025-05-06T04:32:46.643674Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURvbTd6cjhnRRAB"
  }, {
    "reviewer": {
      "displayName": "Laura Botton"
    },
    "starRating": "FIVE",
    "comment": "I went to the Cocoon medical spa center for a hydrocolon therapy treatment. It was my first time, and obviously there was some apprehension, but Lady from the front desk staff was very welcoming.\nNurse Kathleen who followed me through the treatment was professional, welcoming and attentive to my needs, so much so that I felt comfortable and forgot about my slight apprehension, the treatment was perfect and absolutely pain free.\nI was given all the appropriate attention with subsequent adjuvant drinks and necessary recommendations for continuation.\nI also thank Miranda from the back office Who assisted me in the booking process and the follow up.\n\nThank you all for a pleasant experience that I want to repeat.",
    "createTime": "2025-04-28T03:25:13.046702Z",
    "updateTime": "2025-04-28T05:38:20.592732Z",
    "reviewReply": {
      "comment": "Hi Laura, Thank you so much for your detailed and kind review! We\u0027re thrilled to hear that your first hydrocolon therapy experience was comfortable and positive. Lady, Nurse Kathleen, and Miranda will be so happy to know they helped put you at ease and made the entire process smooth and supportive. We\u0027re grateful for your trust and look forward to welcoming you back for your next visit! -Cocoon Team",
      "updateTime": "2025-05-06T04:36:10.980961Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURvX1pHSHFBRRAB"
  }, {
    "reviewer": {
      "displayName": "Dee"
    },
    "starRating": "FIVE",
    "comment": "Amazing service. I had two different treatments skin booster with Dr Eva very good service. Also colonic with Dita was very professional and she made experience very comfortable. Miss Lady greeted at Reception with huge smile and knowledge of product. Highly recommend Canggu Cocoon Centre.",
    "createTime": "2025-04-26T02:53:17.404613Z",
    "updateTime": "2025-04-26T02:53:17.404613Z",
    "reviewReply": {
      "comment": "Hi Dee, Thank you so much for your kind words! We\u0027re delighted to hear you had a great experience with both Dr. Eva and Dita, and that Lady made you feel welcome right from the start. It’s wonderful to know you felt comfortable and well cared for throughout your treatments. We truly appreciate your recommendation and look forward to seeing you again at Cocoon Canggu! -Cocoon Team",
      "updateTime": "2025-05-06T04:36:36.536469Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURvOGRUVTF3RRAB"
  }, {
    "reviewer": {
      "displayName": "Виктория Якубец"
    },
    "starRating": "FIVE",
    "comment": "Gauri was very good and professional ❤️❤️❤️ thanks",
    "createTime": "2025-04-22T07:29:54.882017Z",
    "updateTime": "2025-04-22T07:29:54.882017Z",
    "reviewReply": {
      "comment": "Thank you so much for your kind words! ❤️ We\u0027re thrilled to hear that Gauri was able to provide you with such a professional and positive experience. We\u0027ll be sure to pass along your lovely feedback to her, and we are looking forward to welcome you back here in Cocoon\n\nRegards,\nCocoon Team",
      "updateTime": "2025-04-26T01:53:40.823955Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJQ0FnTURvdE1DLXBBRRAB"
  }]
}