{
  "reviews": [{
    "reviewer": {
      "displayName": "Nas Bosi"
    },
    "starRating": "FIVE",
    "comment": "Very professional, welcoming, hygienic, and customer-friendly service received at Cocoon Canggu today. Thanks very much Ayuk, Ria and Weby.",
    "createTime": "2025-08-13T03:04:53.445917Z",
    "updateTime": "2025-08-13T03:06:25.942583Z",
    "reviewReply": {
      "comment": "Dear Nas,\nThank you so much for sharing your experience! We’re thrilled that your visit to Cocoon Canggu felt professional, welcoming, and hygienic. \nAyuk, Ria, and Weby will be very happy to know they helped make your time with us special. We truly value your feedback and look forward to welcoming you again soon.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:51:40.766850Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2poR05EWkxXVlV5WjFoeU1FZG9MVEJwWDFGQ1NXYxAB"
  }, {
    "reviewer": {
      "displayName": "Naomi Hogan"
    },
    "starRating": "FIVE",
    "comment": "Wonderful spa and atmosphere. Ima provided an excellent treatment and there was clear communication throughout. Webi  was a great host.",
    "createTime": "2025-08-12T09:40:56.609941Z",
    "updateTime": "2025-08-12T09:40:56.609941Z",
    "reviewReply": {
      "comment": "Hi Naomi,\nThank you for your kind words! We’re so glad Ima and Weby made your visit enjoyable and that you loved the atmosphere. We look forward to seeing you again soon.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:50:01.083712Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25GU1pXSm1NbkUxUldGdWQzaE1ObEZNYlU5TloyYxAB"
  }, {
    "reviewer": {
      "displayName": "Katarina Hostakova"
    },
    "starRating": "FIVE",
    "comment": "Had a great experience at Cocoon medical spa. Tini, Weby and Ria were very professional and I have thoroughly enjoyed my massage. I will definitely be coming back for another session.",
    "createTime": "2025-08-11T10:58:27.342169Z",
    "updateTime": "2025-08-11T10:58:27.342169Z",
    "reviewReply": {
      "comment": "Hi Katarina,\nThank you for your lovely feedback! We’re so glad you enjoyed your massage with Tini, Weby, and Ria. Looking forward to welcoming you back soon.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:47:58.696921Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2psRE5FTTRUMlpGU1RoeGNuSTFkMjl2UkhSRmNrRRAB"
  }, {
    "reviewer": {
      "displayName": "Aino Korhonen"
    },
    "starRating": "FIVE",
    "comment": "Amazing experience! I’ve been to the branch in Legian years ago and it’s so nice to have one in Canggu now too:) Yumi, Weby and Ria were excellent, service was extremely friendly and I felt taken care of at all times ☺️ I had my first Colon Hydrotherapy treatment and Yumi made it super comfortable, easy breezy! Would highly recommend Medical Cocoon Spa in Canggu 🤍🫶",
    "createTime": "2025-08-11T09:40:50.197637Z",
    "updateTime": "2025-08-11T09:40:50.197637Z",
    "reviewReply": {
      "comment": "Hi Aino,\nWe truly appreciate you sharing your feedback and for continuing your Cocoon journey from Legian to Canggu! It’s wonderful to hear that Yumi, Weby, and Ria provided such excellent care and that your first Colon Hydrotherapy felt easy and comfortable. Knowing you felt supported throughout means the world to us. Thank you for recommending Cocoon Canggu, we can’t wait to welcome you back!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:46:39.583260Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tWRVgzWmxjWE5RYUVVNVNFRTNXREYyUldwaFZYYxAB"
  }, {
    "reviewer": {
      "displayName": "Rhi"
    },
    "starRating": "FIVE",
    "comment": "Had the ‘digital detox’ massage for one hour with Ayu. She was lovely and so was the massage! One hour was a good amount of time and the pressure was great. I felt so relaxed and comfortable. And served some ginger tea afterwards - fabulous. Thank you to Cacoon and Ayu! ☺️",
    "createTime": "2025-08-11T09:21:05.890708Z",
    "updateTime": "2025-08-11T09:21:05.890708Z",
    "reviewReply": {
      "comment": "Hi Rhi,\nThank you for sharing your experience! We’re so happy to hear you enjoyed the Digital Detox massage with Ayu and left feeling relaxed and comfortable. She’ll be delighted to know her care made your visit special. We’re also glad you enjoyed the ginger tea touch. Looking forward to welcoming you back soon!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:43:27.091179Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21jd1JrVlJTMGh6ZFVzMmVraFhOemxCTVVoNlluYxAB"
  }, {
    "reviewer": {
      "displayName": "Courtney Tackett"
    },
    "starRating": "FIVE",
    "comment": "Everyone was so friendly and warm. I arrived a little late and they were so understanding. I had nearly 3 hours of relaxation in this clean and gorgeous place. Tini, Ria and Weby were so amazing and would highly recommend. I will defiantly be coming back here!",
    "createTime": "2025-08-11T09:06:14.482143Z",
    "updateTime": "2025-08-11T09:06:14.482143Z",
    "reviewReply": {
      "comment": "We’re so glad you felt welcomed and cared for, even with a late arrival. It’s wonderful to hear that Tini, Ria, and Weby made your visit so relaxing and memorable. Thank you for your kind words and recommendation, we can’t wait to see you again soon!\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:42:00.398448Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21JMGNsTjZlR0oxVUhSbFVrbHlZVzVUZG5SemNuYxAB"
  }, {
    "reviewer": {
      "displayName": "joe mckenzie"
    },
    "starRating": "FIVE",
    "comment": "Great experience, amazing staff and everything in general! Easy booking process with Miranda, 100% recommend.",
    "createTime": "2025-08-09T10:26:01.611056Z",
    "updateTime": "2025-08-09T10:26:01.611056Z",
    "reviewReply": {
      "comment": "Dear Joe,\nThank you so much for your kind words! We’re thrilled to hear you had a great experience and found the staff and booking process with Miranda amazing. Your recommendation means a lot to us, and we look forward to welcoming you back soon.\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:40:58.587495Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tNd1FVSXhhVEJZWlVrMU1ucEliVGRUYUUxak9GRRAB"
  }, {
    "reviewer": {
      "displayName": "Abbie Farris"
    },
    "starRating": "FIVE",
    "comment": "I enjoyed the cocoon signature hydra facial. My technician Dita was wonderful and very thorough paying special attention to my problem areas. The entire staff at Cocoon is fabulous. I’ve had many hydrafacials all over the world and I can assure you this is legitimate. Weby and Ria made sure I was comfortable, the offered warm ginger tea at arrival and at the end of my treatment. The rooms are g lean and the machines are top notch. I’m very happy with my treatment and I look forward to booking again soon.",
    "createTime": "2025-08-09T10:09:32.220149Z",
    "updateTime": "2025-08-09T10:09:32.220149Z",
    "reviewReply": {
      "comment": "\nHi Abbie,\nThank you so much for your wonderful feedback! We’re delighted to hear that you enjoyed your Cocoon Signature HydraFacial. Dita, Weby, and Ria will be so pleased to know they made your experience special. It’s great to hear you felt cared for from start to finish, from the treatment itself to the little touches like our ginger tea. We look forward to welcoming you back for your next visit!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:39:11.461270Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25sdWExcHVNelYzWjFjeFYyWTNWalJhT0dGRk9WRRAB"
  }, {
    "reviewer": {
      "displayName": "Evelyn Pfaffenrot"
    },
    "starRating": "FIVE",
    "comment": "Tini, Ria, Weby made the experience very great! My face feels very clean",
    "createTime": "2025-08-09T09:16:00.680771Z",
    "updateTime": "2025-08-09T09:16:00.680771Z",
    "reviewReply": {
      "comment": "Dear Evelyn,\nWe’re so happy to hear that, thank you for sharing! \nTini, Ria, and Weby will be delighted to know they made your experience so enjoyable. Glad your skin feels fresh and clean , we look forward to welcoming you again soon!\n\nWarm regards,\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:35:10.941757Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tGb1ZqQTViR2xQT0Zod2FWUkpjbFl4TW1scVZFRRAB"
  }, {
    "reviewer": {
      "displayName": "Leana Penalewis"
    },
    "starRating": "FIVE",
    "comment": "Dr. Eva Ría was amazing. Very gentle handed with the microneedling and very informative about how to move forward. Didn’t try to sell me  their products or anything did what I needed!",
    "createTime": "2025-08-09T08:20:22.335671Z",
    "updateTime": "2025-08-09T08:20:22.335671Z",
    "reviewReply": {
      "comment": "Hi, Leana\n\nHi Leana,\nWe’re so glad you enjoyed your visit with Dr. Eva. Her gentle approach and clear guidance are exactly what we want every patient to experience. It’s wonderful to know you left feeling confident about your next steps without any pressure. Here’s to healthy, glowing skin ahead , we can’t wait to see your progress!\n\nWarm regards,\n\nCocoon Canggu Team",
      "updateTime": "2025-08-18T05:32:59.942572Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tsdVFUWlpWM05TZHpKR1lubHhVak5TYVRCTk1rRRAB"
  }, {
    "reviewer": {
      "displayName": "Lilo Sirène"
    },
    "starRating": "FIVE",
    "comment": "Had an amazing time by Cocoon spa, such a great team full of sweethearts! Thank you 🤍",
    "createTime": "2025-08-08T09:32:55.477040Z",
    "updateTime": "2025-08-08T09:32:55.477040Z",
    "reviewReply": {
      "comment": "Hi Lilo, Thank you so much for your sweet words! We\u0027re so happy to hear you had an amazing time at Cocoon Spa. It truly means a lot to our team to know you felt the love and care — you’re always welcome back anytime!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T10:35:25.571502Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tvNVVVTnFRMlpxWkhBM1NWQjRSMGxFYkMxR1dYYxAB"
  }, {
    "reviewer": {
      "displayName": "James Greig"
    },
    "starRating": "FIVE",
    "comment": "Extremely good and comfortable experience. Dita, Timi and Webi were fantastic",
    "createTime": "2025-08-08T08:06:27.696744Z",
    "updateTime": "2025-08-08T08:06:27.696744Z",
    "reviewReply": {
      "comment": "Hi James, Thank you for your wonderful feedback! We\u0027re so glad to hear you had such a comfortable and positive experience. Dita, Timi, and Webi will be thrilled to know they made your visit fantastic. We can’t wait to welcome you back again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T10:43:53.813945Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xwMFlYUlRWakp2WmpreVpsTkhRbGxPUTBkVGJsRRAB"
  }, {
    "reviewer": {
      "displayName": "Rosie Wilmshurst"
    },
    "starRating": "FIVE",
    "comment": "Had an amazing time with nurse Dita, Ayu and Webi. Fantastic detox treatment in Canggu. Will come again ☺️",
    "createTime": "2025-08-08T08:05:32.235972Z",
    "updateTime": "2025-08-08T08:05:32.235972Z",
    "reviewReply": {
      "comment": "Hi Rosie, Thank you so much for your lovely feedback! We\u0027re so happy to hear you had an amazing time with Nurse Dita, Ayu, and Webi. It’s great to know you enjoyed the detox treatment in Canggu — we’ll be looking forward to seeing you again soon! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T10:44:49.960349Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT21aT1JUWkNkVzlKZVU1VU1rSnpkV0UzV1VaMWRuYxAB"
  }, {
    "reviewer": {
      "displayName": "Stephs “Stephs” Svn"
    },
    "starRating": "FIVE",
    "comment": "Great place, lovely pratician, clean and new studio. Really appreciate and will come back",
    "createTime": "2025-08-08T05:57:34.271812Z",
    "updateTime": "2025-08-08T05:57:34.271812Z",
    "reviewReply": {
      "comment": "Hi Stephs, Thank you so much for your kind words! We\u0027re glad you enjoyed your visit and appreciated the clean, new space and our lovely practitioner. We truly look forward to welcoming you back again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T06:53:19.999218Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT213MGVrNTFhbUpKTlhRd01YbDZaeTEzWkdkUFduYxAB"
  }, {
    "reviewer": {
      "displayName": "Alexandre Dray"
    },
    "starRating": "FIVE",
    "comment": "Amazing place\nAmazing people",
    "createTime": "2025-08-08T05:56:52.679083Z",
    "updateTime": "2025-08-08T05:56:52.679083Z",
    "reviewReply": {
      "comment": "Hi Alexandre, Thank you so much! We\u0027re so happy to hear you had an amazing experience — it means a lot to us. Looking forward to seeing you again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T06:53:46.105946Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT25KTE5Ya3RhVk01YkVwYWFFa3dZeTFrU25SUVpIYxAB"
  }, {
    "reviewer": {
      "displayName": "Melanie Reiter"
    },
    "starRating": "FIVE",
    "comment": "My experience at this medical spa was amazing! The doctor and her assistant were incredibly attentive and made sure I felt completely comfortable throughout the entire process. I’m beyond happy with the results—everything turned out even better than I expected. I’ll definitely be coming back the next time I’m in Bali 😊",
    "createTime": "2025-08-07T13:20:47.219825Z",
    "updateTime": "2025-08-07T13:20:47.219825Z",
    "reviewReply": {
      "comment": "Hi Melanie, Thank you so much for your wonderful feedback! We\u0027re thrilled to hear that your experience was amazing and that you felt so well cared for by the doctor and her assistant. It’s fantastic to know the results exceeded your expectations — that’s exactly what we strive for! We can’t wait to welcome you back on your next trip to Bali! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T06:54:33.392856Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tkS1dGUnpUMlZNV21KUGRGaHJVV1ZUYzBkb2EzYxAB"
  }, {
    "reviewer": {
      "displayName": "Eunice"
    },
    "starRating": "FIVE",
    "comment": "Did a facial and colonic at Cocoon and it was comfortable! Clean space, helpful nurses. Thank you nurse Ima, Tini, and Webi :)",
    "createTime": "2025-08-07T08:10:49.584268Z",
    "updateTime": "2025-08-07T08:10:49.584268Z",
    "reviewReply": {
      "comment": "Hi Eunice, Thank you so much for sharing your experience! We\u0027re glad to hear you felt comfortable during your facial and colonic treatments. Nurse Ima, Tini, and Webi will be so happy to know they made a positive impact on your visit. We truly appreciate your kind words and hope to welcome you back again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T06:55:31.405850Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xaVE1scFhaMDF2ZW5wVE9EZEhhazl4VTJjNGFtYxAB"
  }, {
    "reviewer": {
      "displayName": "Ariana Lee"
    },
    "starRating": "FIVE",
    "comment": "My experience at Canggu Medical Spa was so amazing and worth it. Ayu and Weby looked after me so beautifully, they are so kind, attentive and professional. Ensuring my entire experience was well informed and comfortable. I received the diamond microdermabrasion treatment.\nI am yet to see the results but it was relaxing and my skin does feel nourished.\nVery clean and professional space.\nI will come back again\nThank you to the lovely ladies- Ayu and Weby for the amazing service.",
    "createTime": "2025-08-07T07:44:57.758520Z",
    "updateTime": "2025-08-07T07:44:57.758520Z",
    "reviewReply": {
      "comment": "Hi Ariana, Thank you so much for your kind and thoughtful feedback! We\u0027re so happy to hear that your experience at Canggu Medical Spa was amazing and that Ayu and Weby took such great care of you. They’ll be thrilled to know their kindness, attentiveness, and professionalism made you feel comfortable and well-informed throughout your treatment.\n\nWe\u0027re glad the Diamond Microdermabrasion felt nourishing and relaxing, and we look forward to welcoming you back again soon. Thank you again for your trust and lovely words! \n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T06:56:02.601680Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2kxSWFXaG9XbE5yY21aVWRscFNiazluY2poclNtYxAB"
  }, {
    "reviewer": {
      "displayName": "Celeste"
    },
    "starRating": "FIVE",
    "comment": "Webi \u0026 Ima were absolutely incredible! They made me feel so comfortable throughout my entire visit and were incredibly friendly. I’ll be recommending them to everyone visiting Bali. Thank you so much, ladies ❤️🙏🏼",
    "createTime": "2025-08-07T03:01:40.161273Z",
    "updateTime": "2025-08-07T03:01:40.161273Z",
    "reviewReply": {
      "comment": "Hi Celeste, Thank you so much for your lovely message! We\u0027re so happy to hear that Webi and Ima made your visit such a comfortable and positive experience. They’ll be overjoyed to know how much you appreciated their care and friendliness. Your recommendation means the world to us — we can’t wait to welcome you or your friends back in Bali soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T06:56:36.440205Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2xKVVMzaDNZMFEwWVdORGJscHZRMFkyWWxaV2VXYxAB"
  }, {
    "reviewer": {
      "displayName": "Anh Nguyen"
    },
    "starRating": "FIVE",
    "comment": "Great service! Felt taken care of by Nurse Ima and Wedi.",
    "createTime": "2025-08-06T09:50:07.122170Z",
    "updateTime": "2025-08-06T09:50:07.122170Z",
    "reviewReply": {
      "comment": "Hi Anh Nguyen, Thank you so much for your kind words! We\u0027re glad to hear you felt well taken care of by Nurse Ima and Wedi — they’ll be so happy to hear your feedback. We look forward to welcoming you back again soon!\n\nRegards,\nCocoon Team",
      "updateTime": "2025-08-08T06:56:55.928471Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/Ci9DQUlRQUNvZENodHljRjlvT2tKVE9HMUdaVzlhUkZjdFh6UjVSV1owZVdwWk5FRRAB"
  }]
}