{
  "reviews": [{
    "reviewer": {
      "displayName": "Billie van der Drift"
    },
    "starRating": "FIVE",
    "comment": "I had my appointment with Dr Eva. First time having Botox in Bali I was a bit nervous about it but Dr Eva and the whole team were very welcoming and professional. Dr Eva went through my needs and calculated my units as I don\u0027t like my face to be too frozen. She and her nurse did the procedure and showed me their new packet needles and Botox bottle so i knew everything was sanitary. I am excited for results but I\u0027m sure it will look great. 😃 I will be coming back!",
    "createTime": "2025-06-03T02:31:51.387723Z",
    "updateTime": "2025-06-03T02:31:51.387723Z",
    "reviewReply": {
      "comment": "Hi Billie, Thank you so much for sharing your experience! We\u0027re so glad to hear that Dr. Eva and the team helped ease your nerves and made your first Botox treatment in Bali a positive one. It\u0027s great to know you felt comfortable, informed, and confident in the cleanliness and professionalism of the process. We\u0027re excited for you to see the results and look forward to welcoming you back soon! 😊 - Cocoon Team",
      "updateTime": "2025-06-06T02:56:44.220437Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VQakQycnJOMzVDR1N3EAE"
  }, {
    "reviewer": {
      "displayName": "Tara InFitnitYogi"
    },
    "starRating": "FIVE",
    "comment": "It was a very pleasant and comfortable experience with Kathleen, I highly recommend cocoon medical spa.",
    "createTime": "2025-06-02T05:44:32.279408Z",
    "updateTime": "2025-06-02T05:44:32.279408Z",
    "reviewReply": {
      "comment": "Hi Tara, Thank you for your kind words! We\u0027re so pleased to hear you had a pleasant and comfortable experience with Kathleen. Your recommendation means a lot to us, and we look forward to welcoming you back to Cocoon Medical Spa soon! - Cocoon Team",
      "updateTime": "2025-06-06T03:01:21.102120Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VMZU54WnFiXy1md0pBEAE"
  }, {
    "reviewer": {
      "displayName": "Melissa Leon"
    },
    "starRating": "FIVE",
    "comment": "Had the hydrafacial. Tini was very nice in explaining everything. Great experience and results :)",
    "createTime": "2025-05-31T08:55:47.406894Z",
    "updateTime": "2025-05-31T08:55:47.406894Z",
    "reviewReply": {
      "comment": "Hi Melissa, Thank you for your lovely feedback! We\u0027re so glad you enjoyed your HydraFacial and that Tini made the experience clear and comfortable for you. We\u0027re happy you\u0027re pleased with the results and look forward to seeing you again soon! 😊 - Cocoon Team",
      "updateTime": "2025-06-06T03:02:06.340338Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VMYV8tTm5Dbk9iZzRRRRAB"
  }, {
    "reviewer": {
      "displayName": "Sophie Holmes"
    },
    "starRating": "FIVE",
    "comment": "One of the best facials I have had! Tini was so lovely and excellent. Very impressed!",
    "createTime": "2025-05-29T07:43:53.382135Z",
    "updateTime": "2025-05-29T07:43:53.382135Z",
    "reviewReply": {
      "comment": "Hi Sophie, Thank you so much for your wonderful feedback! We\u0027re thrilled to hear it was one of the best facials you\u0027ve had. Tini will be so happy to know you were impressed with her care. We look forward to welcoming you back soon! - Cocoon Team",
      "updateTime": "2025-06-06T03:13:48.173285Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VMM2o5Ym1COUlDalVREAE"
  }, {
    "reviewer": {
      "displayName": "COCONUT AVE"
    },
    "starRating": "FIVE",
    "comment": "Tini and Winda were amazing! 10/10:) I received the hydrafacial, it was incredible. Tini is very experienced, she has great technique and strong, yet soft hands. Highly recommend!",
    "createTime": "2025-05-28T03:56:30.231938Z",
    "updateTime": "2025-05-28T03:56:30.231938Z",
    "reviewReply": {
      "comment": "Hi Coconut Ave, Thank you so much for your fantastic review! We\u0027re thrilled to hear you had such an incredible HydraFacial experience with Tini and Winda. Your kind words about Tini’s technique and care mean a lot to us. We truly appreciate your recommendation and look forward to seeing you again soon! 😊 - Cocoon Team",
      "updateTime": "2025-06-06T03:17:38.326871Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VPR2dpdHk5aDUySUVBEAE"
  }, {
    "reviewer": {
      "displayName": "Beatriz Alejandre Orduña"
    },
    "starRating": "FIVE",
    "comment": "Professional service and good attendance",
    "createTime": "2025-05-27T10:04:08.396106Z",
    "updateTime": "2025-05-27T10:04:08.396106Z",
    "reviewReply": {
      "comment": "Hi Beatriz, Thank you for your kind feedback! We’re glad you were pleased with the professional service and attentive care. We look forward to welcoming you back soon! - Cocoon Team",
      "updateTime": "2025-06-06T03:18:33.935463Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VMR3NySVQ3aVB1YjJRRRAB"
  }, {
    "reviewer": {
      "displayName": "Film Luar (Luar Klinghofer Bar Dov)"
    },
    "starRating": "FIVE",
    "comment": "Incredible service, so kind. I was a bit scared about my treatment as it’s a bit invasive and Dita did everything to make me feel so at ease. I felt comfortable at all times. Thank you so much!",
    "createTime": "2025-05-27T09:00:46.242025Z",
    "updateTime": "2025-05-27T09:00:46.242025Z",
    "reviewReply": {
      "comment": "Hi Film, Thank you so much for your kind words! We\u0027re so glad to hear that Dita was able to make you feel comfortable and supported throughout your treatment. It\u0027s completely natural to feel a bit nervous, and we\u0027re happy she helped put you at ease. We truly appreciate your feedback and hope to welcome you back again soon! - Cocoon Team",
      "updateTime": "2025-06-06T03:21:16.449960Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VOMlYwWnZ0OExubGJnEAE"
  }, {
    "reviewer": {
      "displayName": "loulou metcalfe"
    },
    "starRating": "FIVE",
    "comment": "The doctor was super knowledgeable and professional. I had RF micro needling and the treatment was slightly uncomfortable but not painful. They took great care of me. Would 100% recommend.",
    "createTime": "2025-05-27T03:23:38.374769Z",
    "updateTime": "2025-05-27T03:23:38.374769Z",
    "reviewReply": {
      "comment": "Hi Loulou, Thank you for your kind feedback! We\u0027re glad to hear you felt well cared for during your RF microneedling treatment and appreciate your recommendation. We understand some discomfort is normal, and we\u0027re happy it was manageable for you. Looking forward to seeing you again soon! - Cocoon Team",
      "updateTime": "2025-06-06T03:21:44.143129Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VPcmd0NV9aeUsyVTdBRRAB"
  }, {
    "reviewer": {
      "displayName": "Lucy Morrow"
    },
    "starRating": "FIVE",
    "comment": "I had the best experience here and best Botox!",
    "createTime": "2025-05-26T05:54:03.865334Z",
    "updateTime": "2025-05-26T05:54:03.865334Z",
    "reviewReply": {
      "comment": "Hi Lucy, Thank you so much for your kind words! We\u0027re so happy to hear you had the best experience and loved your Botox results. It means a lot to us — we look forward to seeing you again soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:46:50.978974Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VPbmU4YmpaeXRqN1NBEAE"
  }, {
    "reviewer": {
      "displayName": "Chloe Coffey"
    },
    "starRating": "FIVE",
    "comment": "Most amazing facial! Saw cocoon spa online and was so excited and lived up to expectations. Tini was amazing and so was Winda on reception. Would reccomend to anyone looking for a fabulous facial in Canguu 🥰",
    "createTime": "2025-05-24T03:34:04.036960Z",
    "updateTime": "2025-05-24T03:34:04.036960Z",
    "reviewReply": {
      "comment": "Hi Chloe, Thank you so much for your amazing feedback! We\u0027re thrilled to hear your facial lived up to your expectations — Tini and Winda will be so happy to hear your kind words. It means a lot to know you’d recommend us, and we can’t wait to welcome you back for another fabulous experience in Canggu! -Cocoon Team",
      "updateTime": "2025-05-27T02:47:22.423962Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VLbWdxTERrX1ByRjNnRRAB"
  }, {
    "reviewer": {
      "displayName": "Anastasia Seledkova"
    },
    "starRating": "FIVE",
    "comment": "Amazing service. I had Hydra facial, it was very relaxing and refreshing. Special thanks to specialist Tini. Very professional",
    "createTime": "2025-05-21T03:40:58.638726Z",
    "updateTime": "2025-05-21T03:40:58.638726Z",
    "reviewReply": {
      "comment": "Hi Anastasia, Thank you so much for your kind words! We\u0027re delighted to hear you enjoyed your HydraFacial and left feeling relaxed and refreshed. Tini will be so pleased to know her professionalism made your experience special. We look forward to welcoming you back soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:48:00.402273Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VNdVhtWkR6elluT1VnEAE"
  }, {
    "reviewer": {
      "displayName": "Alayna Duda"
    },
    "starRating": "FIVE",
    "comment": "I had the diamond microdermabrasion with Tini, she explained everything she was doing and my overall experience was fantastic and my skin feels so smooth! Thank you cocoon I can’t wait to come back for more treatments!",
    "createTime": "2025-05-20T08:04:52.880651Z",
    "updateTime": "2025-05-20T08:04:52.880651Z",
    "reviewReply": {
      "comment": "Hi Alayna, Thank you so much for sharing your experience! We\u0027re thrilled to hear you loved your diamond microdermabrasion with Tini — she’ll be so happy to know her care and clear explanations made a difference. We\u0027re glad your skin feels amazing, and we can\u0027t wait to welcome you back for more treatments soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:49:15.543607Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VMekx1ckxnNFBmU2ZBEAE"
  }, {
    "reviewer": {
      "displayName": "Julia Lindner"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) Very good treatment with Tini \u0026 Dr. Eva. Thank you!\n\n(Original)\nVery good treatment with Tini \u0026 Dr. Eva. Terima Kasih!",
    "createTime": "2025-05-20T03:36:38.788883Z",
    "updateTime": "2025-05-20T03:36:38.788883Z",
    "reviewReply": {
      "comment": "Hi Julia, Thank you so much for your kind words! We\u0027re glad to hear you had a great treatment with Tini and Dr. Eva. Terima kasih kembali! We look forward to seeing you again soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:50:00.920050Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VNZWItTUtodmNmX1NBEAE"
  }, {
    "reviewer": {
      "displayName": "Stacey Imrei"
    },
    "starRating": "FIVE",
    "comment": "The spa is beautiful, the staff are incredibly professional, kind and accommodating. Kathleen\u0027s massage is incredible!",
    "createTime": "2025-05-19T05:48:12.872568Z",
    "updateTime": "2025-05-19T05:48:12.872568Z",
    "reviewReply": {
      "comment": "Thank you so much for your lovely feedback! We\u0027re delighted to hear that you enjoyed your time at our spa and that our team made you feel welcome and cared for. We\u0027re especially happy to hear you loved your massage with Kathleen—she’s truly amazing at what she does! We look forward to welcoming you back soon - Cocoon Team",
      "updateTime": "2025-05-20T02:54:04.907131Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VLN0MzX2l4ai1LZDV3RRAB"
  }, {
    "reviewer": {
      "displayName": "Hamza Hamou-Tahra"
    },
    "starRating": "FIVE",
    "comment": "I had an amazing massage with Tini and Diah — both were incredibly skilled, attentive, and made me feel completely relaxed from the moment I arrived. Tini’s technique was firm yet soothing, working out deep tension I didn’t even realize I had, it made the whole experience feel truly restorative.\n\nDiah was very nice and made the whole experience smooth\n\nThe space was clean, peaceful, and beautifully set up for relaxation. I left feeling refreshed, rebalanced, and grateful. Highly recommend both Tini and Diah — I’ll definitely be coming back!",
    "createTime": "2025-05-17T08:09:35.376610Z",
    "updateTime": "2025-05-17T08:09:35.376610Z",
    "reviewReply": {
      "comment": "Hi hamza, Thank you so much for your beautifully written feedback! We\u0027re absolutely thrilled to hear that your massage with Tini and Diah left you feeling refreshed and rebalanced. Both of them take great pride in creating a deeply relaxing and restorative experience, and your kind words mean a lot. We\u0027re also happy you appreciated the peaceful environment — it\u0027s designed with care for exactly that purpose. We can’t wait to welcome you back soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:50:37.352076Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VJMkQwS2FUNjcza2h3RRAB"
  }, {
    "reviewer": {
      "displayName": "Adele Sargant"
    },
    "starRating": "FIVE",
    "comment": "Amazing experience at Cocoon Medical Spa. I had my first Colon Hydrotherapy and something very private was made easy and extremely comfortable by Dita. I then had a 1-hour massage by Tini that was just divine! Highly recommend this spa, from the moment you arrive being greeted by the friendly receptionist. 5-star for sure!",
    "createTime": "2025-05-16T05:56:46.529381Z",
    "updateTime": "2025-05-16T05:56:46.529381Z",
    "reviewReply": {
      "comment": "Hi Adele, Thank you so much for sharing your amazing experience at Cocoon Medical Spa! We\u0027re delighted to hear that Dita made your first Colon Hydrotherapy comfortable and easy, and that Tini’s massage was divine. Our team takes great pride in providing a welcoming and professional environment from the moment you arrive. Your 5-star recommendation means the world to us — we can’t wait to welcome you back soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:51:21.107416Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VObmM0TGlvM2J1SkJ3EAE"
  }, {
    "reviewer": {
      "displayName": "Georgie Ricks"
    },
    "starRating": "FIVE",
    "comment": "Loved it! The facial was incredible I’m a new woman",
    "createTime": "2025-05-15T03:33:13.992850Z",
    "updateTime": "2025-05-15T03:33:13.992850Z",
    "reviewReply": {
      "comment": "Hi Georgie, Thank you so much! We\u0027re thrilled to hear your facial left you feeling like a new woman. Can\u0027t wait to pamper you again soon! -Cocoon Team",
      "updateTime": "2025-05-27T02:52:23.010580Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VPWHBfc1dfcjVqMUNnEAE"
  }, {
    "reviewer": {
      "displayName": "Davinia Fielding-Cooke"
    },
    "starRating": "FIVE",
    "comment": "I had an amazing facial with Tini, I loved that they used a gold collagen mask with an LED mask. I felt so fresh afterwards!",
    "createTime": "2025-05-14T09:47:01.136196Z",
    "updateTime": "2025-05-14T09:47:01.136196Z",
    "reviewReply": {
      "comment": "Hi Davinia, Thank you so much for sharing your experience! We\u0027re delighted to hear you enjoyed your facial with Tini and loved the gold collagen and LED masks. It\u0027s wonderful that you left feeling so fresh — we look forward to welcoming you back soon for another rejuvenating treatment! -Cocoon Team",
      "updateTime": "2025-05-27T02:52:45.936416Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChZDSUhNMG9nS0VMRFN0NEd6bVpfcFBnEAE"
  }, {
    "reviewer": {
      "displayName": "Elaine Tanikromo"
    },
    "starRating": "FIVE",
    "comment": "(Translated by Google) This was my first colonic irrigation. After a week of juice and water fasting, I felt it was necessary to thoroughly flush my bowels and remove all the waste.\nKathleen (the nurse) put me at ease, explained everything well, and was very patient.\nDefinitely recommended. I\u0027ve booked another session.\n\n(Original)\nDit was mijn eerste darmspoeling behandeling. Na een week juice en water vasten,  leek het me nodig om de darmen goed te spoelen en van alle afvalstoffen te ontdoen.\nKathleen (verpleegster) stelde me op me gemak, legde alles goed uit en was erg geduldig.\nZeker een aanrader. Heb wederom een sessie geboekt.",
    "createTime": "2025-05-07T06:34:33.836962Z",
    "updateTime": "2025-05-14T04:53:42.634323Z",
    "reviewReply": {
      "comment": "Hi Elaine, Thank you for sharing your experience! We\u0027re glad Kathleen was able to make your first colonic treatment comfortable and easy to understand. It’s wonderful to hear you felt well cared for and that you’ve already booked your next session. We look forward to supporting you on your wellness journey! - Cocoon Team",
      "updateTime": "2025-05-27T02:53:17.516809Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VMbm5vX0tWLTRxWnJ3RRAB"
  }, {
    "reviewer": {
      "displayName": "Hunges"
    },
    "starRating": "FIVE",
    "comment": "I had an amazing experience at this medical spa! The entire team is so professional, knowledgeable, and welcoming. I came in for the Body Shape Package, which included a Cellulite Massage, VS+ Machines, Body Wrap, and Infrared Sauna and it was absolutely wonderful.\n\nTini took such great care of me throughout the treatments. She was kind, attentive, and made sure I was comfortable every step of the way. I also had a fantastic consultation with Ifa, who really listened to my concerns and created a plan that fit my goals perfectly.\n\nI’m already looking forward to coming back and trying more of their advanced treatments like microneedling and lasers. Highly recommend this place for anyone looking for top-tier care and results!",
    "createTime": "2025-05-14T03:42:19.087301Z",
    "updateTime": "2025-05-14T03:42:19.087301Z",
    "reviewReply": {
      "comment": "Hi Hunges, Thank you so much for your wonderful feedback! We’re thrilled to hear you had such an amazing experience with our Body Shape Package and that Tini and Ifa took excellent care of you throughout. It means a lot that you felt listened to and supported in achieving your goals. We can’t wait to welcome you back for microneedling, lasers, and more advanced treatments soon. Your recommendation truly means the world to us! -Cocoon Team",
      "updateTime": "2025-05-27T02:53:53.837477Z"
    },
    "name": "accounts/109616517437403268640/locations/5135673551050654657/reviews/ChdDSUhNMG9nS0VMM3oyYktteW9LUzFRRRAB"
  }]
}